{
  "doc_id": "pages_104_106",
  "text": "82\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n360\n400\n440\n480\n520\n560\n600\n640\n680\n720\n760\nr\ng\nb\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n360\n400\n440\n480\n520\n560\n600\n640\n680\n720\n760\nx\ny\nz\n(a)\n(b)\nFigure 2.28\nStandard CIE color matching functions: (a) ¯r(λ), ¯g(λ), ¯b(λ) color spectra\nobtained from matching pure colors to the R=700.0nm, G=546.1nm, and B=435.8nm pri-\nmaries; (b) ¯x(λ), ¯y(λ), ¯z(λ) color matching functions, which are linear combinations of the\n(¯r(λ), ¯g(λ),¯b(λ)) spectra.\n(Pure wavelength light can be obtained using either a prism or specially manufactured color\nﬁlters.) In the 1930s, the Commission Internationale d’Eclairage (CIE) standardized the RGB\nrepresentation by performing such color matching experiments using the primary colors of\nred (700.0nm wavelength), green (546.1nm), and blue (435.8nm).\nFigure 2.28 shows the results of performing these experiments with a standard observer,\ni.e., averaging perceptual results over a large number of subjects. You will notice that for\ncertain pure spectra in the blue–green range, a negative amount of red light has to be added,\ni.e., a certain amount of red has to be added to the color being matched in order to get a color\nmatch. These results also provided a simple explanation for the existence of metamers, which\nare colors with different spectra that are perceptually indistinguishable. Note that two fabrics\nor paint colors that are metamers under one light may no longer be so under different lighting.\nBecause of the problem associated with mixing negative light, the CIE also developed a\nnew color space called XYZ, which contains all of the pure spectral colors within its positive\noctant. (It also maps the Y axis to the luminance, i.e., perceived relative brightness, and maps\npure white to a diagonal (equal-valued) vector.) The transformation from RGB to XYZ is\ngiven by\n\n\nX\nY\nZ\n\n=\n1\n0.17697\n\n\n0.49\n0.31\n0.20\n0.17697\n0.81240\n0.01063\n0.00\n0.01\n0.99\n\n\n\n\nR\nG\nB\n\n.\n(2.103)\nWhile the ofﬁcial deﬁnition of the CIE XYZ standard has the matrix normalized so that the\nY value corresponding to pure red is 1, a more commonly used form is to omit the leading\n2.3 The digital camera\n83\nFigure 2.29 CIE chromaticity diagram, showing colors and their corresponding (x, y) val-\nues. Pure spectral colors are arranged around the outside of the curve.\nfraction, so that the second row adds up to one, i.e., the RGB triplet (1, 1, 1) maps to a Y value\nof 1. Linearly blending the (¯r(λ), ¯g(λ),¯b(λ)) curves in Figure 2.28a according to (2.103), we\nobtain the resulting (¯x(λ), ¯y(λ), ¯z(λ)) curves shown in Figure 2.28b. Notice how all three\nspectra (color matching functions) now have only positive values and how the ¯y(λ) curve\nmatches that of the luminance perceived by humans.\nIf we divide the XYZ values by the sum of X+Y+Z, we obtain the chromaticity coordi-\nnates\nx =\nX\nX + Y + Z , y =\nY\nX + Y + Z , z =\nZ\nX + Y + Z ,\n(2.104)\nwhich sum up to 1. The chromaticity coordinates discard the absolute intensity of a given\ncolor sample and just represent its pure color. If we sweep the monochromatic color λ pa-\nrameter in Figure 2.28b from λ = 380nm to λ = 800nm, we obtain the familiar chromaticity\ndiagram shown in Figure 2.29. This ﬁgure shows the (x, y) value for every color value per-\nceivable by most humans. (Of course, the CMYK reproduction process in this book does not\nactually span the whole gamut of perceivable colors.) The outer curved rim represents where\nall of the pure monochromatic color values map in (x, y) space, while the lower straight line,\nwhich connects the two endpoints, is known as the purple line.\nA convenient representation for color values, when we want to tease apart luminance\nand chromaticity, is therefore Yxy (luminance plus the two most distinctive chrominance\ncomponents).\nL*a*b* color space\nWhile the XYZ color space has many convenient properties, including the ability to separate\nluminance from chrominance, it does not actually predict how well humans perceive differ-\nences in color or luminance.\n84\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nBecause the response of the human visual system is roughly logarithmic (we can perceive\nrelative luminance differences of about 1%), the CIE deﬁned a non-linear re-mapping of the\nXYZ space called L*a*b* (also sometimes called CIELAB), where differences in luminance\nor chrominance are more perceptually uniform.19\nThe L* component of lightness is deﬁned as\nL∗= 116f\n\u0012 Y\nYn\n\u0013\n,\n(2.105)\nwhere Yn is the luminance value for nominal white (Fairchild 2005) and\nf(t) =\n(\nt1/3\nt > δ3\nt/(3δ2) + 2δ/3\nelse,\n(2.106)\nis a ﬁnite-slope approximation to the cube root with δ = 6/29. The resulting 0 . . . 100 scale\nroughly measures equal amounts of lightness perceptibility.\nIn a similar fashion, the a* and b* components are deﬁned as\na∗= 500\n\u0014\nf\n\u0012 X\nXn\n\u0013\n−f\n\u0012 Y\nYn\n\u0013\u0015\nand b∗= 200\n\u0014\nf\n\u0012 Y\nYn\n\u0013\n−f\n\u0012 Z\nZn\n\u0013\u0015\n,\n(2.107)\nwhere again, (Xn, Yn, Zn) is the measured white point. Figure 2.32i–k show the L*a*b*\nrepresentation for a sample color image.\nColor cameras\nWhile the preceding discussion tells us how we can uniquely describe the perceived tri-\nstimulus description of any color (spectral distribution), it does not tell us how RGB still\nand video cameras actually work. Do they just measure the amount of light at the nominal\nwavelengths of red (700.0nm), green (546.1nm), and blue (435.8nm)? Do color monitors just\nemit exactly these wavelengths and, if so, how can they emit negative red light to reproduce\ncolors in the cyan range?\nIn fact, the design of RGB video cameras has historically been based around the availabil-\nity of colored phosphors that go into television sets. When standard-deﬁnition color television\nwas invented (NTSC), a mapping was deﬁned between the RGB values that would drive the\nthree color guns in the cathode ray tube (CRT) and the XYZ values that unambiguously de-\nﬁne perceived color (this standard was called ITU-R BT.601). With the advent of HDTV and\nnewer monitors, a new standard called ITU-R BT.709 was created, which speciﬁes the XYZ\n19 Another perceptually motivated color space called L*u*v* was developed and standardized simultaneously\n(Fairchild 2005).",
  "image_path": "page_105.jpg",
  "pages": [
    104,
    105,
    106
  ]
}