{
  "doc_id": "pages_167_169",
  "text": "3.5 Pyramids and wavelets\n145\nof differently sized images and scan each one for possible faces. (Biological visual systems\nalso operate on a hierarchy of scales (Marr 1982).) Such a pyramid can also be very helpful\nin accelerating the search for an object by ﬁrst ﬁnding a smaller instance of that object at a\ncoarser level of the pyramid and then looking for the full resolution object only in the vicinity\nof coarse-level detections (Section 8.1.1). Finally, image pyramids are extremely useful for\nperforming multi-scale editing operations such as blending images while maintaining details.\nIn this section, we ﬁrst discuss good ﬁlters for changing image resolution, i.e., upsampling\n(interpolation, Section 3.5.1) and downsampling (decimation, Section 3.5.2). We then present\nthe concept of multi-resolution pyramids, which can be used to create a complete hierarchy\nof differently sized images and to enable a variety of applications (Section 3.5.3). A closely\nrelated concept is that of wavelets, which are a special kind of pyramid with higher frequency\nselectivity and other useful properties (Section 3.5.4). Finally, we present a useful application\nof pyramids, namely the blending of different images in a way that hides the seams between\nthe image boundaries (Section 3.5.5).\n3.5.1 Interpolation\nIn order to interpolate (or upsample) an image to a higher resolution, we need to select some\ninterpolation kernel with which to convolve the image,\ng(i, j) =\nX\nk,l\nf(k, l)h(i −rk, j −rl).\n(3.78)\nThis formula is related to the discrete convolution formula (3.14), except that we replace k\nand l in h() with rk and rl, where r is the upsampling rate. Figure 3.27a shows how to think\nof this process as the superposition of sample weighted interpolation kernels, one centered\nat each input sample k. An alternative mental model is shown in Figure 3.27b, where the\nkernel is centered at the output pixel value i (the two forms are equivalent). The latter form\nis sometimes called the polyphase ﬁlter form, since the kernel values h(i) can be stored as r\nseparate kernels, each of which is selected for convolution with the input samples depending\non the phase of i relative to the upsampled grid.\nWhat kinds of kernel make good interpolators? The answer depends on the application\nand the computation time involved. Any of the smoothing kernels shown in Tables 3.2 and 3.3\ncan be used after appropriate re-scaling.13 The linear interpolator (corresponding to the tent\nkernel) produces interpolating piecewise linear curves, which result in unappealing creases\nwhen applied to images (Figure 3.28a). The cubic B-spline, whose discrete 1/2-pixel sam-\npling appears as the binomial kernel in Table 3.3, is an approximating kernel (the interpolated\n13 The smoothing kernels in Table 3.3 have a unit area. To turn them into interpolating kernels, we simply scale\nthem up by the interpolation rate r.\n146\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nf(k-1)\nf(k+1)\nf(k)\ng(i)\nr·(k-1)\nr·(k+1)\nrk\ni\nf(k)h(i-rk)\nf(k-1)\nf(k+1)\nf(k)\ng(i)\nr·(k-1)\nr·(k+1)\nrk\ni\nh(i-rk)\n(a)\n(b)\nFigure 3.27\nSignal interpolation, g(i) = P\nk f(k)h(i −rk): (a) weighted summation of\ninput values; (b) polyphase ﬁlter interpretation.\nimage does not pass through the input data points) that produces soft images with reduced\nhigh-frequency detail. The equation for the cubic B-spline is easiest to derive by convolving\nthe tent function (linear B-spline) with itself.\nWhile most graphics cards use the bilinear kernel (optionally combined with a MIP-\nmap—see Section 3.5.3), most photo editing packages use bicubic interpolation. The cu-\nbic interpolant is a C1 (derivative-continuous) piecewise-cubic spline (the term “spline” is\nsynonymous with “piecewise-polynomial”)14 whose equation is\nh(x) =\n\n\n\n\n\n1 −(a + 3)x2 + (a + 2)|x|3\nif |x| < 1\na(|x| −1)(|x| −2)2\nif 1 ≤|x| < 2\n0\notherwise,\n(3.79)\nwhere a speciﬁes the derivative at x = 1 (Parker, Kenyon, and Troxel 1983). The value of\na is often set to −1, since this best matches the frequency characteristics of a sinc function\n(Figure 3.29). It also introduces a small amount of sharpening, which can be visually appeal-\ning. Unfortunately, this choice does not linearly interpolate straight lines (intensity ramps),\nso some visible ringing may occur. A better choice for large amounts of interpolation is prob-\nably a = −0.5, which produces a quadratic reproducing spline; it interpolates linear and\nquadratic functions exactly (Wolberg 1990, Section 5.4.3).\nFigure 3.29 shows the a = −1\nand a = −0.5 cubic interpolating kernel along with their Fourier transforms; Figure 3.28b\nand c shows them being applied to two-dimensional interpolation.\nSplines have long been used for function and data value interpolation because of the abil-\nity to precisely specify derivatives at control points and efﬁcient incremental algorithms for\ntheir evaluation (Bartels, Beatty, and Barsky 1987; Farin 1992, 1996). Splines are widely used\nin geometric modeling and computer-aided design (CAD) applications, although they have\n14 The term “spline” comes from the draughtsman’s workshop, where it was the name of a ﬂexible piece of wood\nor metal used to draw smooth curves.\n3.5 Pyramids and wavelets\n147\n(a)\n(b)\n(c)\n(d)\nFigure 3.28\nTwo-dimensional image interpolation: (a) bilinear; (b) bicubic (a = −1); (c)\nbicubic (a = −0.5); (d) windowed sinc (nine taps).\n-0.5\n0.0\n0.5\n1.0\n-4\n-3\n-2\n-1\n0\n1\n2\n3\n4\nwindowed-sinc\ntent\ncubic a=-0.5\ncubic a=-1\n-200\n-180\n-160\n-140\n-120\n-100\n-80\n-60\n-40\n-20\n0\n-0.5\n0.0\n0.5\nwindowed-sinc\ncubic a=-0.5\ntent\ncubic a=-1\n(a)\n(b)\nFigure 3.29 (a) Some windowed sinc functions and (b) their log Fourier transforms: raised-\ncosine windowed sinc in blue, cubic interpolators (a = −1 and a = −0.5) in green and\npurple, and tent function in brown. They are often used to perform high-accuracy low-pass\nﬁltering operations.",
  "image_path": "page_168.jpg",
  "pages": [
    167,
    168,
    169
  ]
}