{
  "doc_id": "pages_900_902",
  "text": "878\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nOztireli, C., Guennebaud, G., and Gross, M. (2008). Feature preserving point set surfaces.\nComputer Graphics Forum, 28(2):493–501.\n¨Ozuysal, M., Calonder, M., Lepetit, V., and Fua, P. (2010). Fast keypoint recognition using\nrandom ferns. IEEE Transactions on Pattern Analysis and Machine Intelligence, 32(3).\nPaglieroni, D. W. (1992). Distance transforms: Properties and machine vision applications.\nGraphical Models and Image Processing, 54(1):56–74.\nPal, C., Szeliski, R., Uyttendaele, M., and Jojic, N. (2004). Probability models for high\ndynamic range imaging. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR’2004), pp. 173–180, Washington, DC.\nPalmer, S. E. (1999). Vision Science: Photons to Phenomenology. The MIT Press, Cam-\nbridge, Massachusetts.\nPankanti, S., Bolle, R. M., and Jain, A. K. (2000). Biometrics: The future of identiﬁcation.\nComputer, 21(2):46–49.\nPapageorgiou, C. and Poggio, T. (2000). A trainable system for object detection. Interna-\ntional Journal of Computer Vision, 38(1):15–33.\nPapandreou, G. and Maragos, P. (2008). Adaptive and constrained algorithms for inverse\ncompositional active appearance model ﬁtting. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nPapenberg, N., Bruhn, A., Brox, T., Didas, S., and Weickert, J. (2006). Highly accurate\noptic ﬂow computation with theoretically justiﬁed warping. International Journal of\nComputer Vision, 67(2):141–158.\nPapert,\nS.\n(1966).\nThe Summer Vision Project.\nTechnical Report AIM-\n100,\nArtiﬁcial\nIntelligence\nGroup,\nMassachusetts\nInstitute\nof\nTechnology.\nhttp://hdl.handle.net/1721.1/6125.\nParagios, N. and Deriche, R. (2000). Geodesic active contours and level sets for the de-\ntection and tracking of moving objects. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 22(3):266–280.\nParagios, N. and Sgallari, F. (2009). Special issue on scale space and variational methods\nin computer vision. International Journal of Computer Vision, 84(2).\nParagios, N., Faugeras, O. D., Chan, T., and Schn¨orr, C. (eds). (2005). Third International\nWorkshop on Variational, Geometric, and Level Set Methods in Computer Vision (VLSM\n2005), Springer.\nParis, S. and Durand, F. (2006). A fast approximation of the bilateral ﬁlter using a signal\nprocessing approach. In Ninth European Conference on Computer Vision (ECCV 2006),\npp. 568–580.\nReferences\n879\nParis, S. and Durand, F. (2007). A topological approach to hierarchical segmentation using\nmean shift. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2007), Minneapolis, MN.\nParis, S., Kornprobst, P., Tumblin, J., and Durand, F. (2008). Bilateral ﬁltering: Theory\nand applications. Foundations and Trends in Computer Graphics and Computer Vision,\n4(1):1–73.\nPark, M., Brocklehurst, K., Collins, R. T., and Liu, Y. (2009). Deformed lattice detection in\nreal-world images using mean-shift belief propagation. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 31(10):1804–1816.\nPark, S. C., Park, M. K., and Kang, M. G. (2003). Super-resolution image reconstruction:\nA technical overview. IEEE Signal Processing Magazine, 20:21–36.\nParke, F. I. and Waters, K. (1996). Computer Facial Animation. A K Peters, Wellesley,\nMassachusetts.\nParker, J. A., Kenyon, R. V., and Troxel, D. E. (1983). Comparison of interpolating meth-\nods for image resampling. IEEE Transactions on Medical Imaging, MI-2(1):31–39.\nPattanaik, S. N., Ferwerda, J. A., Fairchild, M. D., and Greenberg, D. P. (1998). A multi-\nscale model of adaptation and spatial vision for realistic image display. In ACM SIG-\nGRAPH 1998 Conference Proceedings, pp. 287–298, Orlando.\nPauly, M., Keiser, R., Kobbelt, L. P., and Gross, M.\n(2003).\nShape modeling with\npoint-sampled geometry. ACM Transactions on Graphics (Proc. SIGGRAPH 2003),\n21(3):641–650.\nPavlidis, T. (1977). Structural Pattern Recognition. Springer-Verlag, Berlin; New York.\nPavlidis, T. and Liow, Y.-T. (1990). Integrating region growing and edge detection. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 12(3):225–233.\nPavlovi´c, V., Sharma, R., and Huang, T. S. (1997). Visual interpretation of hand gestures\nfor human-computer interaction: A review. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 19(7):677–695.\nPearl, J.\n(1988).\nProbabilistic reasoning in intelligent systems: networks of plausible\ninference. Morgan Kaufmann Publishers, Los Altos.\nPeleg, R., Ben-Ezra, M., and Pritch, Y. (2001). Omnistereo: Panoramic stereo imaging.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 23(3):279–290.\nPeleg, S. (1981). Elimination of seams from photomosaics. Computer Vision, Graphics,\nand Image Processing, 16(1):1206–1210.\n880\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nPeleg, S. and Herman, J. (1997). Panoramic mosaics by manifold projection. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR’97),\npp. 338–343, San Juan, Puerto Rico.\nPeleg, S. and Rav-Acha, A. (2006). Lucas-Kanade without iterative warping. In Interna-\ntional Conference on Image Processing (ICIP-2006), pp. 1097–1100, Atlanta.\nPeleg, S., Rousso, B., Rav-Acha, A., and Zomet, A. (2000). Mosaicing on adaptive mani-\nfolds. IEEE Transactions on Pattern Analysis and Machine Intelligence, 22(10):1144–\n1154.\nPenev, P. and Atick, J. (1996). Local feature analysis: A general statistical theory for object\nrepresentation. Network Computation and Neural Systems, 7:477–500.\nPentland, A. P. (1984). Local shading analysis. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, PAMI-6(2):170–179.\nPentland, A. P. (1986). Perceptual organization and the representation of natural form.\nArtiﬁcial Intelligence, 28(3):293–331.\nPentland, A. P. (1987). A new sense for depth of ﬁeld. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, PAMI-9(4):523–531.\nPentland, A. P. (1994). Interpolation using wavelet bases. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 16(4):410–414.\nP´erez, P., Blake, A., and Gangnet, M. (2001). JetStream: Probabilistic contour extraction\nwith particles. In Eighth International Conference on Computer Vision (ICCV 2001),\npp. 524–531, Vancouver, Canada.\nP´erez, P., Gangnet, M., and Blake, A. (2003). Poisson image editing. ACM Transactions\non Graphics (Proc. SIGGRAPH 2003), 22(3):313–318.\nPerona, P. (1995). Deformable kernels for early vision. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 17(5):488–499.\nPerona, P. and Malik, J. (1990a). Detecting and localizing edges composed of steps, peaks\nand roofs. In Third International Conference on Computer Vision (ICCV’90), pp. 52–\n57, Osaka, Japan.\nPerona, P. and Malik, J. (1990b). Scale space and edge detection using anisotropic diffu-\nsion. IEEE Transactions on Pattern Analysis and Machine Intelligence, 12(7):629–639.\nPeters, J. and Reif, U. (2008). Subdivision Surfaces. Springer.\nPetschnigg, G., Agrawala, M., Hoppe, H., Szeliski, R., Cohen, M., and Toyama, K. (2004).\nDigital photography with ﬂash and no-ﬂash image pairs. ACM Transactions on Graph-\nics (Proc. SIGGRAPH 2004), 23(3):664–672.",
  "image_path": "page_901.jpg",
  "pages": [
    900,
    901,
    902
  ]
}