{
  "doc_id": "pages_950_952",
  "text": "928\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nZach, C., Klopschitz, M., and Pollefeys, M. (2010). Disambiguating visual relations us-\ning loop constraints. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2010), San Francisco, CA.\nZach, C., Pock, T., and Bischof, H. (2007a). A duality based approach for realtime TV-L1\noptical ﬂow. In Pattern Recognition (DAGM 2007).\nZach, C., Pock, T., and Bischof, H. (2007b). A globally optimal algorithm for robust TV-\nL1 range image integration. In Eleventh International Conference on Computer Vision\n(ICCV 2007), Rio de Janeiro, Brazil.\nZanella, V. and Fuentes, O. (2004). An approach to automatic morphing of face images\nin frontal view. In Mexican International Conference on Artiﬁcial Intelligence (MICAI\n2004), pp. 679–687, Mexico City.\nZebedin, L., Bauer, J., Karner, K., and Bischof, H. (2008). Fusion of feature- and area-\nbased information for urban buildings modeling from aerial imagery. In Tenth European\nConference on Computer Vision (ECCV 2008), pp. 873–886, Marseilles.\nZelnik-Manor, L. and Perona, P. (2007). Automating joiners. In Symposium on Non Pho-\ntorealistic Animation and Rendering, Annecy.\nZhang, G., Jia, J., Wong, T.-T., and Bao, H. (2008). Recovering consistent video depth\nmaps via bundle optimization. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nZhang, J., McMillan, L., and Yu, J. (2006). Robust tracking and stereo matching under\nvariable illumination. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’2006), pp. 871–878, New York City, NY.\nZhang, J., Marszalek, M., Lazebnik, S., and Schmid, C. (2007). Local features and kernels\nfor classiﬁcation of texture and object categories: a comprehensive study. International\nJournal of Computer Vision, 73(2):213–238.\nZhang, L., Curless, B., and Seitz, S. (2003). Spacetime stereo: Shape recovery for dy-\nnamic scenes. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2003), pp. 367–374, Madison, WI.\nZhang, L., Dugas-Phocion, G., Samson, J.-S., and Seitz, S. M. (2002). Single view model-\ning of free-form scenes. Journal of Visualization and Computer Animation, 13(4):225–\n235.\nZhang, L., Snavely, N., Curless, B., and Seitz, S. M. (2004). Spacetime faces: High resolu-\ntion capture for modeling and animation. ACM Transactions on Graphics, 23(3):548–\n558.\nReferences\n929\nZhang, R., Tsai, P.-S., Cryer, J. E., and Shah, M. (1999). Shape from shading: A survey.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 21(8):690–706.\nZhang, Y. and Kambhamettu, C. (2003). On 3D scene ﬂow and structure recovery from\nmultiview image sequences. IEEE Transactions on Systems, Man, and Cybernetics,\n33(4):592–606.\nZhang, Z. (1994). Iterative point matching for registration of free-form curves and surfaces.\nInternational Journal of Computer Vision, 13(2):119–152.\nZhang, Z. (1998a). Determining the epipolar geometry and its uncertainty: A review.\nInternational Journal of Computer Vision, 27(2):161–195.\nZhang, Z. (1998b). On the optimization criteria used in two-view motion analysis. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 20(7):717–729.\nZhang, Z. (2000). A ﬂexible new technique for camera calibration. IEEE Transactions on\nPattern Analysis and Machine Intelligence, 22(11):1330–1334.\nZhang, Z. and He, L.-W. (2007). Whiteboard scanning and image enhancement. Digital\nSignal Processing, 17(2):414–432.\nZhang, Z. and Shan, Y. (2000). A progressive scheme for stereo matching. In Second\nEuropean Workshop on 3D Structure from Multiple Images of Large-Scale Environments\n(SMILE 2000), pp. 68–85, Dublin, Ireland.\nZhang, Z., Deriche, R., Faugeras, O., and Luong, Q. (1995). A robust technique for match-\ning two uncalibrated images through the recovery of the unknown epipolar geometry.\nArtiﬁcial Intelligence, 78:87–119.\nZhao, G. and Pietik¨ainen, M. (2007). Dynamic texture recognition using local binary pat-\nterns with an application to facial expressions. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 29(6):915–928.\nZhao, W., Chellappa, R., Phillips, P. J., and Rosenfeld, A. (2003). Face recognition: A\nliterature survey. ACM Computing Surveys, 35(4):399–358.\nZheng, J. Y. (1994). Acquiring 3-D models from sequences of contours. IEEE Transac-\ntions on Pattern Analysis and Machine Intelligence, 16(2):163–178.\nZheng, K. C., Kang, S. B., Cohen, M., and Szeliski, R. (2007). Layered depth panoramas.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.\nZheng, Y., Lin, S., and Kang, S. B.\n(2006).\nSingle-image vignetting correction.\nIn\nIEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2006), pp. 461–468, New York City, NY.\n930\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nZheng, Y., Yu, J., Kang, S.-B., Lin, S., and Kambhamettu, C. (2008). Single-image vi-\ngnetting correction using radial gradient symmetry. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nZheng, Y., Zhou, X. S., Georgescu, B., Zhou, S. K., and Comaniciu, D. (2006). Example\nbased non-rigid shape detection. In Ninth European Conference on Computer Vision\n(ECCV 2006), pp. 423–436.\nZheng, Y.-T., Zhao, M., Song, Y., Adam, H., Buddemeier, U., Bissacco, A., Brucher, F.,\nChua, T.-S., and Neven, H. (2009). Tour the world: building a web-scale landmark\nrecognition engine. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2009), Miami Beach, FL.\nZhong, J. and Sclaroff, S. (2003). Segmenting foreground objects from a dynamic, textured\nbackground via a robust Kalman ﬁlter. In Ninth International Conference on Computer\nVision (ICCV 2003), pp. 44–50, Nice, France.\nZhou, C., Lin, S., and Nayar, S. (2009). Coded aperture pairs for depth from defocus. In\nTwelfth International Conference on Computer Vision (ICCV 2009), Kyoto, Japan.\nZhou, Y., Gu, L., and Zhang, H.-J. (2003). Bayesian tangent shape model: Estimating\nshape and pose parameters via Bayesian inference. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR’2003), pp. 109–116, Madi-\nson, WI.\nZhu, L., Chen, Y., Lin, Y., Lin, C., and Yuille, A. (2008). Recursive segmentation and\nrecognition templates for 2D parsing. In Advances in Neural Information Processing\nSystems.\nZhu, S.-C. and Mumford, D. (2006). A stochastic grammar of images. Foundations and\nTrends in Computer Graphics and Computer Vision, 2(4).\nZhu, S. C. and Yuille, A. L. (1996). Region competition: Unifying snakes, region growing,\nand Bayes/MDL for multiband image segmentation.\nIEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 18(9):884–900.\nZhu, Z. and Kanade, T. (2008). Modeling and representations of large-scale 3D scenes.\nInternational Journal of Computer Vision, 78(2-3):119–120.\nZisserman, A., Giblin, P. J., and Blake, A. (1989). The information available to a moving\nobserver from specularities. Image and Vision Computing, 7(1):38–42.\nZitnick, C. L. and Kanade, T. (2000). A cooperative algorithm for stereo matching and\nocclusion detection. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n22(7):675–684.",
  "image_path": "page_951.jpg",
  "pages": [
    950,
    951,
    952
  ]
}