{
  "doc_id": "pages_910_912",
  "text": "888\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nRosenfeld, A. (1980). Quadtrees and pyramids for pattern recognition and image process-\ning. In Fifth International Conference on Pattern Recognition (ICPR’80), pp. 802–809,\nMiami Beach.\nRosenfeld, A. (ed.). (1984). Multiresolution Image Processing and Analysis, Springer-\nVerlag, New York.\nRosenfeld, A. and Davis, L. S. (1979). Image segmentation and image models. Proceed-\nings of the IEEE, 67(5):764–772.\nRosenfeld, A. and Kak, A. C. (1976). Digital Picture Processing. Academic Press, New\nYork.\nRosenfeld, A. and Pfaltz, J. L. (1966). Sequential operations in digital picture processing.\nJournal of the ACM, 13(4):471–494.\nRosenfeld, A., Hummel, R. A., and Zucker, S. W. (1976). Scene labeling by relaxation\noperations. IEEE Transactions on Systems, Man, and Cybernetics, SMC-6:420–433.\nRosten, E. and Drummond, T. (2005). Fusing points and lines for high performance track-\ning. In Tenth International Conference on Computer Vision (ICCV 2005), pp. 1508–\n1515, Beijing, China.\nRosten, E. and Drummond, T. (2006). Machine learning for high-speed corner detection.\nIn Ninth European Conference on Computer Vision (ECCV 2006), pp. 430–443.\nRoth, S. and Black, M. J. (2007a). On the spatial statistics of optical ﬂow. International\nJournal of Computer Vision, 74(1):33–50.\nRoth, S. and Black, M. J. (2007b). Steerable random ﬁelds. In Eleventh International\nConference on Computer Vision (ICCV 2007), Rio de Janeiro, Brazil.\nRoth, S. and Black, M. J. (2009). Fields of experts. International Journal of Computer\nVision, 82(2):205–229.\nRother, C. (2002). A new approach for vanishing point detection in architectural environ-\nments. Image and Vision Computing, 20(9-10):647–656.\nRother, C. (2003). Linear multi-view reconstruction of points, lines, planes and cameras\nusing a reference plane. In Ninth International Conference on Computer Vision (ICCV\n2003), pp. 1210–1217, Nice, France.\nRother, C. and Carlsson, S. (2002). Linear multi view reconstruction and camera recovery\nusing a reference plane. International Journal of Computer Vision, 49(2/3):117–141.\nRother, C., Kolmogorov, V., and Blake, A. (2004). “GrabCut”—interactive foreground\nextraction using iterated graph cuts. ACM Transactions on Graphics (Proc. SIGGRAPH\n2004), 23(3):309–314.\nReferences\n889\nRother, C., Bordeaux, L., Hamadi, Y., and Blake, A. (2006). Autocollage. ACM Transac-\ntions on Graphics, 25(3):847–852.\nRother, C., Kohli, P., Feng, W., and Jia, J. (2009). Minimizing sparse higher order energy\nfunctions of discrete variables. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2009), Miami Beach, FL.\nRother, C., Kolmogorov, V., Lempitsky, V., and Szummer, M. (2007). Optimizing binary\nMRFs via extended roof duality. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nRother, C., Kumar, S., Kolmogorov, V., and Blake, A.\n(2005).\nDigital tapestry.\nIn\nIEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 589–596, San Diego, CA.\nRothganger, F., Lazebnik, S., Schmid, C., and Ponce, J.\n(2006).\n3D object modeling\nand recognition using local afﬁne-invariant image descriptors and multi-view spatial\nconstraints. International Journal of Computer Vision, 66(3):231–259.\nRousseeuw, P. J. (1984). Least median of squares regresssion. Journal of the American\nStatistical Association, 79:871–880.\nRousseeuw, P. J. and Leroy, A. M.\n(1987).\nRobust Regression and Outlier Detection.\nWiley, New York.\nRousson, M. and Paragios, N. (2008). Prior knowledge, level set representations, and visual\ngrouping. International Journal of Computer Vision, 76(3):231–243.\nRoweis, S. (1998). EM algorithms for PCA and SPCA. In Advances in Neural Information\nProcessing Systems, pp. 626–632.\nRowland, D. A. and Perrett, D. I. (1995). Manipulating facial appearance through shape\nand color. IEEE Computer Graphics and Applications, 15(5):70–76.\nRowley, H. A., Baluja, S., and Kanade, T. (1998a). Neural network-based face detection.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 20(1):23–38.\nRowley, H. A., Baluja, S., and Kanade, T. (1998b). Rotation invariant neural network-\nbased face detection. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’98), pp. 38–44, Santa Barbara.\nRoy, S. and Cox, I. J. (1998). A maximum-ﬂow formulation of the N-camera stereo corre-\nspondence problem. In Sixth International Conference on Computer Vision (ICCV’98),\npp. 492–499, Bombay.\nRozenfeld, S., Shimshoni, I., and Lindenbaum, M. (2007). Dense mirroring surface re-\ncovery from 1d homographies and sparse correspondences. In IEEE Computer Society\n890\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nConference on Computer Vision and Pattern Recognition (CVPR 2007), Minneapolis,\nMN.\nRubner, Y., Tomasi, C., and Guibas, L. J. (2000). The earth mover’s distance as a metric\nfor image retrieval. International Journal of Computer Vision, 40(2):99–121.\nRumelhart, D. E., Hinton, G. E., and Williams, R. J. (1986). Learning internal representa-\ntions by error propagation. In Rumelhart, D. E., McClelland, J. L., and the PDP research\ngroup (eds), Parallel distributed processing: Explorations in the microstructure of cog-\nnition, pp. 318–362, Bradford Books, Cambridge, Massachusetts.\nRusinkiewicz, S. and Levoy, M. (2000). Qsplat: A multiresolution point rendering system\nfor large meshes. In ACM SIGGRAPH 2000 Conference Proceedings, pp. 343–352.\nRuss, J. C. (2007). The Image Processing Handbook. CRC Press, Boca Raton, 5th edition.\nRussell, B., Efros, A., Sivic, J., Freeman, W., and Zisserman, A. (2006). Using multiple\nsegmentations to discover objects and their extent in image collections. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR’2006),\npp. 1605–1612, New York City, NY.\nRussell, B. C., Torralba, A., Murphy, K. P., and Freeman, W. T. (2008). LabelMe: A\ndatabase and web-based tool for image annotation. International Journal of Computer\nVision, 77(1-3):157–173.\nRussell, B. C., Torralba, A., Liu, C., Fergus, R., and Freeman, W. T. (2007). Object recog-\nnition by scene alignment. In Advances in Neural Information Processing Systems.\nRuzon, M. A. and Tomasi, C. (2000). Alpha estimation in natural images. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR’2000),\npp. 18–25, Hilton Head Island.\nRuzon, M. A. and Tomasi, C.\n(2001).\nEdge, junction, and corner detection using\ncolor distributions. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n23(11):1281–1295.\nRyan, T. W., Gray, R. T., and Hunt, B. R. (1980). Prediction of correlation errors in stereo-\npair images. Optical Engineering, 19(3):312–322.\nSaad, Y. (2003). Iterative Methods for Sparse Linear Systems. Society for Industrial and\nApplied Mathematics, second edition.\nSaint-Marc, P., Chen, J. S., and Medioni, G.\n(1991).\nAdaptive smoothing: A general\ntool for early vision. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n13(6):514–529.",
  "image_path": "page_911.jpg",
  "pages": [
    910,
    911,
    912
  ]
}