{
  "doc_id": "pages_872_874",
  "text": "850\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nKlaus, A., Sormann, M., and Karner, K. (2006). Segment-based stereo matching using be-\nlief propagation and a self-adapting dissimilarity measure. In International Conference\non Pattern Recognition (ICPR 2006), pp. 15–18.\nKlein, G. and Murray, D. (2007). Parallel tracking and mapping for small AR workspaces.\nIn International Symposium on Mixed and Augmented Reality (ISMAR 2007), Nara.\nKlein, G. and Murray, D. (2008). Improving the agility of keyframe-based slam. In Tenth\nEuropean Conference on Computer Vision (ECCV 2008), pp. 802–815, Marseilles.\nKlein, S., Staring, M., and Pluim, J. P. W. (2007). Evaluation of optimization methods\nfor nonrigid medical image registration using mutual information and B-splines. IEEE\nTransactions on Image Processing, 16(12):2879–2890.\nKlinker, G. J. (1993). A Physical Approach to Color Image Understanding. A K Peters,\nWellesley, Massachusetts.\nKlinker, G. J., Shafer, S. A., and Kanade, T. (1990). A physical approach to color image\nunderstanding. International Journal of Computer Vision, 4(1):7–38.\nKoch, R., Pollefeys, M., and Van Gool, L. J. (2000). Realistic surface reconstruction of\n3D scenes from uncalibrated image sequences. Journal Visualization and Computer\nAnimation, 11:115–127.\nKoenderink, J. J. (1990). Solid Shape. MIT Press, Cambridge, Massachusetts.\nKoethe, U. (2003). Integrated edge and junction detection with the boundary tensor. In\nNinth International Conference on Computer Vision (ICCV 2003), pp. 424–431, Nice,\nFrance.\nKohli, P. (2007). Minimizing Dynamic and Higher Order Energy Functions using Graph\nCuts. Ph.D. thesis, Oxford Brookes University.\nKohli, P. and Torr, P. H. S. (2005). Effciently solving dynamic Markov random ﬁelds\nusing graph cuts. In Tenth International Conference on Computer Vision (ICCV 2005),\npp. 922–929, Beijing, China.\nKohli, P. and Torr, P. H. S. (2007). Dynamic graph cuts for efﬁcient inference in markov\nrandom ﬁelds.\nIEEE Transactions on Pattern Analysis and Machine Intelligence,\n29(12):2079–2088.\nKohli, P. and Torr, P. H. S. (2008). Measuring uncertainty in graph cut solutions. Computer\nVision and Image Understanding, 112(1):30–38.\nKohli, P., Kumar, M. P., and Torr, P. H. S. (2009). P3 & beyond: Move making algorithms\nfor solving higher order functions. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 31(9):1645–1656.\nReferences\n851\nKohli, P., Ladick´y, L., and Torr, P. H. S. (2009). Robust higher order potentials for enforc-\ning label consistency. International Journal of Computer Vision, 82(3):302–324.\nKokaram, A. (2004). On missing data treatment for degraded video and ﬁlm archives: a sur-\nvey and a new Bayesian approach. IEEE Transactions on Image Processing, 13(3):397–\n415.\nKolev, K. and Cremers, D. (2008). Integration of multiview stereo and silhouettes via\nconvex functionals on convex domains. In Tenth European Conference on Computer\nVision (ECCV 2008), pp. 752–765, Marseilles.\nKolev, K. and Cremers, D. (2009). Continuous ratio optimization via convex relaxation\nwith applications to multiview 3D reconstruction. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR 2009), Miami Beach, FL.\nKolev, K., Klodt, M., Brox, T., and Cremers, D. (2009). Continuous global optimization in\nmultiview 3D reconstruction. International Journal of Computer Vision, 84(1):80–96.\nKoller, D. and Friedman, N.\n(2009).\nProbabilistic Graphical Models: Principles and\nTechniques. MIT Press, Cambridge, Massachusetts.\nKolmogorov, V. (2006). Convergent tree-reweighted message passing for energy minimiza-\ntion. IEEE Transactions on Pattern Analysis and Machine Intelligence, 28(10):1568–\n1583.\nKolmogorov, V. and Boykov, Y. (2005). What metrics can be approximated by geo-cuts,\nor global optimization of length/area and ﬂux. In Tenth International Conference on\nComputer Vision (ICCV 2005), pp. 564–571, Beijing, China.\nKolmogorov, V. and Zabih, R. (2002). Multi-camera scene reconstruction via graph cuts.\nIn Seventh European Conference on Computer Vision (ECCV 2002), pp. 82–96, Copen-\nhagen.\nKolmogorov, V. and Zabih, R. (2004). What energy functions can be minimized via graph\ncuts? IEEE Transactions on Pattern Analysis and Machine Intelligence, 26(2):147–159.\nKolmogorov, V., Criminisi, A., Blake, A., Cross, G., and Rother, C. (2006). Probabilistic\nfusion of stereo with color and contrast for bi-layer segmentation. IEEE Transactions\non Pattern Analysis and Machine Intelligence, 28(9):1480–1492.\nKomodakis, N. and Paragios, N. (2008). Beyond loose LP-relaxations: Optimizing MRFs\nby repairing cycles. In Tenth European Conference on Computer Vision (ECCV 2008),\npp. 806–820, Marseilles.\nKomodakis, N. and Tziritas, G. (2007a). Approximate labeling via graph cuts based on\nlinear programming. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n29(8):1436–1453.\n852\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nKomodakis, N. and Tziritas, G. (2007b). Image completion using efﬁcient belief prop-\nagation via priority scheduling and dynamic pruning.\nIEEE Transactions on Image\nProcessing, 29(11):2649–2661.\nKomodakis, N., Paragios, N., and Tziritas, G. (2007). MRF optimization via dual decom-\nposition: Message-passing revisited. In Eleventh International Conference on Com-\nputer Vision (ICCV 2007), Rio de Janeiro, Brazil.\nKomodakis, N., Tziritas, G., and Paragios, N. (2007). Fast, approximately optimal solu-\ntions for single and dynamic MRFs. In IEEE Computer Society Conference on Com-\nputer Vision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nKomodakis, N., Tziritas, G., and Paragios, N.\n(2008).\nPerformance vs computational\nefﬁciency for optimizing single and dynamic MRFs: Setting the state of the art with\nprimal dual strategies. Computer Vision and Image Understanding, 112(1):14–29.\nKonolige, K. (1997). Small vision systems: Hardware and implementation. In Eighth\nInternational Symposium on Robotics Research, pp. 203–212, Hayama, Japan.\nKopf, J., Cohen, M. F., Lischinski, D., and Uyttendaele, M. (2007). Joint bilateral upsam-\npling. ACM Transactions on Graphics, 26(3).\nKopf, J., Uyttendaele, M., Deussen, O., and Cohen, M. F. (2007). Capturing and viewing\ngigapixel images. ACM Transactions on Graphics, 26(3).\nKopf, J., Lischinski, D., Deussen, O., Cohen-Or, D., and Cohen, M.\n(2009).\nLocally\nadapted projections to reduce panorama distortions. Computer Graphics Forum (Pro-\nceedings of EGSR 2009), 28(4).\nKoutis, I. (2007). Combinatorial and algebraic tools for optimal multilevel algorithms.\nPh.D. thesis, Carnegie Mellon University. Technical Report CMU-CS-07-131.\nKoutis, I. and Miller, G. L. (2008). Graph partitioning into isolated, high conductance\nclusters: theory, computation and applications to preconditioning. In Symposium on\nParallel Algorithms and Architectures, pp. 137–145, Munich.\nKoutis, I., Miller, G. L., and Tolliver, D. (2009). Combinatorial preconditioners and mul-\ntilevel solvers for problems in computer vision and image processing. In 5th Interna-\ntional Symposium on Visual Computing (ISVC09), Las Vegas.\nKovar, L., Gleicher, M., and Pighin, F. (2002). Motion graphs. ACM Transactions on\nGraphics, 21(3):473–482.\nKoˇseck´a, J. and Zhang, W. (2005). Extraction, matching and pose recovery based on dom-\ninant rectangular structures. Computer Vision and Image Understanding, 100(3):174–\n293.",
  "image_path": "page_873.jpg",
  "pages": [
    872,
    873,
    874
  ]
}