{
  "doc_id": "pages_103_105",
  "text": "2.3 The digital camera\n81\n(a)\n(b)\nFigure 2.27 Primary and secondary colors: (a) additive colors red, green, and blue can be\nmixed to produce cyan, magenta, yellow, and white; (b) subtractive colors cyan, magenta,\nand yellow can be mixed to produce red, green, blue, and black.\nmore fanciful names, such as alizarin crimson, cerulean blue, and chartreuse.) The subtractive\ncolors are called subtractive because pigments in the paint absorb certain wavelengths in the\ncolor spectrum.\nLater on, you may have learned about the additive primary colors (red, green, and blue)\nand how they can be added (with a slide projector or on a computer monitor) to produce cyan,\nmagenta, yellow, white, and all the other colors we typically see on our TV sets and monitors\n(Figure 2.27a).\nThrough what process is it possible for two different colors, such as red and green, to\ninteract to produce a third color like yellow? Are the wavelengths somehow mixed up to\nproduce a new wavelength?\nYou probably know that the correct answer has nothing to do with physically mixing\nwavelengths. Instead, the existence of three primaries is a result of the tri-stimulus (or tri-\nchromatic) nature of the human visual system, since we have three different kinds of cone,\neach of which responds selectively to a different portion of the color spectrum (Glassner 1995;\nWyszecki and Stiles 2000; Fairchild 2005; Reinhard, Ward, Pattanaik et al. 2005; Livingstone\n2008).18 Note that for machine vision applications, such as remote sensing and terrain clas-\nsiﬁcation, it is preferable to use many more wavelengths. Similarly, surveillance applications\ncan often beneﬁt from sensing in the near-infrared (NIR) range.\nCIE RGB and XYZ\nTo test and quantify the tri-chromatic theory of perception, we can attempt to reproduce all\nmonochromatic (single wavelength) colors as a mixture of three suitably chosen primaries.\n18 See also Mark Fairchild’s Web page, http://www.cis.rit.edu/fairchild/WhyIsColor/books links.html.\n82\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n360\n400\n440\n480\n520\n560\n600\n640\n680\n720\n760\nr\ng\nb\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n360\n400\n440\n480\n520\n560\n600\n640\n680\n720\n760\nx\ny\nz\n(a)\n(b)\nFigure 2.28\nStandard CIE color matching functions: (a) ¯r(λ), ¯g(λ), ¯b(λ) color spectra\nobtained from matching pure colors to the R=700.0nm, G=546.1nm, and B=435.8nm pri-\nmaries; (b) ¯x(λ), ¯y(λ), ¯z(λ) color matching functions, which are linear combinations of the\n(¯r(λ), ¯g(λ),¯b(λ)) spectra.\n(Pure wavelength light can be obtained using either a prism or specially manufactured color\nﬁlters.) In the 1930s, the Commission Internationale d’Eclairage (CIE) standardized the RGB\nrepresentation by performing such color matching experiments using the primary colors of\nred (700.0nm wavelength), green (546.1nm), and blue (435.8nm).\nFigure 2.28 shows the results of performing these experiments with a standard observer,\ni.e., averaging perceptual results over a large number of subjects. You will notice that for\ncertain pure spectra in the blue–green range, a negative amount of red light has to be added,\ni.e., a certain amount of red has to be added to the color being matched in order to get a color\nmatch. These results also provided a simple explanation for the existence of metamers, which\nare colors with different spectra that are perceptually indistinguishable. Note that two fabrics\nor paint colors that are metamers under one light may no longer be so under different lighting.\nBecause of the problem associated with mixing negative light, the CIE also developed a\nnew color space called XYZ, which contains all of the pure spectral colors within its positive\noctant. (It also maps the Y axis to the luminance, i.e., perceived relative brightness, and maps\npure white to a diagonal (equal-valued) vector.) The transformation from RGB to XYZ is\ngiven by\n\n\nX\nY\nZ\n\n=\n1\n0.17697\n\n\n0.49\n0.31\n0.20\n0.17697\n0.81240\n0.01063\n0.00\n0.01\n0.99\n\n\n\n\nR\nG\nB\n\n.\n(2.103)\nWhile the ofﬁcial deﬁnition of the CIE XYZ standard has the matrix normalized so that the\nY value corresponding to pure red is 1, a more commonly used form is to omit the leading\n2.3 The digital camera\n83\nFigure 2.29 CIE chromaticity diagram, showing colors and their corresponding (x, y) val-\nues. Pure spectral colors are arranged around the outside of the curve.\nfraction, so that the second row adds up to one, i.e., the RGB triplet (1, 1, 1) maps to a Y value\nof 1. Linearly blending the (¯r(λ), ¯g(λ),¯b(λ)) curves in Figure 2.28a according to (2.103), we\nobtain the resulting (¯x(λ), ¯y(λ), ¯z(λ)) curves shown in Figure 2.28b. Notice how all three\nspectra (color matching functions) now have only positive values and how the ¯y(λ) curve\nmatches that of the luminance perceived by humans.\nIf we divide the XYZ values by the sum of X+Y+Z, we obtain the chromaticity coordi-\nnates\nx =\nX\nX + Y + Z , y =\nY\nX + Y + Z , z =\nZ\nX + Y + Z ,\n(2.104)\nwhich sum up to 1. The chromaticity coordinates discard the absolute intensity of a given\ncolor sample and just represent its pure color. If we sweep the monochromatic color λ pa-\nrameter in Figure 2.28b from λ = 380nm to λ = 800nm, we obtain the familiar chromaticity\ndiagram shown in Figure 2.29. This ﬁgure shows the (x, y) value for every color value per-\nceivable by most humans. (Of course, the CMYK reproduction process in this book does not\nactually span the whole gamut of perceivable colors.) The outer curved rim represents where\nall of the pure monochromatic color values map in (x, y) space, while the lower straight line,\nwhich connects the two endpoints, is known as the purple line.\nA convenient representation for color values, when we want to tease apart luminance\nand chromaticity, is therefore Yxy (luminance plus the two most distinctive chrominance\ncomponents).\nL*a*b* color space\nWhile the XYZ color space has many convenient properties, including the ability to separate\nluminance from chrominance, it does not actually predict how well humans perceive differ-\nences in color or luminance.",
  "image_path": "page_104.jpg",
  "pages": [
    103,
    104,
    105
  ]
}