{
  "doc_id": "pages_902_904",
  "text": "880\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nPeleg, S. and Herman, J. (1997). Panoramic mosaics by manifold projection. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR’97),\npp. 338–343, San Juan, Puerto Rico.\nPeleg, S. and Rav-Acha, A. (2006). Lucas-Kanade without iterative warping. In Interna-\ntional Conference on Image Processing (ICIP-2006), pp. 1097–1100, Atlanta.\nPeleg, S., Rousso, B., Rav-Acha, A., and Zomet, A. (2000). Mosaicing on adaptive mani-\nfolds. IEEE Transactions on Pattern Analysis and Machine Intelligence, 22(10):1144–\n1154.\nPenev, P. and Atick, J. (1996). Local feature analysis: A general statistical theory for object\nrepresentation. Network Computation and Neural Systems, 7:477–500.\nPentland, A. P. (1984). Local shading analysis. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, PAMI-6(2):170–179.\nPentland, A. P. (1986). Perceptual organization and the representation of natural form.\nArtiﬁcial Intelligence, 28(3):293–331.\nPentland, A. P. (1987). A new sense for depth of ﬁeld. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, PAMI-9(4):523–531.\nPentland, A. P. (1994). Interpolation using wavelet bases. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 16(4):410–414.\nP´erez, P., Blake, A., and Gangnet, M. (2001). JetStream: Probabilistic contour extraction\nwith particles. In Eighth International Conference on Computer Vision (ICCV 2001),\npp. 524–531, Vancouver, Canada.\nP´erez, P., Gangnet, M., and Blake, A. (2003). Poisson image editing. ACM Transactions\non Graphics (Proc. SIGGRAPH 2003), 22(3):313–318.\nPerona, P. (1995). Deformable kernels for early vision. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 17(5):488–499.\nPerona, P. and Malik, J. (1990a). Detecting and localizing edges composed of steps, peaks\nand roofs. In Third International Conference on Computer Vision (ICCV’90), pp. 52–\n57, Osaka, Japan.\nPerona, P. and Malik, J. (1990b). Scale space and edge detection using anisotropic diffu-\nsion. IEEE Transactions on Pattern Analysis and Machine Intelligence, 12(7):629–639.\nPeters, J. and Reif, U. (2008). Subdivision Surfaces. Springer.\nPetschnigg, G., Agrawala, M., Hoppe, H., Szeliski, R., Cohen, M., and Toyama, K. (2004).\nDigital photography with ﬂash and no-ﬂash image pairs. ACM Transactions on Graph-\nics (Proc. SIGGRAPH 2004), 23(3):664–672.\nReferences\n881\nPﬁster, H., Zwicker, M., van Baar, J., and Gross, M. (2000). Surfels: Surface elements as\nrendering primitives. In ACM SIGGRAPH 2000 Conference Proceedings, pp. 335–342.\nPﬂugfelder, R. (2008). Self-calibrating Cameras in Video Surveillance. Ph.D. thesis, Graz\nUniversity of Technology.\nPhilbin, J. and Zisserman, A. (2008). Object mining using a matching graph on very large\nimage collections.\nIn Indian Conference on Computer Vision, Graphics and Image\nProcessing, Bhubaneswar, India.\nPhilbin, J., Chum, O., Isard, M., Sivic, J., and Zisserman, A. (2007). Object retrieval with\nlarge vocabularies and fast spatial matching. In IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nPhilbin, J., Chum, O., Sivic, J., Isard, M., and Zisserman, A. (2008). Lost in quantization:\nImproving particular object retrieval in large scale image databases. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR 2008),\nAnchorage, AK.\nPhillips, P. J., Moon, H., Rizvi, S. A., and Rauss, P. J. (2000). The FERET evaluation\nmethodology for face recognition algorithms. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 22(10):1090–1104.\nPhillips, P. J., Scruggs, W. T., O’Toole, A. J., Flynn, P. J., Bowyer, K. W. et al. (2010).\nFRVT 2006 and ICE 2006 large-scale experimental results. IEEE Transactions on Pat-\ntern Analysis and Machine Intelligence, 32(5):831–846.\nPhong, B. T. (1975). Illumination for computer generated pictures. Communications of the\nACM, 18(6):311–317.\nPickup, L. C. (2007). Machine Learning in Multi-frame Image Super-resolution. Ph.D.\nthesis, University of Oxford.\nPickup, L. C. and Zisserman, A. (2009). Automatic retrieval of visual continuity errors\nin movies. In ACM International Conference on Image and Video Retrieval, Santorini,\nGreece.\nPickup, L. C., Capel, D. P., Roberts, S. J., and Zisserman, A. (2007). Overcoming reg-\nistration uncertainty in image super-resolution: Maximize or marginalize? EURASIP\nJournal on Advances in Signal Processing, 2010(Article ID 23565).\nPickup, L. C., Capel, D. P., Roberts, S. J., and Zisserman, A. (2009). Bayesian methods for\nimage super-resolution. The Computer Journal, 52.\nPighin, F., Szeliski, R., and Salesin, D. H. (2002). Modeling and animating realistic faces\nfrom images. International Journal of Computer Vision, 50(2):143–169.\n882\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nPighin, F., Hecker, J., Lischinski, D., Salesin, D. H., and Szeliski, R. (1998). Synthesizing\nrealistic facial expressions from photographs. In ACM SIGGRAPH 1998 Conference\nProceedings, pp. 75–84, Orlando.\nPilet, J., Lepetit, V., and Fua, P. (2008). Fast non-rigid surface detection, registration, and\nrealistic augmentation. International Journal of Computer Vision, 76(2).\nPinz, A. (2005). Object categorization. Foundations and Trends in Computer Graphics\nand Computer Vision, 1(4):255–353.\nPizer, S. M., Amburn, E. P., Austin, J. D., Cromartie, R., Geselowitz, A. et al. (1987).\nAdaptive histogram equalization and its variations. Computer Vision, Graphics, and\nImage Processing, 39(3):355–368.\nPlatel, B., Balmachnova, E., Florack, L., and ter Haar Romeny, B. (2006). Top-points as\ninterest points for image matching. In Ninth European Conference on Computer Vision\n(ECCV 2006), pp. 418–429.\nPlatt, J. C. (2000). Optimal ﬁltering for patterned displays. IEEE Signal Processing Let-\nters, 7(7):179–180.\nPock, T., Unger, M., Cremers, D., and Bischof, H. (2008). Fast and exact solution of total\nvariation models on the GPU. In CVPR 2008 Workshop on Visual Computer Vision on\nGPUs (CVGPU), Anchorage, AK.\nPoelman, C. J. and Kanade, T. (1997). A paraperspective factorization method for shape\nand motion recovery. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n19(3):206–218.\nPoggio, T. and Koch, C. (1985). Ill-posed problems in early vision: from computational\ntheory to analogue networks. Proceedings of the Royal Society of London, B 226:303–\n323.\nPoggio, T., Gamble, E., and Little, J. (1988). Parallel integration of vision modules. Sci-\nence, 242(4877):436–440.\nPoggio, T., Torre, V., and Koch, C. (1985). Computational vision and regularization theory.\nNature, 317(6035):314–319.\nPoggio, T., Little, J., Gamble, E., Gillet, W., Geiger, D. et al. (1988). The MIT vision\nmachine. In Image Understanding Workshop, pp. 177–198, Boston.\nPolana, R. and Nelson, R. C. (1997). Detection and recognition of periodic, nonrigid\nmotion. International Journal of Computer Vision, 23(3):261–282.\nPollard, S. B., Mayhew, J. E. W., and Frisby, J. P. (1985). PMF: A stereo correspondence\nalgorithm using a disparity gradient limit. Perception, 14:449–470.",
  "image_path": "page_903.jpg",
  "pages": [
    902,
    903,
    904
  ]
}