{
  "doc_id": "pages_929_931",
  "text": "References\n907\nSzeliski, R. and Scharstein, D. (2004). Sampling the disparity space image. IEEE Trans-\nactions on Pattern Analysis and Machine Intelligence, 26(3):419–425.\nSzeliski, R. and Shum, H.-Y. (1996). Motion estimation with quadtree splines. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 18(12):1199–1210.\nSzeliski, R. and Shum, H.-Y. (1997). Creating full view panoramic image mosaics and\ntexture-mapped models. In ACM SIGGRAPH 1997 Conference Proceedings, pp. 251–\n258, Los Angeles.\nSzeliski, R. and Tonnesen, D. (1992). Surface modeling with oriented particle systems.\nComputer Graphics (SIGGRAPH ’92), 26(2):185–194.\nSzeliski, R. and Torr, P. (1998). Geometrically constrained structure from motion: Points\non planes. In European Workshop on 3D Structure from Multiple Images of Large-Scale\nEnvironments (SMILE), pp. 171–186, Freiburg, Germany.\nSzeliski, R. and Weiss, R. (1998). Robust shape recovery from occluding contours using a\nlinear smoother. International Journal of Computer Vision, 28(1):27–44.\nSzeliski, R., Avidan, S., and Anandan, P.\n(2000).\nLayer extraction from multiple im-\nages containing reﬂections and transparency. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR’2000), pp. 246–253, Hilton Head\nIsland.\nSzeliski, R., Tonnesen, D., and Terzopoulos, D. (1993a). Curvature and continuity control\nin particle-based surface models. In SPIE Vol. 2031, Geometric Methods in Computer\nVision II, pp. 172–181, San Diego.\nSzeliski, R., Tonnesen, D., and Terzopoulos, D. (1993b). Modeling surfaces of arbitrary\ntopology with dynamic particles. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR’93), pp. 82–87, New York.\nSzeliski, R., Uyttendaele, M., and Steedly, D. (2008). Fast Poisson Blending using Multi-\nSplines. Technical Report MSR-TR-2008-58, Microsoft Research.\nSzeliski, R., Winder, S., and Uyttendaele, M. (2010). High-quality multi-pass image re-\nsampling. Technical Report MSR-TR-2010-10, Microsoft Research.\nSzeliski, R., Zabih, R., Scharstein, D., Veksler, O., Kolmogorov, V., Agarwala, A., Tappen,\nM., and Rother, C. (2008). A comparative study of energy minimization methods for\nMarkov random ﬁelds with smoothness-based priors. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 30(6):1068–1080.\nSzummer, M. and Picard, R. W. (1996). Temporal texture modeling. In IEEE International\nConference on Image Processing (ICIP-96), pp. 823–826, Lausanne.\n908\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTabb, M. and Ahuja, N. (1997). Multiscale image segmentation by integrated edge and\nregion detection. IEEE Transactions on Image Processing, 6(5):642–655.\nTaguchi, Y., Wilburn, B., and Zitnick, C. L. (2008). Stereo reconstruction with mixed pixels\nusing adaptive over-segmentation. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nTanaka, M. and Okutomi, M. (2008). Locally adaptive learning for translation-variant MRF\nimage priors. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2008), Anchorage, AK.\nTao, H., Sawhney, H. S., and Kumar, R. (2001). A global matching framework for stereo\ncomputation. In Eighth International Conference on Computer Vision (ICCV 2001),\npp. 532–539, Vancouver, Canada.\nTappen, M. F. (2007). Utilizing variational optimization to learn Markov random ﬁelds.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.\nTappen, M. F. and Freeman, W. T. (2003). Comparison of graph cuts with belief propaga-\ntion for stereo, using identical MRF parameters. In Ninth International Conference on\nComputer Vision (ICCV 2003), pp. 900–907, Nice, France.\nTappen, M. F., Freeman, W. T., and Adelson, E. H. (2005). Recovering intrinsic images\nfrom a single image. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n27(9):1459–1472.\nTappen, M. F., Russell, B. C., and Freeman, W. T. (2003). Exploiting the sparse derivative\nprior for super-resolution and image demosaicing. In Third International Workshop on\nStatistical and Computational Theories of Vision, Nice, France.\nTappen, M. F., Liu, C., Freeman, W., and Adelson, E. (2007). Learning Gaussian con-\nditional random ﬁelds for low-level vision. In IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nTardif, J.-P. (2009). Non-iterative approach for fast and accurate vanishing point detection.\nIn Twelfth International Conference on Computer Vision (ICCV 2009), Kyoto, Japan.\nTardif, J.-P., Sturm, P., and Roy, S. (2007). Plane-based self-calibration of radial distortion.\nIn Eleventh International Conference on Computer Vision (ICCV 2007), Rio de Janeiro,\nBrazil.\nTardif, J.-P., Sturm, P., Trudeau, M., and Roy, S. (2009). Calibration of cameras with\nradially symmetric distortion. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 31(9):1552–1566.\nReferences\n909\nTaubin, G. (1995). Curve and surface smoothing without shrinkage. In Fifth International\nConference on Computer Vision (ICCV’95), pp. 852–857, Cambridge, Massachusetts.\nTaubman, D. S. and Marcellin, M. W. (2002). Jpeg2000: standard for interactive imaging.\nProceedings of the IEEE, 90(8):1336–1357.\nTaylor, C. J. (2003). Surface reconstruction from feature based stereo. In Ninth Interna-\ntional Conference on Computer Vision (ICCV 2003), pp. 184–190, Nice, France.\nTaylor, C. J., Debevec, P. E., and Malik, J. (1996). Reconstructing polyhedral models of\narchitectural scenes from photographs. In Fourth European Conference on Computer\nVision (ECCV’96), pp. 659–668, Cambridge, England.\nTaylor, C. J., Kriegman, D. J., and Anandan, P.\n(1991).\nStructure and motion in two\ndimensions from multiple images: A least squares approach. In IEEE Workshop on\nVisual Motion, pp. 242–248, Princeton, New Jersey.\nTaylor, P. (2009). Text-to-Speech Synthesis. Cambridge University Press, Cambridge.\nTek, K. and Kimia, B. B. (2003). Symmetry maps of free-form curve segments via wave\npropagation. International Journal of Computer Vision, 54(1-3):35–81.\nTekalp, M. (1995). Digital Video Processing. Prentice Hall, Upper Saddle River, NJ.\nTelea, A. (2004). An image inpainting technique based on fast marching method. Journal\nof Graphics Tools, 9(1):23–34.\nTeller, S., Antone, M., Bodnar, Z., Bosse, M., Coorg, S., Jethwa, M., and Master, N. (2003).\nCalibrated, registered images of an extended urban area. International Journal of Com-\nputer Vision, 53(1):93–107.\nTeodosio, L. and Bender, W. (1993). Salient video stills: Content and context preserved.\nIn ACM Multimedia 93, pp. 39–46, Anaheim, California.\nTerzopoulos, D. (1983). Multilevel computational processes for visual surface reconstruc-\ntion. Computer Vision, Graphics, and Image Processing, 24:52–96.\nTerzopoulos, D. (1986a). Image analysis using multigrid relaxation methods. IEEE Trans-\nactions on Pattern Analysis and Machine Intelligence, PAMI-8(2):129–139.\nTerzopoulos, D.\n(1986b).\nRegularization of inverse visual problems involving discon-\ntinuities.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, PAMI-\n8(4):413–424.\nTerzopoulos, D. (1988). The computation of visible-surface representations. IEEE Trans-\nactions on Pattern Analysis and Machine Intelligence, PAMI-10(4):417–438.\nTerzopoulos, D. (1999). Visual modeling for computer animation: Graphics with a vision.\nComputer Graphics, 33(4):42–45.",
  "image_path": "page_930.jpg",
  "pages": [
    929,
    930,
    931
  ]
}