{
  "doc_id": "pages_355_357",
  "text": "6.3 Geometric intrinsic calibration\n333\nKi and Kj,\n˜\nHij = KiRiR−1\nj K−1\nj\n= KiRijK−1\nj .\n(6.52)\nThe simplest way to obtain the calibration is to use the simpliﬁed form of the calibra-\ntion matrix (2.59), where we assume that the pixels are square and the optical center lies at\nthe center of the image, i.e., Kk = diag(fk, fk, 1). (We number the pixel coordinates ac-\ncordingly, i.e., place pixel (x, y) = (0, 0) at the center of the image.) We can then rewrite\nEquation (6.52) as\nR10 ∼K−1\n1\n˜\nH10K0 ∼\n\n\nh00\nh01\nf −1\n0 h02\nh10\nh11\nf −1\n0 h12\nf1h20\nf1h21\nf −1\n0 f1h22\n\n,\n(6.53)\nwhere hij are the elements of ˜\nH10.\nUsing the orthonormality properties of the rotation matrix R10 and the fact that the right\nhand side of (6.53) is known only up to a scale, we obtain\nh2\n00 + h2\n01 + f −2\n0 h2\n02 = h2\n10 + h2\n11 + f −2\n0 h2\n12\n(6.54)\nand\nh00h10 + h01h11 + f −2\n0 h02h12 = 0.\n(6.55)\nFrom this, we can compute estimates for f0 of\nf 2\n0 =\nh2\n12 −h2\n02\nh2\n00 + h2\n01 −h2\n10 −h2\n11\nif h2\n00 + h2\n01 ̸= h2\n10 + h2\n11\n(6.56)\nor\nf 2\n0 = −\nh02h12\nh00h10 + h01h11\nif h00h10 ̸= −h01h11.\n(6.57)\n(Note that the equations originally given by Szeliski and Shum (1997) are erroneous; the\ncorrect equations are given by Shum and Szeliski (2000).) If neither of these conditions\nholds, we can also take the dot products between the ﬁrst (or second) row and the third one.\nSimilar results can be obtained for f1 as well, by analyzing the columns of ˜\nH10. If the focal\nlength is the same for both images, we can take the geometric mean of f0 and f1 as the\nestimated focal length f = √f1f0. When multiple estimates of f are available, e.g., from\ndifferent homographies, the median value can be used as the ﬁnal estimate.\nA more general (upper-triangular) estimate of K can be obtained in the case of a ﬁxed-\nparameter camera Ki = K using the technique of Hartley (1997b). Observe from (6.52)\nthat Rij ∼K−1 ˜\nHijK and R−T\nij\n∼KT ˜\nH\n−T\nij K−T . Equating Rij = R−T\nij\nwe obtain\nK−1 ˜\nHijK ∼KT ˜\nH\n−T\nij K−T , from which we get\n˜\nHij(KKT ) ∼(KKT ) ˜\nH\n−T\nij .\n(6.58)\n334\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nThis provides us with some homogeneous linear constraints on the entries in A = KKT ,\nwhich is known as the dual of the image of the absolute conic (Hartley 1997b; Hartley and\nZisserman 2004). (Recall that when we estimate a homography, we can only recover it up to\nan unknown scale.) Given a sufﬁcient number of independent homography estimates ˜\nHij,\nwe can recover A (up to a scale) using either SVD or eigenvalue analysis and then recover\nK through Cholesky decomposition (Appendix A.1.4). Extensions to the cases of temporally\nvarying calibration parameters and non-stationary cameras are discussed by Hartley, Hayman,\nde Agapito et al. (2000) and de Agapito, Hayman, and Reid (2001).\nThe quality of the intrinsic camera parameters can be greatly increased by constructing a\nfull 360◦panorama, since mis-estimating the focal length will result in a gap (or excessive\noverlap) when the ﬁrst image in the sequence is stitched to itself (Figure 9.5). The resulting\nmis-alignment can be used to improve the estimate of the focal length and to re-adjust the\nrotation estimates, as described in Section 9.1.4. Rotating the camera by 90◦around its optic\naxis and re-shooting the panorama is a good way to check for aspect ratio and skew pixel\nproblems, as is generating a full hemi-spherical panorama when there is sufﬁcient texture.\nUltimately, however, the most accurate estimate of the calibration parameters (including\nradial distortion) can be obtained using a full simultaneous non-linear minimization of the\nintrinsic and extrinsic (rotation) parameters, as described in Section 9.2.\n6.3.5 Radial distortion\nWhen images are taken with wide-angle lenses, it is often necessary to model lens distor-\ntions such as radial distortion. As discussed in Section 2.1.6, the radial distortion model\nsays that coordinates in the observed images are displaced away from (barrel distortion) or\ntowards (pincushion distortion) the image center by an amount proportional to their radial\ndistance (Figure 2.13a–b). The simplest radial distortion models use low-order polynomials\n(c.f. Equation (2.78)),\nˆx\n=\nx(1 + κ1r2 + κ2r4)\nˆy\n=\ny(1 + κ1r2 + κ2r4),\n(6.59)\nwhere r2 = x2 + y2 and κ1 and κ2 are called the radial distortion parameters (Brown 1971;\nSlama 1980).13\nA variety of techniques can be used to estimate the radial distortion parameters for a\ngiven lens.14 One of the simplest and most useful is to take an image of a scene with a lot\n13 Sometimes the relationship between x and ˆx is expressed the other way around, i.e., using primed (ﬁnal)\ncoordinates on the right-hand side, x = ˆx(1 + κ1ˆr2 + κ2ˆr4). This is convenient if we map image pixels into\n(warped) rays and then undistort the rays to obtain 3D rays in space, i.e., if we are using inverse warping.\n14 Some of today’s digital cameras are starting to remove radial distortion using software in the camera itself.\n6.4 Additional reading\n335\nof straight lines, especially lines aligned with and near the edges of the image. The radial\ndistortion parameters can then be adjusted until all of the lines in the image are straight,\nwhich is commonly called the plumb-line method (Brown 1971; Kang 2001; El-Melegy and\nFarag 2003). Exercise 6.10 gives some more details on how to implement such a technique.\nAnother approach is to use several overlapping images and to combine the estimation\nof the radial distortion parameters with the image alignment process, i.e., by extending the\npipeline used for stitching in Section 9.2.1. Sawhney and Kumar (1999) use a hierarchy\nof motion models (translation, afﬁne, projective) in a coarse-to-ﬁne strategy coupled with\na quadratic radial distortion correction term. They use direct (intensity-based) minimiza-\ntion to compute the alignment. Stein (1997) uses a feature-based approach combined with\na general 3D motion model (and quadratic radial distortion), which requires more matches\nthan a parallax-free rotational panorama but is potentially more general. More recent ap-\nproaches sometimes simultaneously compute both the unknown intrinsic parameters and the\nradial distortion coefﬁcients, which may include higher-order terms or more complex rational\nor non-parametric forms (Claus and Fitzgibbon 2005; Sturm 2005; Thirthala and Pollefeys\n2005; Barreto and Daniilidis 2005; Hartley and Kang 2005; Steele and Jaynes 2006; Tardif,\nSturm, Trudeau et al. 2009).\nWhen a known calibration target is being used (Figure 6.8), the radial distortion estima-\ntion can be folded into the estimation of the other intrinsic and extrinsic parameters (Zhang\n2000; Hartley and Kang 2007; Tardif, Sturm, Trudeau et al. 2009). This can be viewed as\nadding another stage to the general non-linear minimization pipeline shown in Figure 6.5\nbetween the intrinsic parameter multiplication box f C and the perspective division box f P.\n(See Exercise 6.11 on more details for the case of a planar calibration target.)\nOf course, as discussed in Section 2.1.6, more general models of lens distortion, such as\nﬁsheye and non-central projection, may sometimes be required. While the parameterization\nof such lenses may be more complicated (Section 2.1.6), the general approach of either us-\ning calibration rigs with known 3D positions or self-calibration through the use of multiple\noverlapping images of a scene can both be used (Hartley and Kang 2007; Tardif, Sturm, and\nRoy 2007). The same techniques used to calibrate for radial distortion can also be used to\nreduce the amount of chromatic aberration by separately calibrating each color channel and\nthen warping the channels to put them back into alignment (Exercise 6.12).\n6.4 Additional reading\nHartley and Zisserman (2004) provide a wonderful introduction to the topics of feature-based\nalignment and optimal motion estimation, as well as an in-depth discussion of camera cali-\nbration and pose estimation techniques.",
  "image_path": "page_356.jpg",
  "pages": [
    355,
    356,
    357
  ]
}