{
  "doc_id": "pages_417_419",
  "text": "8.1 Translational alignment\n395\nxi\nxi+u\nu\ni\n(a)\n(b)\n(c)\nFigure 8.3\nAperture problems for different image regions, denoted by the orange and red\nL-shaped structures, overlaid in the same image to make it easier to diagram the ﬂow. (a) A\nwindow w(xi) centered at xi (black circle) can uniquely be matched to its corresponding\nstructure at xi +u in the second (red) image. (b) A window centered on the edge exhibits the\nclassic aperture problem, since it can be matched to a 1D family of possible locations. (c) In\na completely textureless region, the matches become totally unconstrained.\nConditioning and aperture problems.\nSometimes, the inversion of the linear system (8.39)\ncan be poorly conditioned because of lack of two-dimensional texture in the patch being\naligned. A commonly occurring example of this is the aperture problem, ﬁrst identiﬁed in\nsome of the early papers on optical ﬂow (Horn and Schunck 1981) and then studied more ex-\ntensively by Anandan (1989). Consider an image patch that consists of a slanted edge moving\nto the right (Figure 8.3). Only the normal component of the velocity (displacement) can be\nreliably recovered in this case. This manifests itself in (8.39) as a rank-deﬁcient matrix A,\ni.e., one whose smaller eigenvalue is very close to zero.9\nWhen Equation (8.39) is solved, the component of the displacement along the edge is very\npoorly conditioned and can result in wild guesses under small noise perturbations. One way\nto mitigate this problem is to add a prior (soft constraint) on the expected range of motions\n(Simoncelli, Adelson, and Heeger 1991; Baker, Gross, and Matthews 2004; Govindu 2006).\nThis can be accomplished by adding a small value to the diagonal of A, which essentially\nbiases the solution towards smaller ∆u values that still (mostly) minimize the squared error.\nHowever, the pure Gaussian model assumed when using a simple (ﬁxed) quadratic prior,\nas in (Simoncelli, Adelson, and Heeger 1991), does not always hold in practice, e.g., because\nof aliasing along strong edges (Triggs 2004). For this reason, it may be prudent to add some\nsmall fraction (say, 5%) of the larger eigenvalue to the smaller one before doing the matrix\ninversion.\n9The matrix A is by construction always guaranteed to be symmetric positive semi-deﬁnite, i.e., it has real\nnon-negative eigenvalues.\n396\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\nFigure 8.4\nSSD surfaces corresponding to three locations (red crosses) in an image:\n(a) highly textured area, strong minimum, low uncertainty; (b) strong edge, aperture prob-\nlem, high uncertainty in one direction; (c) weak texture, no clear minimum, large uncertainty.\n8.1 Translational alignment\n397\nUncertainty modeling.\nThe reliability of a particular patch-based motion estimate can be\ncaptured more formally with an uncertainty model. The simplest such model is a covariance\nmatrix, which captures the expected variance in the motion estimate in all possible directions.\nAs discussed in Section 6.1.4 and Appendix B.6, under small amounts of additive Gaussian\nnoise, it can be shown that the covariance matrix Σu is proportional to the inverse of the\nHessian A,\nΣu = σ2\nnA−1,\n(8.44)\nwhere σ2\nn is the variance of the additive Gaussian noise (Anandan 1989; Matthies, Kanade,\nand Szeliski 1989; Szeliski 1989).\nFor larger amounts of noise, the linearization performed by the Lucas–Kanade algorithm\nin (8.35) is only approximate, so the above quantity becomes a Cramer–Rao lower bound on\nthe true covariance. Thus, the minimum and maximum eigenvalues of the Hessian A can now\nbe interpreted as the (scaled) inverse variances in the least-certain and most-certain directions\nof motion. (A more detailed analysis using a more realistic model of image noise is given by\nSteele and Jaynes (2005).) Figure 8.4 shows the local SSD surfaces for three different pixel\nlocations in an image. As you can see, the surface has a clear minimum in the highly textured\nregion and suffers from the aperture problem near the strong edge.\nBias and gain, weighting, and robust error metrics.\nThe Lucas–Kanade update rule can\nalso be applied to the bias–gain equation (8.9) to obtain\nELK−BG(u + ∆u) =\nX\ni\n[J1(xi + u)∆u + ei −αI0(xi) −β]2\n(8.45)\n(Lucas and Kanade 1981; Gennert 1988; Fuh and Maragos 1991; Baker, Gross, and Matthews\n2003). The resulting 4 × 4 system of equations can be solved to simultaneously estimate the\ntranslational displacement update ∆u and the bias and gain parameters β and α.\nA similar formulation can be derived for images (templates) that have a linear appearance\nvariation,\nI1(x + u) ≈I0(x) +\nX\nj\nλjBj(x),\n(8.46)\nwhere the Bj(x) are the basis images and the λj are the unknown coefﬁcients (Hager and\nBelhumeur 1998; Baker, Gross, Ishikawa et al. 2003; Baker, Gross, and Matthews 2003).\nPotential linear appearance variations include illumination changes (Hager and Belhumeur\n1998) and small non-rigid deformations (Black and Jepson 1998).\nA weighted (windowed) version of the Lucas–Kanade algorithm is also possible:\nELK−WSSD(u + ∆u) =\nX\ni\nw0(xi)w1(xi + u)[J1(xi + u)∆u + ei]2.\n(8.47)",
  "image_path": "page_418.jpg",
  "pages": [
    417,
    418,
    419
  ]
}