{
  "doc_id": "pages_912_914",
  "text": "890\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nConference on Computer Vision and Pattern Recognition (CVPR 2007), Minneapolis,\nMN.\nRubner, Y., Tomasi, C., and Guibas, L. J. (2000). The earth mover’s distance as a metric\nfor image retrieval. International Journal of Computer Vision, 40(2):99–121.\nRumelhart, D. E., Hinton, G. E., and Williams, R. J. (1986). Learning internal representa-\ntions by error propagation. In Rumelhart, D. E., McClelland, J. L., and the PDP research\ngroup (eds), Parallel distributed processing: Explorations in the microstructure of cog-\nnition, pp. 318–362, Bradford Books, Cambridge, Massachusetts.\nRusinkiewicz, S. and Levoy, M. (2000). Qsplat: A multiresolution point rendering system\nfor large meshes. In ACM SIGGRAPH 2000 Conference Proceedings, pp. 343–352.\nRuss, J. C. (2007). The Image Processing Handbook. CRC Press, Boca Raton, 5th edition.\nRussell, B., Efros, A., Sivic, J., Freeman, W., and Zisserman, A. (2006). Using multiple\nsegmentations to discover objects and their extent in image collections. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR’2006),\npp. 1605–1612, New York City, NY.\nRussell, B. C., Torralba, A., Murphy, K. P., and Freeman, W. T. (2008). LabelMe: A\ndatabase and web-based tool for image annotation. International Journal of Computer\nVision, 77(1-3):157–173.\nRussell, B. C., Torralba, A., Liu, C., Fergus, R., and Freeman, W. T. (2007). Object recog-\nnition by scene alignment. In Advances in Neural Information Processing Systems.\nRuzon, M. A. and Tomasi, C. (2000). Alpha estimation in natural images. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR’2000),\npp. 18–25, Hilton Head Island.\nRuzon, M. A. and Tomasi, C.\n(2001).\nEdge, junction, and corner detection using\ncolor distributions. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n23(11):1281–1295.\nRyan, T. W., Gray, R. T., and Hunt, B. R. (1980). Prediction of correlation errors in stereo-\npair images. Optical Engineering, 19(3):312–322.\nSaad, Y. (2003). Iterative Methods for Sparse Linear Systems. Society for Industrial and\nApplied Mathematics, second edition.\nSaint-Marc, P., Chen, J. S., and Medioni, G.\n(1991).\nAdaptive smoothing: A general\ntool for early vision. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n13(6):514–529.\nReferences\n891\nSaito, H. and Kanade, T. (1999). Shape reconstruction in projective grid space from large\nnumber of images. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’99), pp. 49–54, Fort Collins.\nSamet, H. (1989). The Design and Analysis of Spatial Data Structures. Addison-Wesley,\nReading, Massachusetts.\nSander, P. T. and Zucker, S. W. (1990). Inferring surface trace and differential structure\nfrom 3-D images. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n12(9):833–854.\nSapiro, G. (2001). Geometric Partial Differential Equations and Image Analysis. Cam-\nbridge University Press.\nSato, Y. and Ikeuchi, K. (1996). Reﬂectance analysis for 3D computer graphics model\ngeneration. Graphical Models and Image Processing, 58(5):437–451.\nSato, Y., Wheeler, M., and Ikeuchi, K. (1997). Object shape and reﬂectance modeling\nfrom observation. In ACM SIGGRAPH 1997 Conference Proceedings, pp. 379–387,\nLos Angeles.\nSavarese, S. and Fei-Fei, L. (2007). 3D generic object categorization, localization and pose\nestimation. In Eleventh International Conference on Computer Vision (ICCV 2007),\nRio de Janeiro, Brazil.\nSavarese, S. and Fei-Fei, L. (2008). View synthesis for recognizing unseen poses of object\nclasses. In Tenth European Conference on Computer Vision (ECCV 2008), pp. 602–615,\nMarseilles.\nSavarese, S., Chen, M., and Perona, P. (2005). Local shape from mirror reﬂections. Inter-\nnational Journal of Computer Vision, 64(1):31–67.\nSavarese, S., Andreetto, M., Rushmeier, H. E., Bernardini, F., and Perona, P. (2007). 3D re-\nconstruction by shadow carving: Theory and practical evaluation. International Journal\nof Computer Vision, 71(3):305–336.\nSawhney, H. S. (1994). Simplifying motion and structure analysis using planar parallax and\nimage warping. In Twelfth International Conference on Pattern Recognition (ICPR’94),\npp. 403–408, Jerusalem, Israel.\nSawhney, H. S. and Ayer, S. (1996). Compact representation of videos through domi-\nnant multiple motion estimation. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 18(8):814–830.\nSawhney, H. S. and Hanson, A. R. (1991). Identiﬁcation and 3D description of ‘shallow’\nenvironmental structure over a sequence of images. In IEEE Computer Society Con-\n892\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nference on Computer Vision and Pattern Recognition (CVPR’91), pp. 179–185, Maui,\nHawaii.\nSawhney, H. S. and Kumar, R. (1999). True multi-image alignment and its application to\nmosaicing and lens distortion correction. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 21(3):235–243.\nSawhney, H. S., Kumar, R., Gendel, G., Bergen, J., Dixon, D., and Paragano, V. (1998).\nVideoBrush: Experiences with consumer video mosaicing. In IEEE Workshop on Ap-\nplications of Computer Vision (WACV’98), pp. 56–62, Princeton.\nSawhney, H. S., Arpa, A., Kumar, R., Samarasekera, S., Aggarwal, M., Hsu, S., Nister, D.,\nand Hanna, K. (2002). Video ﬂashlights: real time rendering of multiple videos for\nimmersive model visualization. In Proceedings of the 13th Eurographics Workshop on\nRendering, pp. 157–168, Pisa, Italy.\nSaxena, A., Sun, M., and Ng, A. Y. (2009). Make3D: Learning 3D scene structure from\na single still image. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n31(5):824–840.\nSchaffalitzky, F. and Zisserman, A. (2000). Planar grouping for automatic detection of\nvanishing lines and points. Image and Vision Computing, 18:647–658.\nSchaffalitzky, F. and Zisserman, A. (2002). Multi-view matching for unordered image\nsets, or “How do I organize my holiday snaps?”. In Seventh European Conference on\nComputer Vision (ECCV 2002), pp. 414–431, Copenhagen.\nScharr, H., Black, M. J., and Haussecker, H. W. (2003). Image statistics and anisotropic dif-\nfusion. In Ninth International Conference on Computer Vision (ICCV 2003), pp. 840–\n847, Nice, France.\nScharstein, D. (1994). Matching images by comparing their gradient ﬁelds. In Twelfth\nInternational Conference on Pattern Recognition (ICPR’94), pp. 572–575, Jerusalem,\nIsrael.\nScharstein, D. (1999). View Synthesis Using Stereo Vision. Volume 1583, Springer-Verlag.\nScharstein, D. and Pal, C. (2007). Learning conditional random ﬁelds for stereo. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR\n2007), Minneapolis, MN.\nScharstein, D. and Szeliski, R. (1998). Stereo matching with nonlinear diffusion. Interna-\ntional Journal of Computer Vision, 28(2):155–174.\nScharstein, D. and Szeliski, R. (2002). A taxonomy and evaluation of dense two-frame\nstereo correspondence algorithms. International Journal of Computer Vision, 47(1):7–\n42.",
  "image_path": "page_913.jpg",
  "pages": [
    912,
    913,
    914
  ]
}