{
  "doc_id": "pages_936_938",
  "text": "914\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTsin, Y., Kang, S. B., and Szeliski, R. (2006). Stereo matching with linear superposition\nof layers. IEEE Transactions on Pattern Analysis and Machine Intelligence, 28(2):290–\n301.\nTsin, Y., Ramesh, V., and Kanade, T.\n(2001).\nStatistical calibration of CCD imaging\nprocess. In Eighth International Conference on Computer Vision (ICCV 2001), pp. 480–\n487, Vancouver, Canada.\nTu, Z., Chen, X., Yuille, A. L., and Zhu, S.-C. (2005). Image parsing: Unifying segmenta-\ntion, detection, and recognition. International Journal of Computer Vision, 63(2):113–\n140.\nTumblin, J. and Rushmeier, H. E. (1993). Tone reproduction for realistic images. IEEE\nComputer Graphics and Applications, 13(6):42–48.\nTumblin, J. and Turk, G. (1999). LCIS: A boundary hierarchy for detail-preserving contrast\nreduction. In ACM SIGGRAPH 1999 Conference Proceedings, pp. 83–90, Los Angeles.\nTumblin, J., Agrawal, A., and Raskar, R.\n(2005).\nWhy I want a gradient camera.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 103–110, San Diego, CA.\nTurcot, P. and Lowe, D. G. (2009). Better matching with fewer features: The selection of\nuseful features in large database recognition problems. In ICCV Workshop on Emergent\nIssues in Large Amounts of Visual Data (WS-LAVD), Kyoto, Japan.\nTurk, G. and Levoy, M. (1994). Zippered polygonal meshes from range images. In ACM\nSIGGRAPH 1994 Conference Proceedings, pp. 311–318.\nTurk, G. and O’Brien, J. (2002). Modelling with implicit surfaces that interpolate. ACM\nTransactions on Graphics, 21(4):855–873.\nTurk, M. and Pentland, A. (1991a). Eigenfaces for recognition. Journal of Cognitive\nNeuroscience, 3(1):71–86.\nTurk, M. and Pentland, A. (1991b). Face recognition using eigenfaces. In IEEE Computer\nSociety Conference on Computer Vision and Pattern Recognition (CVPR’91), pp. 586–\n591, Maui, Hawaii.\nTuytelaars, T. and Mikolajczyk, K. (2007). Local invariant feature detectors. Foundations\nand Trends in Computer Graphics and Computer Vision, 3(1).\nTuytelaars, T. and Van Gool, L. (2004). Matching widely separated views based on afﬁne\ninvariant regions. International Journal of Computer Vision, 59(1):61–85.\nTuytelaars, T., Van Gool, L., and Proesmans, M. (1997). The cascaded Hough transform.\nIn International Conference on Image Processing (ICIP’97), pp. 736–739.\nReferences\n915\nUllman, S. (1979). The interpretation of structure from motion. Proceedings of the Royal\nSociety of London, B-203:405–426.\nUnnikrishnan, R., Pantofaru, C., and Hebert, M. (2007). Toward objective evaluation of\nimage segmentation algorithms. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 29(6):828–944.\nUnser, M. (1999). Splines: A perfect ﬁt for signal and image processing. IEEE Signal\nProcessing Magazine, 16(6):22–38.\nUrmson, C., Anhalt, J., Bagnell, D., Baker, C., Bittner, R. et al. (2008). Autonomous\ndriving in urban environments: Boss and the urban challenge. Journal of Field Robotics,\n25(8):425–466.\nUrtasun, R., Fleet, D. J., and Fua, P. (2006). Temporal motion models for monocular\nand multiview 3D human body tracking. Computer Vision and Image Understanding,\n104(2-3):157–177.\nUyttendaele, M., Eden, A., and Szeliski, R. (2001). Eliminating ghosting and exposure\nartifacts in image mosaics. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR’2001), pp. 509–516, Kauai, Hawaii.\nUyttendaele, M., Criminisi, A., Kang, S. B., Winder, S., Hartley, R., and Szeliski, R.\n(2004). Image-based interactive exploration of real-world environments. IEEE Com-\nputer Graphics and Applications, 24(3):52–63.\nVaillant, R. and Faugeras, O. D. (1992). Using extremal boundaries for 3-D object model-\ning. IEEE Transactions on Pattern Analysis and Machine Intelligence, 14(2):157–173.\nVaish, V., Szeliski, R., Zitnick, C. L., Kang, S. B., and Levoy, M. (2006). Reconstructing\noccluded surfaces using synthetic apertures: Shape from focus vs. shape from stereo.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2006), pp. 2331–2338, New York, NY.\nvan de Weijer, J. and Schmid, C.\n(2006).\nColoring local feature extraction.\nIn Ninth\nEuropean Conference on Computer Vision (ECCV 2006), pp. 334–348.\nvan den Hengel, A., Dick, A., Thormhlen, T., Ward, B., and Torr, P. H. S. (2007). Video-\ntrace: Rapid interactive scene modeling from video. ACM Transactions on Graphics,\n26(3).\nVan Huffel, S. and Lemmerling, P. (eds).\n(2002).\nTotal Least Squares and Errors-in-\nVariables Modeling, Springer.\nVan Huffel, S. and Vandewalle, J. (1991). The Total Least Squares Problem: Computa-\ntional Aspects and Analysis. Society for Industrial and Applied Mathematics, Philade-\nphia.\n916\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nvan Ouwerkerk, J. D. (2006). Image super-resolution survey. Image and Vision Computing,\n24(10):1039–1052.\nVarma, M. and Ray, D. (2007). Learning the discriminative power-invariance trade-off. In\nEleventh International Conference on Computer Vision (ICCV 2007), Rio de Janeiro,\nBrazil.\nVasconcelos, N. (2007). From pixels to semantic spaces: Advances in content-based image\nretrieval. Computer, 40(7):20–26.\nVasilescu, M. A. O. and Terzopoulos, D. (2007). Multilinear (tensor) image synthesis,\nanalysis, and recognition. IEEE Signal Processing Magazine, 24(6):118–123.\nVedaldi, A. and Fulkerson, B. (2008). VLFeat: An open and portable library of computer\nvision algorithms. http://www.vlfeat.org/.\nVedaldi, A., Gulshan, V., Varma, M., and Zisserman, A. (2009). Multiple kernels for\nobject detection. In Twelfth International Conference on Computer Vision (ICCV 2009),\nKyoto, Japan.\nVedula, S., Baker, S., and Kanade, T. (2005). Image-based spatio-temporal modeling and\nview interpolation of dynamic events. ACM Transactions on Graphics, 24(2):240–261.\nVedula, S., Baker, S., Rander, P., Collins, R., and Kanade, T.\n(2005).\nThree-\ndimensional scene ﬂow. IEEE Transactions on Pattern Analysis and Machine Intel-\nligence, 27(3):475–480.\nVeeraraghavan, A., Raskar, R., Agrawal, A., Mohan, A., and Tumblin, J. (2007). Dappled\nphotography: Mask enhanced cameras for heterodyned light ﬁelds and coded aperture\nrefocusing. ACM Transactions on Graphics, 26(3).\nVeksler, O. (1999). Efﬁcient Graph-based Energy Minimization Methods in Computer\nVision. Ph.D. thesis, Cornell University.\nVeksler, O. (2001). Stereo matching by compact windows via minimum ratio cycle. In\nEighth International Conference on Computer Vision (ICCV 2001), pp. 540–547, Van-\ncouver, Canada.\nVeksler, O. (2003). Fast variable window for stereo correspondence using integral images.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2003), pp. 556–561, Madison, WI.\nVeksler, O. (2007). Graph cut based optimization for MRFs with truncated convex priors.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.",
  "image_path": "page_937.jpg",
  "pages": [
    936,
    937,
    938
  ]
}