{
  "doc_id": "pages_107_109",
  "text": "2.3 The digital camera\n85\nvalues of each of the color primaries,\n\n\nX\nY\nZ\n\n=\n\n\n0.412453\n0.357580\n0.180423\n0.212671\n0.715160\n0.072169\n0.019334\n0.119193\n0.950227\n\n\n\n\nR709\nG709\nB709\n\n.\n(2.108)\nIn practice, each color camera integrates light according to the spectral response function\nof its red, green, and blue sensors,\nR\n=\nZ\nL(λ)SR(λ)dλ,\nG\n=\nZ\nL(λ)SG(λ)dλ,\n(2.109)\nB\n=\nZ\nL(λ)SB(λ)dλ,\nwhere L(λ) is the incoming spectrum of light at a given pixel and {SR(λ), SG(λ), SB(λ)}\nare the red, green, and blue spectral sensitivities of the corresponding sensors.\nCan we tell what spectral sensitivities the cameras actually have? Unless the camera\nmanufacturer provides us with this data or we observe the response of the camera to a whole\nspectrum of monochromatic lights, these sensitivities are not speciﬁed by a standard such as\nBT.709. Instead, all that matters is that the tri-stimulus values for a given color produce the\nspeciﬁed RGB values. The manufacturer is free to use sensors with sensitivities that do not\nmatch the standard XYZ deﬁnitions, so long as they can later be converted (through a linear\ntransform) to the standard colors.\nSimilarly, while TV and computer monitors are supposed to produce RGB values as spec-\niﬁed by Equation (2.108), there is no reason that they cannot use digital logic to transform the\nincoming RGB values into different signals to drive each of the color channels. Properly cal-\nibrated monitors make this information available to software applications that perform color\nmanagement, so that colors in real life, on the screen, and on the printer all match as closely\nas possible.\nColor ﬁlter arrays\nWhile early color TV cameras used three vidicons (tubes) to perform their sensing and later\ncameras used three separate RGB sensing chips, most of today’s digital still and video cam-\neras cameras use a color ﬁlter array (CFA), where alternating sensors are covered by different\ncolored ﬁlters.20\n20 A newer chip design by Foveon (http://www.foveon.com) stacks the red, green, and blue sensors beneath each\nother, but it has not yet gained widespread adoption.\n86\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\nrgB\nrGb\nrgB\nrGb\nrGb\nRgb\nrGb\nRgb\nrgB\nrGb\nrgB\nrGb\nrGb\nRgb\nrGb\nRgb\nB\nG\nB\nG\nG\nR\nG\nR\nG\nB\nG\nR\nG\nR\nB\nG\nFigure 2.30 Bayer RGB pattern: (a) color ﬁlter array layout; (b) interpolated pixel values,\nwith unknown (guessed) values shown as lower case.\nThe most commonly used pattern in color cameras today is the Bayer pattern (Bayer\n1976), which places green ﬁlters over half of the sensors (in a checkerboard pattern), and red\nand blue ﬁlters over the remaining ones (Figure 2.30). The reason that there are twice as many\ngreen ﬁlters as red and blue is because the luminance signal is mostly determined by green\nvalues and the visual system is much more sensitive to high frequency detail in luminance\nthan in chrominance (a fact that is exploited in color image compression—see Section 2.3.3).\nThe process of interpolating the missing color values so that we have valid RGB values for\nall the pixels is known as demosaicing and is covered in detail in Section 10.3.1.\nSimilarly, color LCD monitors typically use alternating stripes of red, green, and blue\nﬁlters placed in front of each liquid crystal active area to simulate the experience of a full color\ndisplay. As before, because the visual system has higher resolution (acuity) in luminance than\nchrominance, it is possible to digitally pre-ﬁlter RGB (and monochrome) images to enhance\nthe perception of crispness (Betrisey, Blinn, Dresevic et al. 2000; Platt 2000).\nColor balance\nBefore encoding the sensed RGB values, most cameras perform some kind of color balancing\noperation in an attempt to move the white point of a given image closer to pure white (equal\nRGB values). If the color system and the illumination are the same (the BT.709 system uses\nthe daylight illuminant D65 as its reference white), the change may be minimal. However,\nif the illuminant is strongly colored, such as incandescent indoor lighting (which generally\nresults in a yellow or orange hue), the compensation can be quite signiﬁcant.\nA simple way to perform color correction is to multiply each of the RGB values by a\ndifferent factor (i.e., to apply a diagonal matrix transform to the RGB color space). More\ncomplicated transforms, which are sometimes the result of mapping to XYZ space and back,\n2.3 The digital camera\n87\nY\nY’\nY’ = Y1/γ\nY’\nY\nY = Y’γ\nquantization \nnoise\nvisible \nnoise\nFigure 2.31 Gamma compression: (a) The relationship between the input signal luminance\nY and the transmitted signal Y ′ is given by Y ′ = Y 1/γ. (b) At the receiver, the signal Y ′ is\nexponentiated by the factor γ, ˆY = Y ′γ. Noise introduced during transmission is squashed in\nthe dark regions, which corresponds to the more noise-sensitive region of the visual system.\nactually perform a color twist, i.e., they use a general 3 × 3 color transform matrix.21 Exer-\ncise 2.9 has you explore some of these issues.\nGamma\nIn the early days of black and white television, the phosphors in the CRT used to display\nthe TV signal responded non-linearly to their input voltage. The relationship between the\nvoltage and the resulting brightness was characterized by a number called gamma (γ), since\nthe formula was roughly\nB = V γ,\n(2.110)\nwith a γ of about 2.2. To compensate for this effect, the electronics in the TV camera would\npre-map the sensed luminance Y through an inverse gamma,\nY ′ = Y\n1\nγ ,\n(2.111)\nwith a typical value of 1\nγ = 0.45.\nThe mapping of the signal through this non-linearity before transmission had a beneﬁcial\nside effect: noise added during transmission (remember, these were analog days!) would be\nreduced (after applying the gamma at the receiver) in the darker regions of the signal where\nit was more visible (Figure 2.31).22 (Remember that our visual system is roughly sensitive to\nrelative differences in luminance.)\n21 Those of you old enough to remember the early days of color television will naturally think of the hue adjustment\nknob on the television set, which could produce truly bizarre results.\n22 A related technique called companding was the basis of the Dolby noise reduction systems used with audio\ntapes.",
  "image_path": "page_108.jpg",
  "pages": [
    107,
    108,
    109
  ]
}