{
  "doc_id": "pages_531_533",
  "text": "10.4 Image matting and compositing\n509\nDifference matting.\nA related approach when the background is irregular but known is\ncalled difference matting (Wright 2006; Brinkmann 2008). It is most commonly used when\nthe actor or object is ﬁlmed against a static background, e.g., for ofﬁce videoconferencing,\nperson tracking applications (Toyama, Krumm, Brumitt et al. 1999), or to produce silhou-\nettes for volumetric 3D reconstruction techniques (Section 11.6.2) (Szeliski 1993; Seitz and\nDyer 1997; Seitz, Curless, Diebel et al. 2006). It can also be used with a panning camera\nwhere the background is composited from frames where the foreground has been removed\nusing a garbage matte (Section 10.4.5) (Chuang, Agarwala, Curless et al. 2002). Another\nrecent application is the detection of visual continuity errors in ﬁlms, i.e., differences in the\nbackground when a shot is re-taken at later time (Pickup and Zisserman 2009).\nIn the case where the foreground and background motions can both be speciﬁed with\nparametric transforms, high-quality mattes can be extracted using a generalization of triangu-\nlation matting (Wexler, Fitzgibbon, and Zisserman 2002). When frames need to be processed\nindependently, however, the results are often of poor quality (Figure 10.42). In such cases,\nusing a pair of stereo cameras as input can dramatically improve the quality of the results\n(Criminisi, Cross, Blake et al. 2006; Yin, Criminisi, Winn et al. 2007).\n10.4.2 Natural image matting\nThe most general version of image matting is when nothing is known about the background\nexcept, perhaps, for a rough segmentation of the scene into foreground, background, and\nunknown regions, which is known as the trimap (Figure 10.39b). Some recent techniques,\nhowever, relax this requirement and allow the user to just draw a few strokes or scribbles in\nthe image, see Figures 10.45 and 10.46 (Wang and Cohen 2005; Wang, Agrawala, and Cohen\n2007; Levin, Lischinski, and Weiss 2008; Rhemann, Rother, Rav-Acha et al. 2008; Rhemann,\nRother, and Gelautz 2008). Fully automated single image matting results have also been\nreported (Levin, Acha, and Lischinski 2008; Singaraju, Rother, and Rhemann 2009). The\nsurvey paper by Wang and Cohen (2007a) has detailed descriptions and comparisons of all of\nthese techniques, a selection of which are described brieﬂy below.\nA relatively simple algorithm for performing natural image matting is Knockout, as de-\nscribed by Chuang, Curless, Salesin et al. (2001) and illustrated in Figure 10.41f. In this\nalgorithm, the nearest known foreground and background pixels (in image space) are deter-\nmined and then blended with neighboring known pixels to produce a per-pixel foreground F\nand background B color estimate. The background color is then adjusted so that the measured\ncolor C lies on the line between F and B. Finally, opacity α is estimated on a per-channel\nbasis, and the three estimates are combined based on per-channel color differences. (This is\nan approximation to the least squares solution for α.) Figure 10.42 shows that Knockout has\nproblems when the background consists of more than one dominant local color.\n510\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nMishima\nKnockout\nRuzon–Tomasi\nBayesian\nFigure 10.41\nImage matting algorithms (Chuang, Curless, Salesin et al. 2001) c⃝2001\nIEEE. Mishima’s algorithm models global foreground and background color distribution as\npolyhedral surfaces centered around the mean background (blue) color. Knockout uses a lo-\ncal color estimate of foreground and background for each pixel and computes α along each\ncolor axis. Ruzon and Tomasi’s algorithm locally models foreground and background colors\nand variances. Chuang et al.’s Bayesian matting approach computes a MAP estimate of (frac-\ntional) foreground color and opacity given the local foreground and background distributions.\nMore accurate matting results can be obtained if we treat the foreground and background\ncolors as distributions sampled over some region (Figure 10.41g–h). Ruzon and Tomasi\n(2000) model local color distributions as mixtures of (uncorrelated) Gaussians and compute\nthese models in strips. They then ﬁnd the pairing of mixture components F and B that best\ndescribes the observed color C, compute the α as the relative distance between these means,\nand adjust the estimates of F and B so they are collinear with C.\nChuang, Curless, Salesin et al. (2001) and Hillman, Hannah, and Renshaw (2001) use\nfull 3 × 3 color covariance matrices to model mixtures of correlated Gaussians, and compute\nestimates independently for each pixel. Matte extraction proceeds in strips starting from\nknown color values growing into the unknown regions, so that recently computed F and B\ncolors can be used in later stages.\nTo estimate the most likely value of an unknown pixel’s opacity and (unmixed) foreground\nand background colors, Chuang et al. use a fully Bayesian formulation that maximizes\nP(F, B, α|C) = P(C|F, B, α)P(F)P(B)P(α)/P(C).\n(10.32)\n10.4 Image matting and compositing\n511\nFigure 10.42 Natural image matting results (Chuang, Curless, Salesin et al. 2001) c⃝2001\nIEEE. Difference matting and Knockout both perform poorly on this kind of background,\nwhile the more recent natural image matting techniques perform well. Chuang et al.’s results\nare slightly smoother and closer to the ground truth.",
  "image_path": "page_532.jpg",
  "pages": [
    531,
    532,
    533
  ]
}