{
  "doc_id": "pages_057_059",
  "text": "2.1 Geometric primitives and transformations\n35\nA disadvantage of the endpoint representation for 3D lines is that it has too many degrees\nof freedom, i.e., six (three for each endpoint) instead of the four degrees that a 3D line truly\nhas. However, if we ﬁx the two points on the line to lie in speciﬁc planes, we obtain a rep-\nresentation with four degrees of freedom. For example, if we are representing nearly vertical\nlines, then z = 0 and z = 1 form two suitable planes, i.e., the (x, y) coordinates in both\nplanes provide the four coordinates describing the line. This kind of two-plane parameteri-\nzation is used in the light ﬁeld and Lumigraph image-based rendering systems described in\nChapter 13 to represent the collection of rays seen by a camera as it moves in front of an\nobject. The two-endpoint representation is also useful for representing line segments, even\nwhen their exact endpoints cannot be seen (only guessed at).\nIf we wish to represent all possible lines without bias towards any particular orientation,\nwe can use Pl¨ucker coordinates (Hartley and Zisserman 2004, Chapter 2; Faugeras and Luong\n2001, Chapter 3). These coordinates are the six independent non-zero entries in the 4×4 skew\nsymmetric matrix\nL = ˜p˜qT −˜q˜pT ,\n(2.12)\nwhere ˜p and ˜q are any two (non-identical) points on the line. This representation has only\nfour degrees of freedom, since L is homogeneous and also satisﬁes det(L) = 0, which results\nin a quadratic constraint on the Pl¨ucker coordinates.\nIn practice, the minimal representation is not essential for most applications. An ade-\nquate model of 3D lines can be obtained by estimating their direction (which may be known\nahead of time, e.g., for architecture) and some point within the visible portion of the line\n(see Section 7.5.1) or by using the two endpoints, since lines are most often visible as ﬁnite\nline segments. However, if you are interested in more details about the topic of minimal\nline parameterizations, F¨orstner (2005) discusses various ways to infer and model 3D lines in\nprojective geometry, as well as how to estimate the uncertainty in such ﬁtted models.\n3D quadrics.\nThe 3D analog of a conic section is a quadric surface\n¯xT Q¯x = 0\n(2.13)\n(Hartley and Zisserman 2004, Chapter 2). Again, while quadric surfaces are useful in the\nstudy of multi-view geometry and can also serve as useful modeling primitives (spheres,\nellipsoids, cylinders), we do not study them in great detail in this book.\n2.1.2 2D transformations\nHaving deﬁned our basic primitives, we can now turn our attention to how they can be trans-\nformed. The simplest transformations occur in the 2D plane and are illustrated in Figure 2.4.\n36\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\ny\nx\nsimilarity\nEuclidean\naffine\nprojective\ntranslation\nFigure 2.4 Basic set of 2D planar transformations.\nTranslation.\n2D translations can be written as x′ = x + t or\nx′ =\nh\nI\nt\ni\n¯x\n(2.14)\nwhere I is the (2 × 2) identity matrix or\n¯x′ =\n\"\nI\nt\n0T\n1\n#\n¯x\n(2.15)\nwhere 0 is the zero vector. Using a 2 × 3 matrix results in a more compact notation, whereas\nusing a full-rank 3 × 3 matrix (which can be obtained from the 2 × 3 matrix by appending a\n[0T 1] row) makes it possible to chain transformations using matrix multiplication. Note that\nin any equation where an augmented vector such as ¯x appears on both sides, it can always be\nreplaced with a full homogeneous vector ˜x.\nRotation + translation.\nThis transformation is also known as 2D rigid body motion or the\n2D Euclidean transformation (since Euclidean distances are preserved). It can be written as\nx′ = Rx + t or\nx′ =\nh\nR\nt\ni\n¯x\n(2.16)\nwhere\nR =\n\"\ncos θ\n−sin θ\nsin θ\ncos θ\n#\n(2.17)\nis an orthonormal rotation matrix with RRT = I and |R| = 1.\nScaled rotation.\nAlso known as the similarity transform, this transformation can be ex-\npressed as x′ = sRx + t where s is an arbitrary scale factor. It can also be written as\nx′ =\nh\nsR\nt\ni\n¯x =\n\"\na\n−b\ntx\nb\na\nty\n#\n¯x,\n(2.18)\nwhere we no longer require that a2 + b2 = 1. The similarity transform preserves angles\nbetween lines.\n2.1 Geometric primitives and transformations\n37\nAfﬁne.\nThe afﬁne transformation is written as x′ = A¯x, where A is an arbitrary 2 × 3\nmatrix, i.e.,\nx′ =\n\"\na00\na01\na02\na10\na11\na12\n#\n¯x.\n(2.19)\nParallel lines remain parallel under afﬁne transformations.\nProjective.\nThis transformation, also known as a perspective transform or homography,\noperates on homogeneous coordinates,\n˜x′ = ˜\nH ˜x,\n(2.20)\nwhere ˜\nH is an arbitrary 3 × 3 matrix. Note that ˜\nH is homogeneous, i.e., it is only deﬁned\nup to a scale, and that two ˜\nH matrices that differ only by scale are equivalent. The resulting\nhomogeneous coordinate ˜x′ must be normalized in order to obtain an inhomogeneous result\nx, i.e.,\nx′ = h00x + h01y + h02\nh20x + h21y + h22\nand y′ = h10x + h11y + h12\nh20x + h21y + h22\n.\n(2.21)\nPerspective transformations preserve straight lines (i.e., they remain straight after the trans-\nformation).\nHierarchy of 2D transformations.\nThe preceding set of transformations are illustrated\nin Figure 2.4 and summarized in Table 2.1. The easiest way to think of them is as a set\nof (potentially restricted) 3 × 3 matrices operating on 2D homogeneous coordinate vectors.\nHartley and Zisserman (2004) contains a more detailed description of the hierarchy of 2D\nplanar transformations.\nThe above transformations form a nested set of groups, i.e., they are closed under com-\nposition and have an inverse that is a member of the same group. (This will be important\nlater when applying these transformations to images in Section 3.6.) Each (simpler) group is\na subset of the more complex group below it.\nCo-vectors.\nWhile the above transformations can be used to transform points in a 2D plane,\ncan they also be used directly to transform a line equation? Consider the homogeneous equa-\ntion ˜l · ˜x = 0. If we transform x′ = ˜\nHx, we obtain\n˜l\n′ · ˜x′ = ˜l\n′T ˜\nH ˜x = ( ˜\nH\nT˜l\n′)T ˜x = ˜l · ˜x = 0,\n(2.22)\ni.e., ˜l\n′ = ˜\nH\n−T˜l. Thus, the action of a projective transformation on a co-vector such as a 2D\nline or 3D normal can be represented by the transposed inverse of the matrix, which is equiv-\nalent to the adjoint of ˜\nH, since projective transformation matrices are homogeneous. Jim",
  "image_path": "page_058.jpg",
  "pages": [
    57,
    58,
    59
  ]
}