{
  "doc_id": "pages_842_844",
  "text": "820\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nDhond, U. R. and Aggarwal, J. K. (1989). Structure from stereo—a review. IEEE Trans-\nactions on Systems, Man, and Cybernetics, 19(6):1489–1510.\nDick, A., Torr, P. H. S., and Cipolla, R. (2004). Modelling and interpretation of architecture\nfrom several images. International Journal of Computer Vision, 60(2):111–134.\nDickinson, S., Leonardis, A., Schiele, B., and Tarr, M. J. (eds). (2007). Object Catego-\nrization: Computer and Human Vision Perspectives, Cambridge University Press, New\nYork.\nDickmanns, E. D. and Graefe, V. (1988). Dynamic monocular machine vision. Machine\nVision and Applications, 1:223–240.\nDiebel, J. (2006). Representing Attitude: Euler Angles, Quaternions, and Rotation Vectors.\nTechnical Report, Stanford University. http://ai.stanford.edu/∼diebel/attitude.html.\nDiebel, J. R., Thrun, S., and Br¨unig, M. (2006). A Bayesian method for probable surface\nreconstruction and decimation. ACM Transactions on Graphics, 25(1).\nDimitrijevic, M., Lepetit, V., and Fua, P.\n(2006).\nHuman body pose detection us-\ning Bayesian spatio-temporal templates. Computer Vision and Image Understanding,\n104(2-3):127–139.\nDinh, H. Q., Turk, G., and Slabaugh, G. (2002). Reconstructing surfaces by volumetric\nregularization using radial basis functions. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 24(10):1358–1371.\nDivvala, S., Hoiem, D., Hays, J., Efros, A. A., and Hebert, M. (2009). An empirical study\nof context in object detection. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2009), Miami, FL.\nDodgson, N. A. (1992). Image Resampling. Technical Report TR261, Wolfson College\nand Computer Laboratory, University of Cambridge.\nDoll`ar, P., Belongie, S., and Perona, P. (2010). The fastest pedestrian detector in the west.\nIn British Machine Vision Conference (BMVC 2010), Aberystwyth, Wales, UK.\nDoll`ar, P., Wojek, C., Schiele, B., and Perona, P. (2009). Pedestrian detection: A bench-\nmark. In IEEE Computer Society Conference on Computer Vision and Pattern Recog-\nnition (CVPR 2009), Miami Beach, FL.\nDoretto, G. and Soatto, S. (2006). Dynamic shape and appearance models. IEEE Transac-\ntions on Pattern Analysis and Machine Intelligence, 28(12):2006–2019.\nDoretto, G., Chiuso, A., Wu, Y. N., and Soatto, S. (2003). Dynamic textures. International\nJournal of Computer Vision, 51(2):91–109.\nReferences\n821\nDork´o, G. and Schmid, C. (2003). Selection of scale-invariant parts for object class recog-\nnition. In Ninth International Conference on Computer Vision (ICCV 2003), pp. 634–\n640, Nice, France.\nDorsey, J., Rushmeier, H., and Sillion, F. (2007). Digital Modeling of Material Appear-\nance. Morgan Kaufmann, San Francisco.\nDouglas, D. H. and Peucker, T. K. (1973). Algorithms for the reduction of the number of\npoints required to represent a digitized line or its caricature. The Canadian Cartogra-\npher, 10(2):112–122.\nDrori, I., Cohen-Or, D., and Yeshurun, H. (2003). Fragment-based image completion.\nACM Transactions on Graphics (Proc. SIGGRAPH 2003), 22(3):303–312.\nDuda, R. O. and Hart, P. E. (1972). Use of the Hough transform to detect lines and curves\nin pictures. Communications of the ACM, 15(1):11–15.\nDuda, R. O., Hart, P. E., and Stork, D. G. (2001). Pattern Classiﬁcation. John Wiley &\nSons, New York, 2nd edition.\nDupuis, P. and Oliensis, J. (1994). An optimal control formulation and related numer-\nical methods for a problem in shape reconstruction. Annals of Applied Probability,\n4(2):287–346.\nDurand, F. and Dorsey, J. (2002). Fast bilateral ﬁltering for the display of high-dynamic-\nrange images. ACM Transactions on Graphics (Proc. SIGGRAPH 2002), 21(3):257–\n266.\nDurand, F. and Szeliski, R. (2007). Computational photography. IEEE Computer Graphics\nand Applications, 27(2):21–22. Guest Editors’ Introduction to Special Issue.\nDurbin, R. and Willshaw, D. (1987). An analogue approach to the traveling salesman\nproblem using an elastic net method. Nature, 326:689–691.\nDurbin, R., Szeliski, R., and Yuille, A. (1989). An analysis of the elastic net approach to\nthe travelling salesman problem. Neural Computation, 1(3):348–358.\nEck, M., DeRose, T., Duchamp, T., Hoppe, H., Lounsbery, M., and Stuetzle, W. (1995).\nMultiresolution analysis of arbitrary meshes. In ACM SIGGRAPH 1995 Conference\nProceedings, pp. 173–182, Los Angeles.\nEden, A., Uyttendaele, M., and Szeliski, R. (2006). Seamless image stitching of scenes\nwith large motions and exposure differences. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR’2006), pp. 2498–2505, New York,\nNY.\nEfros, A. A. and Freeman, W. T. (2001). Image quilting for texture synthesis and transfer.\nIn ACM SIGGRAPH 2001 Conference Proceedings, pp. 341–346.\n822\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nEfros, A. A. and Leung, T. K. (1999). Texture synthesis by non-parametric sampling.\nIn Seventh International Conference on Computer Vision (ICCV’99), pp. 1033–1038,\nKerkyra, Greece.\nEfros, A. A., Berg, A. C., Mori, G., and Malik, J. (2003). Recognizing action at a distance.\nIn Ninth International Conference on Computer Vision (ICCV 2003), pp. 726–733, Nice,\nFrance.\nEichner, M. and Ferrari, V. (2009). Better appearance models for pictorial structures. In\nBritish Machine Vision Conference (BMVC 2009).\nEisemann, E. and Durand, F. (2004). Flash photography enhancement via intrinsic relight-\ning. ACM Transactions on Graphics, 23(3):673–678.\nEisert, P., Steinbach, E., and Girod, B. (2000). Automatic reconstruction of stationary 3-D\nobjects from multiple uncalibrated camera views. IEEE Transactions on Circuits and\nSystems for Video Technology, 10(2):261–277.\nEisert, P., Wiegand, T., and Girod, B. (2000). Model-aided coding: a new approach to in-\ncorporate facial animation into motion-compensated video coding. IEEE Transactions\non Circuits and Systems for Video Technology, 10(3):344–358.\nEkman, P. and Friesen, W. V. (1978). Facial Action Coding System: A Technique for the\nMeasurement of Facial Movement. Consulting Psychologists press, Palo Alto, CA.\nEl-Melegy, M. and Farag, A. (2003). Nonmetric lens distortion calibration: Closed-form\nsolutions, robust estimation and model selection. In Ninth International Conference on\nComputer Vision (ICCV 2003), pp. 554–559, Nice, France.\nElder, J. H. (1999). Are edges incomplete?\nInternational Journal of Computer Vision,\n34(2/3):97–122.\nElder, J. H. and Goldberg, R. M. (2001). Image editing in the contour domain. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 23(3):291–296.\nElder, J. H. and Zucker, S. W. (1998). Local scale control for edge detection and blur esti-\nmation. IEEE Transactions on Pattern Analysis and Machine Intelligence, 20(7):699–\n716.\nEngels, C., Stew´enius, H., and Nist´er, D. (2006). Bundle adjustment rules. In Photogram-\nmetric Computer Vision (PCV’06), Bonn, Germany.\nEngl, H. W., Hanke, M., and Neubauer, A. (1996). Regularization of Inverse Problems.\nKluwer Academic Publishers, Dordrecht.\nEnqvist, O., Josephson, K., and Kahl, F. (2009). Optimal correspondences from pairwise\nconstraints.\nIn Twelfth International Conference on Computer Vision (ICCV 2009),\nKyoto, Japan.",
  "image_path": "page_843.jpg",
  "pages": [
    842,
    843,
    844
  ]
}