{
  "doc_id": "pages_838_840",
  "text": "816\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nCsurka, G., Dance, C. R., Fan, L., Willamowski, J., and Bray, C. (2004). Visual categoriza-\ntion with bags of keypoints. In ECCV International Workshop on Statistical Learning\nin Computer Vision, Prague.\nCui, J., Yang, Q., Wen, F., Wu, Q., Zhang, C., Van Gool, L., and Tang, X. (2008). Trans-\nductive object cutout. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2008), Anchorage, AK.\nCurless, B. (1999). From range scans to 3D models. Computer Graphics, 33(4):38–41.\nCurless, B. and Levoy, M. (1995). Better optical triangulation through spacetime anal-\nysis. In Fifth International Conference on Computer Vision (ICCV’95), pp. 987–994,\nCambridge, Massachusetts.\nCurless, B. and Levoy, M. (1996). A volumetric method for building complex models from\nrange images. In ACM SIGGRAPH 1996 Conference Proceedings, pp. 303–312, New\nOrleans.\nCutler, R. and Davis, L. S. (2000). Robust real-time periodic motion detection, analysis,\nand applications. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n22(8):781–796.\nCutler, R. and Turk, M. (1998). View-based interpretation of real-time optical ﬂow for\ngesture recognition. In IEEE International Conference on Automatic Face and Gesture\nRecognition, pp. 416–421, Nara, Japan.\nDai, S., Baker, S., and Kang, S. B. (2009). An MRF-based deinterlacing algorithm with\nexemplar-based reﬁnement. IEEE Transactions on Image Processing, 18(5):956–968.\nDalal, N. and Triggs, B. (2005). Histograms of oriented gradients for human detection.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 886–893, San Diego, CA.\nDalal, N., Triggs, B., and Schmid, C. (2006). Human detection using oriented histograms\nof ﬂow and appearance. In Ninth European Conference on Computer Vision (ECCV\n2006), pp. 428–441.\nDana, K. J., van Ginneken, B., Nayar, S. K., and Koenderink, J. J. (1999). Reﬂectance and\ntexture of real world surfaces. ACM Transactions on Graphics, 18(1):1–34.\nDanielsson, P. E. (1980). Euclidean distance mapping. Computer Graphics and Image\nProcessing, 14(3):227–248.\nDarrell, T. and Pentland, A. (1991). Robust estimation of a multi-layered motion represen-\ntation. In IEEE Workshop on Visual Motion, pp. 173–178, Princeton, New Jersey.\nDarrell, T. and Pentland, A. (1995). Cooperative robust estimation using layers of support.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 17(5):474–487.\nReferences\n817\nDarrell, T. and Simoncelli, E. (1993). “Nulling” ﬁlters and the separation of transparent\nmotion. In IEEE Computer Society Conference on Computer Vision and Pattern Recog-\nnition (CVPR’93), pp. 738–739, New York.\nDarrell, T., Gordon, G., Harville, M., and Woodﬁll, J. (2000). Integrated person tracking\nusing stereo, color, and pattern detection. International Journal of Computer Vision,\n37(2):175–185.\nDarrell, T., Baker, H., Crow, F., Gordon, G., and Woodﬁll, J. (1997). Magic morphin\nmirror: face-sensitive distortion and exaggeration. In ACM SIGGRAPH 1997 Visual\nProceedings, Los Angeles.\nDatta, R., Joshi, D., Li, J., and Wang, J. Z. (2008). Image retrieval: Ideas, inﬂuences, and\ntrends of the new age. ACM Computing Surveys, 40(2).\nDaugman, J. (2004). How iris recognition works. IEEE Transactions on Circuits and\nSystems for Video Technology, 14(1):21–30.\nDavid, P., DeMenthon, D., Duraiswami, R., and Samet, H. (2004). SoftPOSIT: Simultane-\nous pose and correspondence determination. International Journal of Computer Vision,\n59(3):259–284.\nDavies, R., Twining, C., and Taylor, C. (2008). Statistical Models of Shape. Springer-\nVerlag, London.\nDavis, J. (1998). Mosaics of scenes with moving objects. In IEEE Computer Society Con-\nference on Computer Vision and Pattern Recognition (CVPR’98), pp. 354–360, Santa\nBarbara.\nDavis, J., Ramamoorthi, R., and Rusinkiewicz, S. (2003). Spacetime stereo: A unifying\nframework for depth from triangulation.\nIn IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR’2003), pp. 359–366, Madison, WI.\nDavis, J., Nahab, D., Ramamoorthi, R., and Rusinkiewicz, S. (2005). Spacetime stereo: A\nunifying framework for depth from triangulation. IEEE Transactions on Pattern Analy-\nsis and Machine Intelligence, 27(2):296–302.\nDavis, L. (1975). A survey of edge detection techniques. Computer Graphics and Image\nProcessing, 4(3):248–270.\nDavis, T. A. (2006). Direct Methods for Sparse Linear Systems. SIAM.\nDavis, T. A. (2008). Multifrontal multithreaded rank-revealing sparse QR factorization.\nACM Trans. on Mathematical Software, (submitted).\nDavison, A., Reid, I., Molton, N. D., and Stasse, O. (2007). MonoSLAM: Real-time sin-\ngle camera SLAM. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n29(6):1052–1067.\n818\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nde Agapito, L., Hayman, E., and Reid, I. (2001). Self-calibration of rotating and zooming\ncameras. International Journal of Computer Vision, 45(2):107–127.\nde Berg, M., Cheong, O., van Kreveld, M., and Overmars, M. (2006). Computational\nGeometry: Algorithms and Applications. Springer, New York, NY, third edition.\nDe Bonet, J. (1997). Multiresolution sampling procedure for analysis and synthesis of\ntexture images. In ACM SIGGRAPH 1997 Conference Proceedings, pp. 361–368, Los\nAngeles.\nDe Bonet, J. S. and Viola, P. (1999). Poxels: Probabilistic voxelized volume reconstruc-\ntion. In Seventh International Conference on Computer Vision (ICCV’99), pp. 418–425,\nKerkyra, Greece.\nDe Castro, E. and Morandi, C. (1987). Registration of translated and rotated images using\nﬁnite Fourier transforms. IEEE Transactions on Pattern Analysis and Machine Intelli-\ngence, PAMI-9(5):700–703.\nde Haan, G. and Bellers, E. B. (1998). Deinterlacing—an overview. Proceedings of the\nIEEE, 86:1839–1857.\nDe la Torre, F. and Black, M. J. (2003). A framework for robust subspace learning. Inter-\nnational Journal of Computer Vision, 54(1/2/3):117–142.\nDebevec, P. (1998). Rendering synthetic objects into real scenes: Bridging traditional and\nimage-based graphics with global illumination and high dynamic range photography. In\nACM SIGGRAPH 1998 Conference Proceedings, pp. 189–198.\nDebevec, P. (2006). Virtual cinematography: Relighting through computation. Computer,\n39(8):57–65.\nDebevec, P., Hawkins, T., Tchou, C., Duiker, H.-P., Sarokin, W., and Sagar, M. (2000).\nAcquiring the reﬂectance ﬁeld of a human face. In ACM SIGGRAPH 2000 Conference\nProceedings, pp. 145–156.\nDebevec, P., Wenger, A., Tchou, C., Gardner, A., Waese, J., and Hawkins, T.\n(2002).\nA lighting reproduction approach to live-action compositing. ACM Transactions on\nGraphics (Proc. SIGGRAPH 2002), 21(3):547–556.\nDebevec, P. E. (1999). Image-based modeling and lighting. Computer Graphics, 33(4):46–\n50.\nDebevec, P. E. and Malik, J. (1997). Recovering high dynamic range radiance maps from\nphotographs. In ACM SIGGRAPH 1997 Conference Proceedings, pp. 369–378.\nDebevec, P. E., Taylor, C. J., and Malik, J. (1996). Modeling and rendering architec-\nture from photographs: A hybrid geometry- and image-based approach. In ACM SIG-\nGRAPH 1996 Conference Proceedings, pp. 11–20, New Orleans.",
  "image_path": "page_839.jpg",
  "pages": [
    838,
    839,
    840
  ]
}