{
  "doc_id": "pages_932_934",
  "text": "910\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTerzopoulos, D. and Fleischer, K. (1988). Deformable models. The Visual Computer,\n4(6):306–331.\nTerzopoulos, D. and Metaxas, D. (1991). Dynamic 3D models with local and global de-\nformations: Deformable superquadrics. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 13(7):703–714.\nTerzopoulos, D. and Szeliski, R. (1992). Tracking with Kalman snakes. In Blake, A. and\nYuille, A. L. (eds), Active Vision, pp. 3–20, MIT Press, Cambridge, Massachusetts.\nTerzopoulos, D. and Waters, K.\n(1990).\nAnalysis of facial images using physical and\nanatomical models. In Third International Conference on Computer Vision (ICCV’90),\npp. 727–732, Osaka, Japan.\nTerzopoulos, D. and Witkin, A. (1988). Physically-based models with rigid and deformable\ncomponents. IEEE Computer Graphics and Applications, 8(6):41–51.\nTerzopoulos, D., Witkin, A., and Kass, M. (1987). Symmetry-seeking models and 3D\nobject reconstruction. International Journal of Computer Vision, 1(3):211–221.\nTerzopoulos, D., Witkin, A., and Kass, M. (1988). Constraints on deformable models:\nRecovering 3D shape and nonrigid motion. Artiﬁcial Intelligence, 36(1):91–123.\nThayananthan, A., Iwasaki, M., and Cipolla, R. (2008). Principled fusion of high-level\nmodel and low-level cues for motion segmentation. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nThirthala, S. and Pollefeys, M. (2005). The radial trifocal tensor: A tool for calibrating\nthe radial distortion of wide-angle cameras. In IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR’2005), pp. 321–328, San Diego, CA.\nThomas, D. B., Luk, W., Leong, P. H., and Villasenor, J. D. (2007). Gaussian random\nnumber generators. ACM Computing Surveys, 39(4).\nThrun, S., Burgard, W., and Fox, D. (2005). Probabilistic Robotics. The MIT Press,\nCambridge, Massachusetts.\nThrun, S., Montemerlo, M., Dahlkamp, H., Stavens, D., Aron, A. et al. (2006). Stanley, the\nrobot that won the DARPA Grand Challenge. Journal of Field Robotics, 23(9):661–692.\nTian, Q. and Huhns, M. N. (1986). Algorithms for subpixel registration. Computer Vision,\nGraphics, and Image Processing, 35:220–233.\nTikhonov, A. N. and Arsenin, V. Y. (1977). Solutions of Ill-Posed Problems. V. H. Winston,\nWashington, D. C.\nTipping, M. E. and Bishop, C. M. (1999). Probabilistic principal components analysis.\nJournal of the Royal Statistical Society, Series B, 61(3):611–622.\nReferences\n911\nToint, P. L. (1987). On large scale nonlinear least squares calculations. SIAM J. Sci. Stat.\nComput., 8(3):416–435.\nTola, E., Lepetit, V., and Fua, P. (2010). DAISY: An efﬁcient dense descriptor applied to\nwide-baseline stereo. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n32(5):815–830.\nTolliver, D. and Miller, G. (2006). Graph partitioning by spectral rounding: Applications\nin image segmentation and clustering. In IEEE Computer Society Conference on Com-\nputer Vision and Pattern Recognition (CVPR’2006), pp. 1053–1060, New York City,\nNY.\nTomasi, C. and Kanade, T. (1992). Shape and motion from image streams under orthogra-\nphy: A factorization method. International Journal of Computer Vision, 9(2):137–154.\nTomasi, C. and Manduchi, R. (1998). Bilateral ﬁltering for gray and color images. In Sixth\nInternational Conference on Computer Vision (ICCV’98), pp. 839–846, Bombay.\nTombari, F., Mattoccia, S., and Di Stefano, L. (2007). Segmentation-based adaptive support\nfor accurate stereo correspondence. In Paciﬁc-Rim Symposium on Image and Video\nTechnology.\nTombari, F., Mattoccia, S., Di Stefano, L., and Addimanda, E. (2008). Classiﬁcation and\nevaluation of cost aggregation methods for stereo correspondence. In IEEE Computer\nSociety Conference on Computer Vision and Pattern Recognition (CVPR 2008), An-\nchorage, AK.\nTommasini, T., Fusiello, A., Trucco, E., and Roberto, V. (1998). Making good features\ntrack better. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’98), pp. 178–183, Santa Barbara.\nTorborg, J. and Kajiya, J. T. (1996). Talisman: Commodity realtime 3D graphics for the\nPC. In ACM SIGGRAPH 1996 Conference Proceedings, pp. 353–363, New Orleans.\nTorr, P. H. S. (2002). Bayesian model estimation and selection for epipolar geometry and\ngeneric manifold ﬁtting. International Journal of Computer Vision, 50(1):35–61.\nTorr, P. H. S. and Fitzgibbon, A. W. (2004). Invariant ﬁtting of two view geometry. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 26(5):648–650.\nTorr, P. H. S. and Murray, D. (1997). The development and comparison of robust meth-\nods for estimating the fundamental matrix. International Journal of Computer Vision,\n24(3):271–300.\nTorr, P. H. S., Szeliski, R., and Anandan, P. (1999). An integrated Bayesian approach to\nlayer extraction from image sequences. In Seventh International Conference on Com-\nputer Vision (ICCV’99), pp. 983–990, Kerkyra, Greece.\n912\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTorr, P. H. S., Szeliski, R., and Anandan, P. (2001). An integrated Bayesian approach\nto layer extraction from image sequences. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 23(3):297–303.\nTorralba, A. (2003). Contextual priming for object detection. International Journal of\nComputer Vision, 53(2):169–191.\nTorralba, A.\n(2007).\nClassiﬁer-based methods.\nIn CVPR 2007 Short Course on\nRecognizing and Learning Object Categories.\nhttp://people.csail.mit.edu/torralba/\nshortCourseRLOC/.\nTorralba, A. (2008). Object recognition and scene understanding. MIT Course 6.870,\nhttp://people.csail.mit.edu/torralba/courses/6.870/6.870.recognition.htm.\nTorralba, A., Freeman, W. T., and Fergus, R. (2008). 80 million tiny images: a large\ndataset for non-parametric object and scene recognition. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 30(11):1958–1970.\nTorralba, A., Murphy, K. P., and Freeman, W. T. (2004). Contextual models for object\ndetection using boosted random ﬁelds. In Advances in Neural Information Processing\nSystems.\nTorralba, A., Murphy, K. P., and Freeman, W. T. (2007). Sharing visual features for mul-\nticlass and multiview object detection.\nIEEE Transactions on Pattern Analysis and\nMachine Intelligence, 29(5):854–869.\nTorralba, A., Weiss, Y., and Fergus, R. (2008). Small codes and large databases of images\nfor object recognition. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2008), Anchorage, AK.\nTorralba, A., Murphy, K. P., Freeman, W. T., and Rubin, M. A. (2003). Context-based\nvision system for place and object recognition. In Ninth International Conference on\nComputer Vision (ICCV 2003), pp. 273–280, Nice, France.\nTorrance, K. E. and Sparrow, E. M. (1967). Theory for off-specular reﬂection from rough-\nened surfaces. Journal of the Optical Society of America A, 57(9):1105–1114.\nTorresani, L., Hertzmann, A., and Bregler, C. (2008). Non-rigid structure-from-motion:\nEstimating shape and motion with hierarchical priors. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 30(5):878–892.\nToyama, K. (1998). Prolegomena for Robust Face Tracking. Technical Report MSR-TR-\n98-65, Microsoft Research.\nToyama, K., Krumm, J., Brumitt, B., and Meyers, B. (1999). Wallﬂower: Principles and\npractice of background maintenance. In Seventh International Conference on Computer\nVision (ICCV’99), pp. 255–261, Kerkyra, Greece.",
  "image_path": "page_933.jpg",
  "pages": [
    932,
    933,
    934
  ]
}