{
  "doc_id": "pages_613_615",
  "text": "12.3 Surface representations\n591\n(a)\n(b)\n(c)\n(d)\n(e)\nFigure 12.9\nReconstruction and hardcopy of the “Happy Buddha” statuette (Curless and\nLevoy 1996) c⃝1996 ACM: (a) photograph of the original statue after spray painting with\nmatte gray; (b) partial range scan; (c) merged range scans; (d) colored rendering of the recon-\nstructed model; (e) hardcopy of the model constructed using stereolithography.\ndevelopment, acquisition, and post-processing, took several years (and many volunteers), and\nproduced a wealth of 3D shape and appearance modeling techniques as a result.\nEven larger-scale projects are now being attempted, for example, the scanning of com-\nplete temple sites such as Angkor-Thom (Ikeuchi and Sato 2001; Ikeuchi and Miyazaki 2007;\nBanno, Masuda, Oishi et al. 2008). Figure 12.10 shows details from this project, including a\nsample photograph, a detailed 3D (sculptural) head model scanned from ground level, and an\naerial overview of the ﬁnal merged 3D site model, which was acquired using a balloon.\n12.3 Surface representations\nIn previous sections, we have seen different representations being used to integrate 3D range\nscans. We now look at several of these representations in more detail. Explicit surface\nrepresentations, such as triangle meshes, splines (Farin 1992, 1996), and subdivision sur-\nfaces (Stollnitz, DeRose, and Salesin 1996; Zorin, Schr¨oder, and Sweldens 1996; Warren and\nWeimer 2001; Peters and Reif 2008), enable not only the creation of highly detailed models\nbut also processing operations, such as interpolation (Section 12.3.1), fairing or smoothing,\nand decimation and simpliﬁcation (Section 12.3.2). We also examine discrete point-based\nrepresentations (Section 12.4) and volumetric representations (Section 12.5).\n592\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\nFigure 12.10 Laser range modeling of the Bayon temple at Angkor-Thom (Banno, Masuda,\nOishi et al. 2008) c⃝2008 Springer: (a) sample photograph from the site; (b) a detailed head\nmodel scanned from the ground; (c) ﬁnal merged 3D model of the temple scanned using a\nlaser range sensor mounted on a balloon.\n12.3.1 Surface interpolation\nOne of the most common operations on surfaces is their reconstruction from a set of sparse\ndata constraints, i.e. scattered data interpolation. When formulating such problems, surfaces\nmay be parameterized as height ﬁelds f(x), as 3D parametric surfaces f(x), or as non-\nparametric models such as collections of triangles.\nIn the section on image processing, we saw how two-dimensional function interpolation\nand approximation problems {di} →f(x) could be cast as energy minimization problems\nusing regularization (Section 3.7.1 (3.94–3.98).5 Such problems can also specify the locations\nof discontinuities in the surface as well as local orientation constraints (Terzopoulos 1986b;\nZhang, Dugas-Phocion, Samson et al. 2002).\nOne approach to solving such problems is to discretize both the surface and the energy\non a discrete grid or mesh using ﬁnite element analysis (3.100–3.102) (Terzopoulos 1986b).\nSuch problems can then be solved using sparse system solving techniques, such as multigrid\n(Briggs, Henson, and McCormick 2000) or hierarchically preconditioned conjugate gradient\n(Szeliski 2006b). The surface can also be represented using a hierarchical combination of\nmultilevel B-splines (Lee, Wolberg, and Shin 1996).\nAn alternative approach is to use radial basis (or kernel) functions (Boult and Kender\n1986; Nielson 1993). To interpolate a ﬁeld f(x) through (or near) a number of data values\ndi located at xi, the radial basis function approach uses\nf(x) =\nP\ni wi(x)di\nP\ni wi(x) ,\n(12.6)\n5 The difference between interpolation and approximation is that the former requires the surface or function to\npass through the data while the latter allows the function to pass near the data, and can therefore be used for surface\nsmoothing as well.\n12.3 Surface representations\n593\nwhere the weights,\nwi(x) = K(∥x −xi∥),\n(12.7)\nare computed using a radial basis (spherically symmetrical) function K(r).\nIf we want the function f(x) to exactly interpolate the data points, the kernel functions\nmust either be singular at the origin, limr→0 K(r) →∞(Nielson 1993), or a dense linear\nsystem must be solved to determine the magnitude associated with each basis function (Boult\nand Kender 1986). It turns out that, for certain regularized problems, e.g., (3.94–3.96), there\nexist radial basis functions (kernels) that give the same results as a full analytical solution\n(Boult and Kender 1986). Unfortunately, because the dense system solving is cubic in the\nnumber of data points, basis function approaches can only be used for small problems such\nas feature-based image morphing (Beier and Neely 1992).\nWhen a three-dimensional parametric surface is being modeled, the vector-valued func-\ntion f in (12.6) or (3.94–3.102) encodes 3D coordinates (x, y, z) on the surface and the\ndomain x = (s, t) encodes the surface parameterization. One example of such surfaces are\nsymmetry-seeking parametric models, which are elastically deformable versions of general-\nized cylinders6 (Terzopoulos, Witkin, and Kass 1987). In these models, s is the parameter\nalong the spine of the deformable tube and t is the parameter around the tube. A variety of\nsmoothness and radial symmetry forces are used to constrain the model while it is ﬁtted to\nimage-based silhouette curves.\nIt is also possible to deﬁne non-parametric surface models such as general triangulated\nmeshes and to equip such meshes (using ﬁnite element analysis) with both internal smooth-\nness metrics and external data ﬁtting metrics (Sander and Zucker 1990; Fua and Sander 1992;\nDelingette, Hebert, and Ikeuichi 1992; McInerney and Terzopoulos 1993). While most of\nthese approaches assume a standard elastic deformation model, which uses quadratic inter-\nnal smoothness terms, it is also possible to use sub-linear energy models in order to better\npreserve surface creases (Diebel, Thrun, and Br¨unig 2006). Triangle meshes can also be aug-\nmented with either spline elements (Sullivan and Ponce 1998) or subdivision surfaces (Stoll-\nnitz, DeRose, and Salesin 1996; Zorin, Schr¨oder, and Sweldens 1996; Warren and Weimer\n2001; Peters and Reif 2008) to produce surfaces with better smoothness control.\nBoth parametric and non-parametric surface models assume that the topology of the sur-\nface is known and ﬁxed ahead of time. For more ﬂexible surface modeling, we can either rep-\nresent the surface as a collection of oriented points (Section 12.4) or use 3D implicit functions\n(Section 12.5.1), which can also be combined with elastic 3D surface models (McInerney and\nTerzopoulos 1993).\n6 A generalized cylinder (Brooks 1981) is a solid of revolution, i.e., the result of rotating a (usually smooth) curve\naround an axis. It can also be generated by sweeping a slowly varying circular cross-section along the axis. (These\ntwo interpretations are equivalent.)",
  "image_path": "page_614.jpg",
  "pages": [
    613,
    614,
    615
  ]
}