{
  "doc_id": "pages_585_587",
  "text": "11.6 Multi-view stereo\n563\n(a)\n(b)\nFigure 11.18 Three-dimensional scene ﬂow: (a) computed from a multi-camera dome sur-\nrounding the dancer shown in Figure 11.2h–j (Vedula, Baker, Rander et al. 2005) c⃝2005\nIEEE; (b) computed from stereo cameras mounted on a moving vehicle (Wedel, Rabe, Vau-\ndrey et al. 2008) c⃝2008 Springer.\nFua and Leclerc (1995) (Figure 11.19a). A variety of approaches and representations have\nbeen used to solve this problem, including 3D voxel representations (Seitz and Dyer 1999;\nSzeliski and Golland 1999; De Bonet and Viola 1999; Kutulakos and Seitz 2000; Eisert, Stein-\nbach, and Girod 2000; Slabaugh, Culbertson, Slabaugh et al. 2004; Sinha and Pollefeys 2005;\nVogiatzis, Hernandez, Torr et al. 2007; Hiep, Keriven, Pons et al. 2009), level sets (Faugeras\nand Keriven 1998; Pons, Keriven, and Faugeras 2007), polygonal meshes (Fua and Leclerc\n1995; Narayanan, Rander, and Kanade 1998; Hernandez and Schmitt 2004; Furukawa and\nPonce 2009), and multiple depth maps (Kolmogorov and Zabih 2002). Figure 11.19 shows\nrepresentative examples of 3D object models reconstructed using some of these techniques.\nIn order to organize and compare all these techniques, Seitz, Curless, Diebel et al. (2006)\ndeveloped a six-point taxonomy that can help classify algorithms according to the scene rep-\nresentation, photoconsistency measure, visibility model, shape priors, reconstruction algo-\nrithm, and initialization requirements they use. Below, we summarize some of these choices\nand list a few representative papers. For more details, please consult the full survey paper\n(Seitz, Curless, Diebel et al. 2006) and the evaluation Web site, http://vision.middlebury.edu/\nmview/, which contains pointers to even more recent papers and results.\nScene representation.\nOne of the more popular 3D representations is a uniform grid of 3D\nvoxels,7 which can be reconstructed using a variety of carving (Seitz and Dyer 1999; Kutu-\nlakos and Seitz 2000) or optimization (Sinha and Pollefeys 2005; Vogiatzis, Hernandez, Torr\net al. 2007; Hiep, Keriven, Pons et al. 2009) techniques. Level set techniques (Section 5.1.4)\nalso operate on a uniform grid but, instead of representing a binary occupancy map, they\nrepresent the signed distance to the surface (Faugeras and Keriven 1998; Pons, Keriven, and\nFaugeras 2007), which can encode a ﬁner level of detail. Polygonal meshes are another pop-\n7 For outdoor scenes that go to inﬁnity, a non-uniform gridding of space may be preferable (Slabaugh, Culbertson,\nSlabaugh et al. 2004).\n564\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\n(h)\nFigure 11.19\nMulti-view stereo algorithms: (a) surface-based stereo (Fua and Leclerc\n1995); (b) voxel coloring (Seitz and Dyer 1999) c⃝1999 Springer; (c) depth map merg-\ning (Narayanan, Rander, and Kanade 1998); (d) level set evolution (Faugeras and Keriven\n1998) c⃝1998 IEEE; (e) silhouette and stereo fusion (Hernandez and Schmitt 2004) c⃝2004\nElsevier; (f) multi-view image matching (Pons, Keriven, and Faugeras 2005) c⃝2005 IEEE;\n(g) volumetric graph cut (Vogiatzis, Torr, and Cipolla 2005) c⃝2005 IEEE; (h) carved visual\nhulls (Furukawa and Ponce 2009) c⃝2009 Springer.\nular representation (Fua and Leclerc 1995; Narayanan, Rander, and Kanade 1998; Isidoro\nand Sclaroff 2003; Hernandez and Schmitt 2004; Furukawa and Ponce 2009; Hiep, Keriven,\nPons et al. 2009). Meshes are the standard representation used in computer graphics and\nalso readily support the computation of visibility and occlusions. Finally, as we discussed in\nthe previous section, multiple depth maps can also be used (Szeliski 1999; Kolmogorov and\nZabih 2002; Kang and Szeliski 2004). Many algorithms also use more than a single represen-\ntation, e.g., they may start by computing multiple depth maps and then merge them into a 3D\nobject model (Narayanan, Rander, and Kanade 1998; Furukawa and Ponce 2009; Goesele,\nCurless, and Seitz 2006; Goesele, Snavely, Curless et al. 2007; Furukawa, Curless, Seitz et\nal. 2010).\n11.6 Multi-view stereo\n565\nPhotoconsistency measure.\nAs we discussed in (Section 11.3.1), a variety of similarity\nmeasures can be used to compare pixel values in different images, including measures that\ntry to discount illumination effects or be less sensitive to outliers. In multi-view stereo, algo-\nrithms have a choice of computing these measures directly on the surface of the model, i.e., in\nscene space, or projecting pixel values from one image (or from a textured model) back into\nanother image, i.e., in image space. (The latter corresponds more closely to a Bayesian ap-\nproach, since input images are noisy measurements of the colored 3D model.) The geometry\nof the object, i.e., its distance to each camera and its local surface normal, when available, can\nbe used to adjust the matching windows used in the computation to account for foreshortening\nand scale change (Goesele, Snavely, Curless et al. 2007).\nVisibility model.\nA big advantage that multi-view stereo algorithms have over single-depth-\nmap approaches is their ability to reason in a principled manner about visibility and occlu-\nsions. Techniques that use the current state of the 3D model to predict which surface pixels\nare visible in each image (Kutulakos and Seitz 2000; Faugeras and Keriven 1998; Vogiatzis,\nHernandez, Torr et al. 2007; Hiep, Keriven, Pons et al. 2009) are classiﬁed as using geometric\nvisibility models in the taxonomy of Seitz, Curless, Diebel et al. (2006). Techniques that se-\nlect a neighboring subset of image to match are called quasi-geometric (Narayanan, Rander,\nand Kanade 1998; Kang and Szeliski 2004; Hernandez and Schmitt 2004), while techniques\nthat use traditional robust similarity measures are called outlier-based. While full geometric\nreasoning is the most principled and accurate approach, it can be very slow to evaluate and\ndepends on the evolving quality of the current surface estimate to predict visibility, which can\nbe a bit of a chicken-and-egg problem, unless conservative assumptions are used, as they are\nby Kutulakos and Seitz (2000).\nShape priors.\nBecause stereo matching is often underconstrained, especially in texture-\nless regions, most matching algorithms adopt (either explicitly or implicitly) some form of\nprior model for the expected shape. Many of the techniques that rely on optimization use a\n3D smoothness or area-based photoconsistency constraint, which, because of the natural ten-\ndency of smooth surfaces to shrink inwards, often results in a minimal surface prior (Faugeras\nand Keriven 1998; Sinha and Pollefeys 2005; Vogiatzis, Hernandez, Torr et al. 2007). Ap-\nproaches that carve away the volume of space often stop once a photoconsistent solution is\nfound (Seitz and Dyer 1999; Kutulakos and Seitz 2000), which corresponds to a maximal sur-\nface bias, i.e., these techniques tend to over-estimate the true shape. Finally, multiple depth\nmap approaches often adopt traditional image-based smoothness (regularization) constraints.\nReconstruction algorithm.\nThe details of how the actual reconstruction algorithm pro-\nceeds is where the largest variety—and greatest innovation—in multi-view stereo algorithms",
  "image_path": "page_586.jpg",
  "pages": [
    585,
    586,
    587
  ]
}