{
  "doc_id": "pages_924_926",
  "text": "902\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nSoatto, S., Yezzi, A. J., and Jin, H. (2003). Tales of shape and radiance in multiview stereo.\nIn Ninth International Conference on Computer Vision (ICCV 2003), pp. 974–981, Nice,\nFrance.\nSoille, P. (2006). Morphological image compositing. IEEE Transactions on Pattern Anal-\nysis and Machine Intelligence, 28(5):673–683.\nSolina, F. and Bajcsy, R.\n(1990).\nRecovery of parametric models from range images:\nThe case for superquadrics with global deformations. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 12(2):131–147.\nSontag, D. and Jaakkola, T. (2007). New outer bounds on the marginal polytope. In\nAdvances in Neural Information Processing Systems.\nSontag, D., Meltzer, T., Globerson, A., Jaakkola, T., and Weiss, Y. (2008). Tightening LP\nrelaxations for MAP using message passing. In Uncertainty in Artiﬁcial Intelligence\n(UAI).\nSoucy, M. and Laurendeau, D. (1992). Multi-resolution surface modeling from multiple\nrange views. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’92), pp. 348–353, Champaign, Illinois.\nSrinivasan, S., Chellappa, R., Veeraraghavan, A., and Aggarwal, G. (2005). Electronic\nimage stabilization and mosaicking algorithms. In Bovik, A. (ed.), Handbook of Image\nand Video Processing, Academic Press.\nSrivasan, P., Liang, P., and Hackwood, S. (1990). Computational geometric methods in\nvolumetric intersections for 3D reconstruction. Pattern Recognition, 23(8):843–857.\nStamos, I., Liu, L., Chen, C., Wolberg, G., Yu, G., and Zokai, S. (2008). Integrating\nautomated range registration with multiview geometry for the photorealistic modeling\nof large-scale scenes. International Journal of Computer Vision, 78(2-3):237–260.\nStark, J. A. (2000). Adaptive image contrast enhancement using generalizations of his-\ntogram equalization. IEEE Transactions on Image Processing, 9(5):889–896.\nStauffer, C. and Grimson, W.\n(1999).\nAdaptive background mixture models for real-\ntime tracking. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’99), pp. 246–252, Fort Collins.\nSteedly, D. and Essa, I. (2001). Propagation of innovative information in non-linear least-\nsquares structure from motion. In Eighth International Conference on Computer Vision\n(ICCV 2001), pp. 223–229, Vancouver, Canada.\nSteedly, D., Essa, I., and Dellaert, F. (2003). Spectral partitioning for structure from mo-\ntion. In Ninth International Conference on Computer Vision (ICCV 2003), pp. 996–\n1003, Nice, France.\nReferences\n903\nSteedly, D., Pal, C., and Szeliski, R. (2005). Efﬁciently registering video into panoramic\nmosaics.\nIn Tenth International Conference on Computer Vision (ICCV 2005),\npp. 1300–1307, Beijing, China.\nSteele, R. and Jaynes, C. (2005). Feature uncertainty arising from covariant image noise.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 1063–1070, San Diego, CA.\nSteele, R. M. and Jaynes, C. (2006). Overconstrained linear estimation of radial distortion\nand multi-view geometry. In Ninth European Conference on Computer Vision (ECCV\n2006), pp. 253–264.\nStein, A., Hoiem, D., and Hebert, M. (2007). Learning to extract object boundaries using\nmotion cues. In Eleventh International Conference on Computer Vision (ICCV 2007),\nRio de Janeiro, Brazil.\nStein, F. and Medioni, G. (1992). Structural indexing: Efﬁcient 3-D object recognition.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 14(2):125–145.\nStein, G. (1995). Accurate internal camera calibration using rotation, with analysis of\nsources of error.\nIn Fifth International Conference on Computer Vision (ICCV’95),\npp. 230–236, Cambridge, Massachusetts.\nStein, G. (1997). Lens distortion calibration using point correspondences. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR’97),\npp. 602–608, San Juan, Puerto Rico.\nStenger, B., Thayananthan, A., Torr, P. H. S., and Cipolla, R. (2006). Model-based hand\ntracking using a hierarchical bayesian ﬁlter. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 28(9):1372–1384.\nStewart, C. V. (1999). Robust parameter estimation in computer vision. SIAM Reviews,\n41(3):513–537.\nStiller, C. and Konrad, J. (1999). Estimating motion in image sequences: A tutorial on\nmodeling and computation of 2D motion. IEEE Signal Processing Magazine, 16(4):70–\n91.\nStollnitz, E. J., DeRose, T. D., and Salesin, D. H. (1996). Wavelets for Computer Graphics:\nTheory and Applications. Morgan Kaufmann, San Francisco.\nStrang, G. (1988). Linear Algebra and its Applications. Harcourt, Brace, Jovanovich,\nPublishers, San Diego, 3rd edition.\nStrang, G. (1989). Wavelets and dilation equations: A brief introduction. SIAM Reviews,\n31(4):614–627.\n904\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nStrecha, C., Fransens, R., and Van Gool, L. (2006). Combined depth and outlier estimation\nin multi-view stereo. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’2006), pp. 2394–2401, New York City, NY.\nStrecha, C., Tuytelaars, T., and Van Gool, L. (2003). Dense matching of multiple wide-\nbaseline views. In Ninth International Conference on Computer Vision (ICCV 2003),\npp. 1194–1201, Nice, France.\nStrecha, C., von Hansen, W., Van Gool, L., Fua, P., and Thoennessen, U. (2008). On\nbenchmarking camera calibration and multi-view stereo. In IEEE Computer Society\nConference on Computer Vision and Pattern Recognition (CVPR 2008), Anchorage,\nAK.\nSturm, P. (2005). Multi-view geometry for general camera models. In IEEE Computer So-\nciety Conference on Computer Vision and Pattern Recognition (CVPR’2005), pp. 206–\n212, San Diego, CA.\nSturm, P. and Ramalingam, S. (2004). A generic concept for camera calibration. In Eighth\nEuropean Conference on Computer Vision (ECCV 2004), pp. 1–13, Prague.\nSturm, P. and Triggs, W. (1996). A factorization based algorithm for multi-image projective\nstructure and motion. In Fourth European Conference on Computer Vision (ECCV’96),\npp. 709–720, Cambridge, England.\nSu, H., Sun, M., Fei-Fei, L., and Savarese, S. (2009). Learning a dense multi-view repre-\nsentation for detection, viewpoint classiﬁcation and synthesis of object categories. In\nTwelfth International Conference on Computer Vision (ICCV 2009), Kyoto, Japan.\nSudderth, E. B., Torralba, A., Freeman, W. T., and Willsky, A. S. (2008). Describing visual\nscenes using transformed objects and parts. International Journal of Computer Vision,\n77(1-3):291–330.\nSullivan, S. and Ponce, J.\n(1998).\nAutomatic model construction and pose estimation\nfrom photographs using triangular splines. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 20(10):1091–1096.\nSun, D., Roth, S., Lewis, J. P., and Black, M. J. (2008). Learning optical ﬂow. In Tenth\nEuropean Conference on Computer Vision (ECCV 2008), pp. 83–97, Marseilles.\nSun, J., Zheng, N., and Shum, H. (2003). Stereo matching using belief propagation. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 25(7):787–800.\nSun, J., Jia, J., Tang, C.-K., and Shum, H.-Y. (2004). Poisson matting. ACM Transactions\non Graphics (Proc. SIGGRAPH 2004), 23(3):315–321.\nSun, J., Li, Y., Kang, S. B., and Shum, H.-Y. (2006). Flash matting. ACM Transactions on\nGraphics, 25(3):772–778.",
  "image_path": "page_925.jpg",
  "pages": [
    924,
    925,
    926
  ]
}