{
  "doc_id": "pages_322_324",
  "text": "300\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n1986; Briggs, Henson, and McCormick 2000). To coarsen the original problem, they select\na smaller number of variables such that the remaining ﬁne-level variables are strongly cou-\npled to at least one coarse-level variable. Figure 5.15 shows this process schematically, while\n(5.25) gives the deﬁnition for strong coupling except that, in this case, the original weights\nwij in the normalized cut are used instead of merge probabilities pij.\nOnce a set of coarse variables has been selected, an inter-level interpolation matrix with\nelements similar to the left hand side of (5.25) is used to deﬁne a reduced version of the nor-\nmalized cuts problem. In addition to computing the weight matrix using interpolation-based\ncoarsening, additional region statistics are used to modulate the weights. After a normalized\ncut has been computed at the coarsest level of analysis, the membership values of ﬁner-level\nnodes are computed by interpolating parent values and mapping values within ϵ = 0.1 of 0\nand 1 to pure Boolean values.\nAn example of the segmentation produced by weighted aggregation (SWA) is shown in\nFigure 5.22, along with the most recent probabilistic bottom-up merging algorithm by Alpert,\nGalun, Basri et al. (2007), which was described in Section 5.2. In even more recent work,\nWang and Oliensis (2010) show how to estimate statistics over segmentations (e.g., mean\nregion size) directly from the afﬁnity graph. They use this to produce segmentations that are\nmore central with respect to other possible segmentations.\n5.5 Graph cuts and energy-based methods\nA common theme in image segmentation algorithms is the desire to group pixels that have\nsimilar appearance (statistics) and to have the boundaries between pixels in different regions\nbe of short length and across visible discontinuities. If we restrict the boundary measurements\nto be between immediate neighbors and compute region membership statistics by summing\nover pixels, we can formulate this as a classic pixel-based energy function using either a\nvariational formulation (regularization, see Section 3.7.1) or as a binary Markov random\nﬁeld (Section 3.7.2).\nExamples of the continuous approach include (Mumford and Shah 1989; Chan and Vese\n1992; Zhu and Yuille 1996; Tabb and Ahuja 1997) along with the level set approaches dis-\ncussed in Section 5.1.4.\nAn early example of a discrete labeling problem that combines\nboth region-based and boundary-based energy terms is the work of Leclerc (1989), who used\nminimum description length (MDL) coding to derive the energy function being minimized.\nBoykov and Funka-Lea (2006) present a wonderful survey of various energy-based tech-\nniques for binary object segmentation, some of which we discuss below.\nAs we saw in Section 3.7.2, the energy corresponding to a segmentation problem can be\n5.5 Graph cuts and energy-based methods\n301\nwritten (c.f. Equations (3.100) and (3.108–3.113)) as\nE(f) =\nX\ni,j\nEr(i, j) + Eb(i, j),\n(5.50)\nwhere the region term\nEr(i, j) = ES(I(i, j); R(f(i, j)))\n(5.51)\nis the negative log likelihood that pixel intensity (or color) I(i, j) is consistent with the statis-\ntics of region R(f(i, j)) and the boundary term\nEb(i, j) = sx(i, j)δ(f(i, j) −f(i + 1, j)) + sy(i, j)δ(f(i, j) −f(i, j + 1))\n(5.52)\nmeasures the inconsistency between N4 neighbors modulated by local horizontal and vertical\nsmoothness terms sx(i, j) and sy(i, j).\nRegion statistics can be something as simple as the mean gray level or color (Leclerc\n1989), in which case\nES(I; µk) = ∥I −µk∥2.\n(5.53)\nAlternatively, they can be more complex, such as region intensity histograms (Boykov and\nJolly 2001) or color Gaussian mixture models (Rother, Kolmogorov, and Blake 2004). For\nsmoothness (boundary) terms, it is common to make the strength of the smoothness sx(i, j)\ninversely proportional to the local edge strength (Boykov, Veksler, and Zabih 2001).\nOriginally, energy-based segmentation problems were optimized using iterative gradient\ndescent techniques, which were slow and prone to getting trapped in local minima. Boykov\nand Jolly (2001) were the ﬁrst to apply the binary MRF optimization algorithm developed by\nGreig, Porteous, and Seheult (1989) to binary object segmentation.\nIn this approach, the user ﬁrst delineates pixels in the background and foreground regions\nusing a few strokes of an image brush (Figure 3.61). These pixels then become the seeds that\ntie nodes in the S–T graph to the source and sink labels S and T (Figure 5.23a). Seed pixels\ncan also be used to estimate foreground and background region statistics (intensity or color\nhistograms).\nThe capacities of the other edges in the graph are derived from the region and boundary\nenergy terms, i.e., pixels that are more compatible with the foreground or background region\nget stronger connections to the respective source or sink; adjacent pixels with greater smooth-\nness also get stronger links. Once the minimum-cut/maximum-ﬂow problem has been solved\nusing a polynomial time algorithm (Goldberg and Tarjan 1988; Boykov and Kolmogorov\n2004), pixels on either side of the computed cut are labeled according to the source or sink to\nwhich they remain connected (Figure 5.23b). While graph cuts is just one of several known\ntechniques for MRF energy minimization (Appendix B.5.4), it is still the one most commonly\nused for solving binary MRF problems.\n302\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n  Object\nterminal\n  terminal\nBackground \np\nq\nr\nw\nv\nS\nT\nBackground \n  Object\n  terminal\nterminal\np\nq\nr\nw\nv\nS\nT\ncut\n(a)\n(b)\nFigure 5.23 Graph cuts for region segmentation (Boykov and Jolly 2001) c⃝2001 IEEE: (a)\nthe energy function is encoded as a maximum ﬂow problem; (b) the minimum cut determines\nthe region boundary.\n(a)\n(b)\n(c)\nFigure 5.24\nGrabCut image segmentation (Rother, Kolmogorov, and Blake 2004) c⃝2004\nACM: (a) the user draws a bounding box in red; (b) the algorithm guesses color distributions\nfor the object and background and performs a binary segmentation; (c) the process is repeated\nwith better region statistics.\nThe basic binary segmentation algorithm of Boykov and Jolly (2001) has been extended\nin a number of directions. The GrabCut system of Rother, Kolmogorov, and Blake (2004)\niteratively re-estimates the region statistics, which are modeled as a mixtures of Gaussians in\ncolor space. This allows their system to operate given minimal user input, such as a single\nbounding box (Figure 5.24a)—the background color model is initialized from a strip of pixels\naround the box outline. (The foreground color model is initialized from the interior pixels,\nbut quickly converges to a better estimate of the object.) The user can also place additional\nstrokes to reﬁne the segmentation as the solution progresses. In more recent work, Cui, Yang,\nWen et al. (2008) use color and edge models derived from previous segmentations of similar\nobjects to improve the local models used in GrabCut.\nAnother major extension to the original binary segmentation formulation is the addition of",
  "image_path": "page_323.jpg",
  "pages": [
    322,
    323,
    324
  ]
}