{
  "doc_id": "pages_299_301",
  "text": "5.1 Active contours\n277\n(a)\n(b)\nFigure 5.6\nProbability density propagation (Isard and Blake 1998) c⃝1998 Springer. At\nthe beginning of each estimation step, the probability density is updated according to the\nlinear dynamic model (deterministic drift) and its certainty is reduced due to process noise\n(stochastic diffusion). New measurements introduce additional information that helps reﬁne\nthe current estimate. (a) The Kalman ﬁlter models the distributions as uni-modal, i.e., using a\nmean and covariance. (b) Some applications require more general multi-modal distributions.\n278\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\nFigure 5.7 Factored sampling using particle ﬁlter in the CONDENSATION algorithm (Is-\nard and Blake 1998) c⃝1998 Springer: (a) each density distribution is represented using a\nsuperposition of weighted particles; (b) the drift-diffusion-measurement cycle implemented\nusing random sampling, perturbation, and re-weighting stages.\n5.1 Active contours\n279\n(a)\n(b)\n(c)\nFigure 5.8\nHead tracking using CONDENSATION (Isard and Blake 1998)\nc⃝1998\nSpringer: (a) sample set representation of head estimate distribution; (b) multiple measure-\nments at each control vertex location; (c) multi-hypothesis tracking over time.\nParticle ﬁltering techniques represent a probability distribution using a collection of weighted\npoint samples (Figure 5.7a) (Andrieu, de Freitas, Doucet et al. 2003; Bishop 2006; Koller\nand Friedman 2009). To update the locations of the samples according to the linear dy-\nnamics (deterministic drift), the centers of the samples are updated according to (5.18) and\nmultiple samples are generated for each point (Figure 5.7b). These are then perturbed to\naccount for the stochastic diffusion, i.e., their locations are moved by random vectors taken\nfrom the distribution of w.6 Finally, the weights of these samples are multiplied by the mea-\nsurement probability density, i.e., we take each sample and measure its likelihood given the\ncurrent (new) measurements. Because the point samples represent and propagate conditional\nestimates of the multi-modal density, Isard and Blake (1998) dubbed their algorithm CONdi-\ntional DENSity propagATION or CONDENSATION.\nFigure 5.8a shows what a factored sample of a head tracker might look like, drawing\na red B-spline contour for each of (a subset of) the particles being tracked. Figure 5.8b\nshows why the measurement density itself is often multi-modal: the locations of the edges\nperpendicular to the spline curve can have multiple local maxima due to background clutter.\nFinally, Figure 5.8c shows the temporal evolution of the conditional density (x coordinate of\nthe head and shoulder tracker centroid) as it tracks several people over time.\nhypothesis tracking (Bar-Shalom and Fortmann 1988; Cham and Rehg 1999).\n6 Note that because of the structure of these steps, non-linear dynamics and non-Gaussian noise can be used.",
  "image_path": "page_300.jpg",
  "pages": [
    299,
    300,
    301
  ]
}