{
  "doc_id": "pages_840_842",
  "text": "818\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nde Agapito, L., Hayman, E., and Reid, I. (2001). Self-calibration of rotating and zooming\ncameras. International Journal of Computer Vision, 45(2):107–127.\nde Berg, M., Cheong, O., van Kreveld, M., and Overmars, M. (2006). Computational\nGeometry: Algorithms and Applications. Springer, New York, NY, third edition.\nDe Bonet, J. (1997). Multiresolution sampling procedure for analysis and synthesis of\ntexture images. In ACM SIGGRAPH 1997 Conference Proceedings, pp. 361–368, Los\nAngeles.\nDe Bonet, J. S. and Viola, P. (1999). Poxels: Probabilistic voxelized volume reconstruc-\ntion. In Seventh International Conference on Computer Vision (ICCV’99), pp. 418–425,\nKerkyra, Greece.\nDe Castro, E. and Morandi, C. (1987). Registration of translated and rotated images using\nﬁnite Fourier transforms. IEEE Transactions on Pattern Analysis and Machine Intelli-\ngence, PAMI-9(5):700–703.\nde Haan, G. and Bellers, E. B. (1998). Deinterlacing—an overview. Proceedings of the\nIEEE, 86:1839–1857.\nDe la Torre, F. and Black, M. J. (2003). A framework for robust subspace learning. Inter-\nnational Journal of Computer Vision, 54(1/2/3):117–142.\nDebevec, P. (1998). Rendering synthetic objects into real scenes: Bridging traditional and\nimage-based graphics with global illumination and high dynamic range photography. In\nACM SIGGRAPH 1998 Conference Proceedings, pp. 189–198.\nDebevec, P. (2006). Virtual cinematography: Relighting through computation. Computer,\n39(8):57–65.\nDebevec, P., Hawkins, T., Tchou, C., Duiker, H.-P., Sarokin, W., and Sagar, M. (2000).\nAcquiring the reﬂectance ﬁeld of a human face. In ACM SIGGRAPH 2000 Conference\nProceedings, pp. 145–156.\nDebevec, P., Wenger, A., Tchou, C., Gardner, A., Waese, J., and Hawkins, T.\n(2002).\nA lighting reproduction approach to live-action compositing. ACM Transactions on\nGraphics (Proc. SIGGRAPH 2002), 21(3):547–556.\nDebevec, P. E. (1999). Image-based modeling and lighting. Computer Graphics, 33(4):46–\n50.\nDebevec, P. E. and Malik, J. (1997). Recovering high dynamic range radiance maps from\nphotographs. In ACM SIGGRAPH 1997 Conference Proceedings, pp. 369–378.\nDebevec, P. E., Taylor, C. J., and Malik, J. (1996). Modeling and rendering architec-\nture from photographs: A hybrid geometry- and image-based approach. In ACM SIG-\nGRAPH 1996 Conference Proceedings, pp. 11–20, New Orleans.\nReferences\n819\nDebevec, P. E., Yu, Y., and Borshukov, G. D. (1998). Efﬁcient view-dependent image-based\nrendering with projective texture-mapping. In Eurographics Rendering Workshop 1998,\npp. 105–116.\nDeCarlo, D. and Santella, A. (2002). Stylization and abstraction of photographs. ACM\nTransactions on Graphics (Proc. SIGGRAPH 2002), 21(3):769–776.\nDeCarlo, D., Metaxas, D., and Stone, M. (1998). An anthropometric face model using\nvariational techniques. In ACM SIGGRAPH 1998 Conference Proceedings, pp. 67–74.\nDelingette, H., Hebert, M., and Ikeuichi, K. (1992). Shape representation and image seg-\nmentation using deformable surfaces. Image and Vision Computing, 10(3):132–144.\nDellaert, F. and Collins, R. (1999). Fast image-based tracking by selective pixel integration.\nIn ICCV Workshop on Frame-Rate Vision, pp. 1–22.\nDelong, A., Osokin, A., Isack, H. N., and Boykov, Y. (2010). Fast approximate energy\nminimization with label costs. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2010), San Francisco, CA.\nDeMenthon, D. I. and Davis, L. S. (1995). Model-based object pose in 25 lines of code.\nInternational Journal of Computer Vision, 15(1-2):123–141.\nDemmel, J., Dongarra, J., Eijkhout, V., Fuentes, E., Petitet, A. et al. (2005). Self-adapting\nlinear algebra algorithms and software. Proceedings of the IEEE, 93(2):293–312.\nDempster, A., Laird, N. M., and Rubin, D. B. (1977). Maximum likelihood from incom-\nplete data via the EM algorithm. Journal of the Royal Statistical Society B, 39(1):1–38.\nDeng, J., Dong, W., Socher, R., Li, L.-J., Li, K., and Fei-Fei, L. (2009). ImageNet: A large-\nscale hierarchical image database. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2009), Miami Beach, FL.\nDeriche, R. (1987). Using Canny’s criteria to derive a recursively implemented optimal\nedge detector. International Journal of Computer Vision, 1(2):167–187.\nDeriche, R. (1990). Fast algorithms for low-level vision. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 12(1):78–87.\nDeutscher, J. and Reid, I. (2005). Articulated body motion capture by stochastic search.\nInternational Journal of Computer Vision, 61(2):185–205.\nDeutscher, J., Blake, A., and Reid, I. (2000). Articulated body motion capture by annealed\nparticle ﬁltering. In IEEE Computer Society Conference on Computer Vision and Pat-\ntern Recognition (CVPR’2000), pp. 126–133, Hilton Head Island.\nDev, P. (1974). Segmentation Processes in Visual Perception: A Cooperative Neural Model.\nCOINS Technical Report 74C-5, University of Massachusetts at Amherst.\n820\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nDhond, U. R. and Aggarwal, J. K. (1989). Structure from stereo—a review. IEEE Trans-\nactions on Systems, Man, and Cybernetics, 19(6):1489–1510.\nDick, A., Torr, P. H. S., and Cipolla, R. (2004). Modelling and interpretation of architecture\nfrom several images. International Journal of Computer Vision, 60(2):111–134.\nDickinson, S., Leonardis, A., Schiele, B., and Tarr, M. J. (eds). (2007). Object Catego-\nrization: Computer and Human Vision Perspectives, Cambridge University Press, New\nYork.\nDickmanns, E. D. and Graefe, V. (1988). Dynamic monocular machine vision. Machine\nVision and Applications, 1:223–240.\nDiebel, J. (2006). Representing Attitude: Euler Angles, Quaternions, and Rotation Vectors.\nTechnical Report, Stanford University. http://ai.stanford.edu/∼diebel/attitude.html.\nDiebel, J. R., Thrun, S., and Br¨unig, M. (2006). A Bayesian method for probable surface\nreconstruction and decimation. ACM Transactions on Graphics, 25(1).\nDimitrijevic, M., Lepetit, V., and Fua, P.\n(2006).\nHuman body pose detection us-\ning Bayesian spatio-temporal templates. Computer Vision and Image Understanding,\n104(2-3):127–139.\nDinh, H. Q., Turk, G., and Slabaugh, G. (2002). Reconstructing surfaces by volumetric\nregularization using radial basis functions. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 24(10):1358–1371.\nDivvala, S., Hoiem, D., Hays, J., Efros, A. A., and Hebert, M. (2009). An empirical study\nof context in object detection. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2009), Miami, FL.\nDodgson, N. A. (1992). Image Resampling. Technical Report TR261, Wolfson College\nand Computer Laboratory, University of Cambridge.\nDoll`ar, P., Belongie, S., and Perona, P. (2010). The fastest pedestrian detector in the west.\nIn British Machine Vision Conference (BMVC 2010), Aberystwyth, Wales, UK.\nDoll`ar, P., Wojek, C., Schiele, B., and Perona, P. (2009). Pedestrian detection: A bench-\nmark. In IEEE Computer Society Conference on Computer Vision and Pattern Recog-\nnition (CVPR 2009), Miami Beach, FL.\nDoretto, G. and Soatto, S. (2006). Dynamic shape and appearance models. IEEE Transac-\ntions on Pattern Analysis and Machine Intelligence, 28(12):2006–2019.\nDoretto, G., Chiuso, A., Wu, Y. N., and Soatto, S. (2003). Dynamic textures. International\nJournal of Computer Vision, 51(2):91–109.",
  "image_path": "page_841.jpg",
  "pages": [
    840,
    841,
    842
  ]
}