{
  "doc_id": "pages_181_183",
  "text": "3.5 Pyramids and wavelets\n159\n(a)\n(b)\n(c)\n(d)\nFigure 3.40 Steerable shiftable multiscale transforms (Simoncelli, Freeman, Adelson et al.\n1992) c⃝1992 IEEE: (a) radial multi-scale frequency domain decomposition; (b) original\nimage; (c) a set of four steerable ﬁlters; (d) the radial multi-scale wavelet decomposition.\nimplementation of shiftable multi-scale transforms or, more succinctly, steerable pyramids.\nTheir representation is not only overcomplete (which eliminates the aliasing problem) but is\nalso orientationally selective and has identical analysis and synthesis basis functions, i.e., it is\nself-inverting, just like “regular” wavelets. As a result, this makes steerable pyramids a much\nmore useful basis for the structural analysis and matching tasks commonly used in computer\nvision.\nFigure 3.40a shows how such a decomposition looks in frequency space. Instead of re-\ncursively dividing the frequency domain into 2 × 2 squares, which results in checkerboard\nhigh frequencies, radial arcs are used instead. Figure 3.40b illustrates the resulting pyramid\nsub-bands. Even through the representation is overcomplete, i.e., there are more wavelet co-\nefﬁcients than input pixels, the additional frequency and orientation selectivity makes this\nrepresentation preferable for tasks such as texture analysis and synthesis (Portilla and Simon-\ncelli 2000) and image denoising (Portilla, Strela, Wainwright et al. 2003; Lyu and Simoncelli\n2009).\n160\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\nFigure 3.41 Laplacian pyramid blending (Burt and Adelson 1983b) c⃝1983 ACM: (a) orig-\ninal image of apple, (b) original image of orange, (c) regular splice, (d) pyramid blend.\n3.5.5 Application: Image blending\nOne of the most engaging and fun applications of the Laplacian pyramid presented in Sec-\ntion 3.5.3 is the creation of blended composite images, as shown in Figure 3.41 (Burt and\nAdelson 1983b). While splicing the apple and orange images together along the midline\nproduces a noticeable cut, splining them together (as Burt and Adelson (1983b) called their\nprocedure) creates a beautiful illusion of a truly hybrid fruit. The key to their approach is\nthat the low-frequency color variations between the red apple and the orange are smoothly\nblended, while the higher-frequency textures on each fruit are blended more quickly to avoid\n“ghosting” effects when two textures are overlaid.\nTo create the blended image, each source image is ﬁrst decomposed into its own Lapla-\ncian pyramid (Figure 3.42, left and middle columns). Each band is then multiplied by a\nsmooth weighting function whose extent is proportional to the pyramid level. The simplest\nand most general way to create these weights is to take a binary mask image (Figure 3.43c)\nand to construct a Gaussian pyramid from this mask. Each Laplacian pyramid image is then\n3.5 Pyramids and wavelets\n161\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\n(h)\n(i)\n(j)\n(k)\n(l)\nFigure 3.42 Laplacian pyramid blending details (Burt and Adelson 1983b) c⃝1983 ACM.\nThe ﬁrst three rows show the high, medium, and low frequency parts of the Laplacian pyramid\n(taken from levels 0, 2, and 4). The left and middle columns show the original apple and\norange images weighted by the smooth interpolation functions, while the right column shows\nthe averaged contributions.",
  "image_path": "page_182.jpg",
  "pages": [
    181,
    182,
    183
  ]
}