{
  "doc_id": "pages_470_472",
  "text": "448\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\nFigure 9.11\nRecognizing panoramas (Brown, Szeliski, and Winder 2005), ﬁgures cour-\ntesy of Matthew Brown: (a) input images with pairwise matches; (b) images grouped into\nconnected components (panoramas); (c) individual panoramas registered and blended into\nstitched composites.\n9.2 Global alignment\n449\nFigure 9.12\nMatching errors (Brown, Szeliski, and Winder 2004): accidental matching of\nseveral features can lead to matches between pairs of images that do not actually overlap.\nFigure 9.13\nValidation of image matches by direct pixel error comparison can fail when the\nscene contains moving objects (Uyttendaele, Eden, and Szeliski 2001) c⃝2001 IEEE.\n450\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nheuristics, such as priors on typical camera motions as well as machine learning techniques\napplied to the problem of match validation.\n9.2.4 Direct vs. feature-based alignment\nGiven that there exist these two approaches to aligning images, which is preferable?\nEarly feature-based methods would get confused in regions that were either too textured\nor not textured enough. The features would often be distributed unevenly over the images,\nthereby failing to match image pairs that should have been aligned. Furthermore, establishing\ncorrespondences relied on simple cross-correlation between patches surrounding the feature\npoints, which did not work well when the images were rotated or had foreshortening due to\nhomographies.\nToday, feature detection and matching schemes are remarkably robust and can even be\nused for known object recognition from widely separated views (Lowe 2004). Features not\nonly respond to regions of high “cornerness” (F¨orstner 1986; Harris and Stephens 1988) but\nalso to “blob-like” regions (Lowe 2004), and uniform areas (Matas, Chum, Urban et al. 2004;\nTuytelaars and Van Gool 2004). Furthermore, because they operate in scale-space and use a\ndominant orientation (or orientation invariant descriptors), they can match images that differ\nin scale, orientation, and even foreshortening. Our own experience in working with feature-\nbased approaches is that if the features are well distributed over the image and the descriptors\nreasonably designed for repeatability, enough correspondences to permit image stitching can\nusually be found (Brown, Szeliski, and Winder 2005).\nThe biggest disadvantage of direct pixel-based alignment techniques is that they have a\nlimited range of convergence. Even though they can be used in a hierarchical (coarse-to-\nﬁne) estimation framework, in practice it is hard to use more than two or three levels of a\npyramid before important details start to be blurred away.11 For matching sequential frames\nin a video, direct approaches can usually be made to work. However, for matching partially\noverlapping images in photo-based panoramas or for image collections where the contrast or\ncontent varies too much, they fail too often to be useful and feature-based approaches are\ntherefore preferred.\n9.3 Compositing\nOnce we have registered all of the input images with respect to each other, we need to decide\nhow to produce the ﬁnal stitched mosaic image. This involves selecting a ﬁnal compositing\nsurface (ﬂat, cylindrical, spherical, etc.) and view (reference image). It also involves selecting\n11 Fourier-based correlation (Szeliski 1996; Szeliski and Shum 1997) can extend this range but requires cylindrical\nimages or motion prediction to be useful.",
  "image_path": "page_471.jpg",
  "pages": [
    470,
    471,
    472
  ]
}