{
  "doc_id": "pages_202_204",
  "text": "180\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n3.7.2 Markov random ﬁelds\nAs we have just seen, regularization, which involves the minimization of energy functionals\ndeﬁned over (piecewise) continuous functions, can be used to formulate and solve a variety\nof low-level computer vision problems. An alternative technique is to formulate a Bayesian\nmodel, which separately models the noisy image formation (measurement) process, as well\nas assuming a statistical prior model over the solution space. In this section, we look at\npriors based on Markov random ﬁelds, whose log-likelihood can be described using local\nneighborhood interaction (or penalty) terms (Kindermann and Snell 1980; Geman and Geman\n1984; Marroquin, Mitter, and Poggio 1987; Li 1995; Szeliski, Zabih, Scharstein et al. 2008).\nThe use of Bayesian modeling has several potential advantages over regularization (see\nalso Appendix B). The ability to model measurement processes statistically enables us to\nextract the maximum information possible from each measurement, rather than just guessing\nwhat weighting to give the data. Similarly, the parameters of the prior distribution can often\nbe learned by observing samples from the class we are modeling (Roth and Black 2007a;\nTappen 2007; Li and Huttenlocher 2008). Furthermore, because our model is probabilistic,\nit is possible to estimate (in principle) complete probability distributions over the unknowns\nbeing recovered and, in particular, to model the uncertainty in the solution, which can be\nuseful in latter processing stages. Finally, Markov random ﬁeld models can be deﬁned over\ndiscrete variables, such as image labels (where the variables have no proper ordering), for\nwhich regularization does not apply.\nRecall from (3.68) in Section 3.4.3 (or see Appendix B.4) that, according to Bayes’ Rule,\nthe posterior distribution for a given set of measurements y, p(y|x), combined with a prior\np(x) over the unknowns x, is given by\np(x|y) = p(y|x)p(x)\np(y)\n,\n(3.106)\nwhere p(y) =\nR\nx p(y|x)p(x) is a normalizing constant used to make the p(x|y) distribution\nproper (integrate to 1). Taking the negative logarithm of both sides of (3.106), we get\n−log p(x|y) = −log p(y|x) −log p(x) + C,\n(3.107)\nwhich is the negative posterior log likelihood.\nTo ﬁnd the most likely (maximum a posteriori or MAP) solution x given some measure-\nments y, we simply minimize this negative log likelihood, which can also be thought of as an\nenergy,\nE(x, y) = Ed(x, y) + Ep(x).\n(3.108)\n(We drop the constant C because its value does not matter during energy minimization.) The\nﬁrst term Ed(x, y) is the data energy or data penalty; it measures the negative log likelihood\n3.7 Global optimization\n181\nthat the data were observed given the unknown state x. The second term Ep(x) is the prior\nenergy; it plays a role analogous to the smoothness energy in regularization. Note that the\nMAP estimate may not always be desirable, since it selects the “peak” in the posterior dis-\ntribution rather than some more stable statistic—see the discussion in Appendix B.2 and by\nLevin, Weiss, Durand et al. (2009).\nFor image processing applications, the unknowns x are the set of output pixels\nx = [f(0, 0) . . . f(m −1, n −1)],\nand the data are (in the simplest case) the input pixels\ny = [d(0, 0) . . . d(m −1, n −1)]\nas shown in Figure 3.56.\nFor a Markov random ﬁeld, the probability p(x) is a Gibbs or Boltzmann distribution,\nwhose negative log likelihood (according to the Hammersley–Clifford theorem) can be writ-\nten as a sum of pairwise interaction potentials,\nEp(x) =\nX\n{(i,j),(k,l)}∈N\nVi,j,k,l(f(i, j), f(k, l)),\n(3.109)\nwhere N(i, j) denotes the neighbors of pixel (i, j). In fact, the general version of the theorem\nsays that the energy may have to be evaluated over a larger set of cliques, which depend on\nthe order of the Markov random ﬁeld (Kindermann and Snell 1980; Geman and Geman 1984;\nBishop 2006; Kohli, Ladick´y, and Torr 2009; Kohli, Kumar, and Torr 2009).\nThe most commonly used neighborhood in Markov random ﬁeld modeling is the N4\nneighborhood, where each pixel in the ﬁeld f(i, j) interacts only with its immediate neigh-\nbors. The model in Figure 3.56, which we previously used in Figure 3.55 to illustrate the\ndiscrete version of ﬁrst-order regularization, shows an N4 MRF. The sx(i, j) and sy(i, j)\nblack boxes denote arbitrary interaction potentials between adjacent nodes in the random\nﬁeld and the w(i, j) denote the data penalty functions. These square nodes can also be inter-\npreted as factors in a factor graph version of the (undirected) graphical model (Bishop 2006),\nwhich is another name for interaction potentials. (Strictly speaking, the factors are (improper)\nprobability functions whose product is the (un-normalized) posterior distribution.)\nAs we will see in (3.112–3.113), there is a close relationship between these interaction\npotentials and the discretized versions of regularized image restoration problems. Thus, to\na ﬁrst approximation, we can view energy minimization being performed when solving a\nregularized problem and the maximum a posteriori inference being performed in an MRF as\nequivalent.\nWhile N4 neighborhoods are most commonly used, in some applications N8 (or even\nhigher order) neighborhoods perform better at tasks such as image segmentation because\n182\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nf (i, j)\nsx(i, j)\nf (i, j+1)\nsy(i, j)\nw(i, j)\nd (i, j)\nf (i+1, j)\nf (i+1, j+1)\nFigure 3.56\nGraphical model for an N4 neighborhood Markov random ﬁeld. (The blue\nedges are added for an N8 neighborhood.) The white circles are the unknowns f(i, j), while\nthe dark circles are the input data d(i, j). The sx(i, j) and sy(i, j) black boxes denote arbi-\ntrary interaction potentials between adjacent nodes in the random ﬁeld, and the w(i, j) denote\nthe data penalty functions. The same graphical model can be used to depict a discrete version\nof a ﬁrst-order regularization problem (Figure 3.55).\nthey can better model discontinuities at different orientations (Boykov and Kolmogorov 2003;\nRother, Kohli, Feng et al. 2009; Kohli, Ladick´y, and Torr 2009; Kohli, Kumar, and Torr 2009).\nBinary MRFs\nThe simplest possible example of a Markov random ﬁeld is a binary ﬁeld. Examples of such\nﬁelds include 1-bit (black and white) scanned document images as well as images segmented\ninto foreground and background regions.\nTo denoise a scanned image, we set the data penalty to reﬂect the agreement between the\nscanned and ﬁnal images,\nEd(i, j) = wδ(f(i, j), d(i, j))\n(3.110)\nand the smoothness penalty to reﬂect the agreement between neighboring pixels\nEp(i, j) = Ex(i, j) + Ey(i, j) = sδ(f(i, j), f(i + 1, j)) + sδ(f(i, j), f(i, j + 1)). (3.111)\nOnce we have formulated the energy, how do we minimize it? The simplest approach is\nto perform gradient descent, ﬂipping one state at a time if it produces a lower energy. This ap-\nproach is known as contextual classiﬁcation (Kittler and F¨oglein 1984), iterated conditional\nmodes (ICM) (Besag 1986), or highest conﬁdence ﬁrst (HCF) (Chou and Brown 1990) if the\npixel with the largest energy decrease is selected ﬁrst.\nUnfortunately, these downhill methods tend to get easily stuck in local minima. An al-\nternative approach is to add some randomness to the process, which is known as stochastic",
  "image_path": "page_203.jpg",
  "pages": [
    202,
    203,
    204
  ]
}