{
  "doc_id": "pages_450_452",
  "text": "428\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\n(e)\nFigure 9.1\nImage stitching: (a) portion of a cylindrical panorama and (b) a spherical\npanorama constructed from 54 photographs (Szeliski and Shum 1997) c⃝1997 ACM; (c) a\nmulti-image panorama automatically assembled from an unordered photo collection; a multi-\nimage stitch (d) without and (e) with moving object removal (Uyttendaele, Eden, and Szeliski\n2001) c⃝2001 IEEE.\n9 Image stitching\n429\nAlgorithms for aligning images and stitching them into seamless photo-mosaics are among\nthe oldest and most widely used in computer vision (Milgram 1975; Peleg 1981). image\nstitching algorithms create the high-resolution photo-mosaics used to produce today’s digital\nmaps and satellite photos. They also come bundled with most digital cameras and can be used\nto create beautiful ultra wide-angle panoramas.\nimage stitching originated in the photogrammetry community, where more manually in-\ntensive methods based on surveyed ground control points or manually registered tie points\nhave long been used to register aerial photos into large-scale photo-mosaics (Slama 1980).\nOne of the key advances in this community was the development of bundle adjustment al-\ngorithms (Section 7.4), which could simultaneously solve for the locations of all of the cam-\nera positions, thus yielding globally consistent solutions (Triggs, McLauchlan, Hartley et al.\n1999). Another recurring problem in creating photo-mosaics is the elimination of visible\nseams, for which a variety of techniques have been developed over the years (Milgram 1975,\n1977; Peleg 1981; Davis 1998; Agarwala, Dontcheva, Agrawala et al. 2004)\nIn ﬁlm photography, special cameras were developed in the 1990s to take ultra-wide-\nangle panoramas, often by exposing the ﬁlm through a vertical slit as the camera rotated on its\naxis (Meehan 1990). In the mid-1990s, image alignment techniques started being applied to\nthe construction of wide-angle seamless panoramas from regular hand-held cameras (Mann\nand Picard 1994; Chen 1995; Szeliski 1996). More recent work in this area has addressed\nthe need to compute globally consistent alignments (Szeliski and Shum 1997; Sawhney and\nKumar 1999; Shum and Szeliski 2000), to remove “ghosts” due to parallax and object move-\nment (Davis 1998; Shum and Szeliski 2000; Uyttendaele, Eden, and Szeliski 2001; Agarwala,\nDontcheva, Agrawala et al. 2004), and to deal with varying exposures (Mann and Picard 1994;\nUyttendaele, Eden, and Szeliski 2001; Levin, Zomet, Peleg et al. 2004; Agarwala, Dontcheva,\nAgrawala et al. 2004; Eden, Uyttendaele, and Szeliski 2006; Kopf, Uyttendaele, Deussen et\nal. 2007).1 These techniques have spawned a large number of commercial stitching products\n(Chen 1995; Sawhney, Kumar, Gendel et al. 1998), of which reviews and comparisons can\nbe found on the Web.2\nWhile most of the earlier techniques worked by directly minimizing pixel-to-pixel dis-\nsimilarities, more recent algorithms usually extract a sparse set of features and match them\nto each other, as described in Chapter 4. Such feature-based approaches to image stitching\nhave the advantage of being more robust against scene movement and are potentially faster,\nif implemented the right way. Their biggest advantage, however, is the ability to “recognize\npanoramas”, i.e., to automatically discover the adjacency (overlap) relationships among an\nunordered set of images, which makes them ideally suited for fully automated stitching of\n1 A collection of some of these papers was compiled by Benosman and Kang (2001) and they are surveyed by\nSzeliski (2006a).\n2 The Photosynth Web site, http://photosynth.net, allows people to create and upload panoramas for free.\n430\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\npanoramas taken by casual users (Brown and Lowe 2007).\nWhat, then, are the essential problems in image stitching? As with image alignment, we\nmust ﬁrst determine the appropriate mathematical model relating pixel coordinates in one im-\nage to pixel coordinates in another; Section 9.1 reviews the basic models we have studied and\npresents some new motion models related speciﬁcally to panoramic image stitching. Next,\nwe must somehow estimate the correct alignments relating various pairs (or collections) of\nimages. Chapter 4 discussed how distinctive features can be found in each image and then\nefﬁciently matched to rapidly establish correspondences between pairs of images. Chapter 8\ndiscussed how direct pixel-to-pixel comparisons combined with gradient descent (and other\noptimization techniques) can also be used to estimate these parameters. When multiple im-\nages exist in a panorama, bundle adjustment (Section 7.4) can be used to compute a globally\nconsistent set of alignments and to efﬁciently discover which images overlap one another. In\nSection 9.2, we look at how each of these previously developed techniques can be modiﬁed\nto take advantage of the imaging setups commonly used to create panoramas.\nOnce we have aligned the images, we must choose a ﬁnal compositing surface for warping\nthe aligned images (Section 9.3.1). We also need algorithms to seamlessly cut and blend over-\nlapping images, even in the presence of parallax, lens distortion, scene motion, and exposure\ndifferences (Section 9.3.2–9.3.4).\n9.1 Motion models\nBefore we can register and align images, we need to establish the mathematical relationships\nthat map pixel coordinates from one image to another. A variety of such parametric motion\nmodels are possible, from simple 2D transforms, to planar perspective models, 3D camera\nrotations, lens distortions, and mapping to non-planar (e.g., cylindrical) surfaces.\nWe already covered several of these models in Sections 2.1 and 6.1. In particular, we saw\nin Section 2.1.5 how the parametric motion describing the deformation of a planar surfaced\nas viewed from different positions can be described with an eight-parameter homography\n(2.71) (Mann and Picard 1994; Szeliski 1996). We also saw how a camera undergoing a pure\nrotation induces a different kind of homography (2.72).\nIn this section, we review both of these models and show how they can be applied to dif-\nferent stitching situations. We also introduce spherical and cylindrical compositing surfaces\nand show how, under favorable circumstances, they can be used to perform alignment using\npure translations (Section 9.1.6). Deciding which alignment model is most appropriate for a\ngiven situation or set of data is a model selection problem (Hastie, Tibshirani, and Friedman\n2001; Torr 2002; Bishop 2006; Robert 2007), an important topic we do not cover in this book.",
  "image_path": "page_451.jpg",
  "pages": [
    450,
    451,
    452
  ]
}