{
  "doc_id": "pages_098_100",
  "text": "76\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nlarger chips are more expensive to produce, not only because fewer chips can be packed into\neach wafer, but also because the probability of a chip defect goes up linearly with the chip\narea.\nAnalog gain.\nBefore analog-to-digital conversion, the sensed signal is usually boosted by\na sense ampliﬁer. In video cameras, the gain on these ampliﬁers was traditionally controlled\nby automatic gain control (AGC) logic, which would adjust these values to obtain a good\noverall exposure. In newer digital still cameras, the user now has some additional control\nover this gain through the ISO setting, which is typically expressed in ISO standard units\nsuch as 100, 200, or 400. Since the automated exposure control in most cameras also adjusts\nthe aperture and shutter speed, setting the ISO manually removes one degree of freedom from\nthe camera’s control, just as manually specifying aperture and shutter speed does. In theory, a\nhigher gain allows the camera to perform better under low light conditions (less motion blur\ndue to long exposure times when the aperture is already maxed out). In practice, however,\nhigher ISO settings usually amplify the sensor noise.\nSensor noise.\nThroughout the whole sensing process, noise is added from various sources,\nwhich may include ﬁxed pattern noise, dark current noise, shot noise, ampliﬁer noise and\nquantization noise (Healey and Kondepudy 1994; Tsin, Ramesh, and Kanade 2001). The\nﬁnal amount of noise present in a sampled image depends on all of these quantities, as well\nas the incoming light (controlled by the scene radiance and aperture), the exposure time, and\nthe sensor gain. Also, for low light conditions where the noise is due to low photon counts, a\nPoisson model of noise may be more appropriate than a Gaussian model.\nAs discussed in more detail in Section 10.1.1, Liu, Szeliski, Kang et al. (2008) use this\nmodel, along with an empirical database of camera response functions (CRFs) obtained by\nGrossberg and Nayar (2004), to estimate the noise level function (NLF) for a given image,\nwhich predicts the overall noise variance at a given pixel as a function of its brightness (a\nseparate NLF is estimated for each color channel). An alternative approach, when you have\naccess to the camera before taking pictures, is to pre-calibrate the NLF by taking repeated\nshots of a scene containing a variety of colors and luminances, such as the Macbeth Color\nChart shown in Figure 10.3b (McCamy, Marcus, and Davidson 1976). (When estimating\nthe variance, be sure to throw away or downweight pixels with large gradients, as small\nshifts between exposures will affect the sensed values at such pixels.) Unfortunately, the pre-\ncalibration process may have to be repeated for different exposure times and gain settings\nbecause of the complex interactions occurring within the sensing system.\nIn practice, most computer vision algorithms, such as image denoising, edge detection,\nand stereo matching, all beneﬁt from at least a rudimentary estimate of the noise level. Barring\nthe ability to pre-calibrate the camera or to take repeated shots of the same scene, the simplest\n2.3 The digital camera\n77\napproach is to look for regions of near-constant value and to estimate the noise variance in\nsuch regions (Liu, Szeliski, Kang et al. 2008).\nADC resolution.\nThe ﬁnal step in the analog processing chain occurring within an imaging\nsensor is the analog to digital conversion (ADC). While a variety of techniques can be used\nto implement this process, the two quantities of interest are the resolution of this process\n(how many bits it yields) and its noise level (how many of these bits are useful in practice).\nFor most cameras, the number of bits quoted (eight bits for compressed JPEG images and a\nnominal 16 bits for the RAW formats provided by some DSLRs) exceeds the actual number\nof usable bits. The best way to tell is to simply calibrate the noise of a given sensor, e.g.,\nby taking repeated shots of the same scene and plotting the estimated noise as a function of\nbrightness (Exercise 2.6).\nDigital post-processing.\nOnce the irradiance values arriving at the sensor have been con-\nverted to digital bits, most cameras perform a variety of digital signal processing (DSP)\noperations to enhance the image before compressing and storing the pixel values. These in-\nclude color ﬁlter array (CFA) demosaicing, white point setting, and mapping of the luminance\nvalues through a gamma function to increase the perceived dynamic range of the signal. We\ncover these topics in Section 2.3.2 but, before we do, we return to the topic of aliasing, which\nwas mentioned in connection with sensor array ﬁll factors.\n2.3.1 Sampling and aliasing\nWhat happens when a ﬁeld of light impinging on the image sensor falls onto the active sense\nareas in the imaging chip? The photons arriving at each active cell are integrated and then\ndigitized. However, if the ﬁll factor on the chip is small and the signal is not otherwise\nband-limited, visually unpleasing aliasing can occur.\nTo explore the phenomenon of aliasing, let us ﬁrst look at a one-dimensional signal (Fig-\nure 2.24), in which we have two sine waves, one at a frequency of f = 3/4 and the other at\nf = 5/4. If we sample these two signals at a frequency of f = 2, we see that they produce\nthe same samples (shown in black), and so we say that they are aliased.14 Why is this a bad\neffect? In essence, we can no longer reconstruct the original signal, since we do not know\nwhich of the two original frequencies was present.\nIn fact, Shannon’s Sampling Theorem shows that the minimum sampling (Oppenheim\nand Schafer 1996; Oppenheim, Schafer, and Buck 1999) rate required to reconstruct a signal\n14 An alias is an alternate name for someone, so the sampled signal corresponds to two different aliases.\n78\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n*\nf = 3/4\nf = 5/4\n=\nFigure 2.24\nAliasing of a one-dimensional signal: The blue sine wave at f = 3/4 and the\nred sine wave at f = 5/4 have the same digital samples, when sampled at f = 2. Even after\nconvolution with a 100% ﬁll factor box ﬁlter, the two signals, while no longer of the same\nmagnitude, are still aliased in the sense that the sampled red signal looks like an inverted\nlower magnitude version of the blue signal. (The image on the right is scaled up for better\nvisibility. The actual sine magnitudes are 30% and −18% of their original values.)\nfrom its instantaneous samples must be at least twice the highest frequency,15\nfs ≥2fmax.\n(2.102)\nThe maximum frequency in a signal is known as the Nyquist frequency and the inverse of the\nminimum sampling frequency rs = 1/fs is known as the Nyquist rate.\nHowever, you may ask, since an imaging chip actually averages the light ﬁeld over a\nﬁnite area, are the results on point sampling still applicable? Averaging over the sensor area\ndoes tend to attenuate some of the higher frequencies. However, even if the ﬁll factor is\n100%, as in the right image of Figure 2.24, frequencies above the Nyquist limit (half the\nsampling frequency) still produce an aliased signal, although with a smaller magnitude than\nthe corresponding band-limited signals.\nA more convincing argument as to why aliasing is bad can be seen by downsampling\na signal using a poor quality ﬁlter such as a box (square) ﬁlter. Figure 2.25 shows a high-\nfrequency chirp image (so called because the frequencies increase over time), along with the\nresults of sampling it with a 25% ﬁll-factor area sensor, a 100% ﬁll-factor sensor, and a high-\nquality 9-tap ﬁlter. Additional examples of downsampling (decimation) ﬁlters can be found\nin Section 3.5.2 and Figure 3.30.\nThe best way to predict the amount of aliasing that an imaging system (or even an image\nprocessing algorithm) will produce is to estimate the point spread function (PSF), which\nrepresents the response of a particular pixel sensor to an ideal point light source. The PSF\nis a combination (convolution) of the blur induced by the optical system (lens) and the ﬁnite\nintegration area of a chip sensor.16\n15 The actual theorem states that fs must be at least twice the signal bandwidth but, since we are not dealing with\nmodulated signals such as radio waves during image capture, the maximum frequency sufﬁces.\n16 Imaging chips usually interpose an optical anti-aliasing ﬁlter just before the imaging chip to reduce or control\nthe amount of aliasing.",
  "image_path": "page_099.jpg",
  "pages": [
    98,
    99,
    100
  ]
}