{
  "doc_id": "pages_854_856",
  "text": "832\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nGluckman, J. (2006a). Higher order image pyramids. In Ninth European Conference on\nComputer Vision (ECCV 2006), pp. 308–320.\nGluckman, J. (2006b). Scale variant image pyramids. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR’2006), pp. 1069–1075, New\nYork City, NY.\nGoesele, M., Curless, B., and Seitz, S. (2006). Multi-view stereo revisited. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR’2006),\npp. 2402–2409, New York City, NY.\nGoesele, M., Fuchs, C., and Seidel, H.-P.\n(2003).\nAccuracy of 3D range scanners by\nmeasurement of the slanted edge modulation transfer function. In Fourth International\nConference on 3-D Digital Imaging and Modeling, Banff.\nGoesele, M., Snavely, N., Curless, B., Hoppe, H., and Seitz, S. M. (2007). Multi-view\nstereo for community photo collections. In Eleventh International Conference on Com-\nputer Vision (ICCV 2007), Rio de Janeiro, Brazil.\nGold, S., Rangarajan, A., Lu, C., Pappu, S., and Mjolsness, E. (1998). New algorithms for\n2D and 3D point matching: Pose estimation and correspondence. Pattern Recognition,\n31(8):1019–1031.\nGoldberg, A. V. and Tarjan, R. E. (1988). A new approach to the maximum-ﬂow problem.\nJournal of the ACM, 35(4):921–940.\nGoldluecke, B. and Cremers, D. (2009). Superresolution texture maps for multiview re-\nconstruction. In Twelfth International Conference on Computer Vision (ICCV 2009),\nKyoto, Japan.\nGoldman, D. B. (2011). Vignette and exposure calibration and compensation. IEEE Trans-\nactions on Pattern Analysis and Machine Intelligence.\nGolovinskiy, A., Matusik, W., ster, H. P., Rusinkiewicz, S., and Funkhouser, T. (2006).\nA statistical model for synthesis of detailed facial geometry. ACM Transactions on\nGraphics, 25(3):1025–1034.\nGolub, G. and Van Loan, C. F. (1996). Matrix Computation, third edition. The John\nHopkins University Press, Baltimore and London.\nGomes, J. and Velho, L. (1997). Image Processing for Computer Graphics. Springer-\nVerlag, New York.\nGomes, J., Darsa, L., Costa, B., and Velho, L. (1999). Warping and Morphing of Graphical\nObjects. Morgan Kaufmann Publishers, San Francisco.\nReferences\n833\nGong, M., Yang, R., Wang, L., and Gong, M. (2007). A performance study on different\ncost aggregation approaches used in realtime stereo matching. International Journal of\nComputer Vision, 75(2):283–296.\nGonzales, R. C. and Woods, R. E. (2008). Digital Image Processing. Prentice-Hall, Upper\nSaddle River, NJ, 3rd edition.\nGooch, B. and Gooch, A. (2001). Non-Photorealistic Rendering. A K Peters, Ltd, Natick,\nMassachusetts.\nGordon, I. and Lowe, D. G. (2006). What and where: 3D object recognition with accurate\npose. In Ponce, J., Hebert, M., Schmid, C., and Zisserman, A. (eds), Toward Category-\nLevel Object Recognition, pp. 67–82, Springer, New York.\nGorelick, L., Blank, M., Shechtman, E., Irani, M., and Basri, R.\n(2007).\nActions as\nspace-time shapes. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n29(12):2247–2253.\nGortler, S. J. and Cohen, M. F. (1995). Hierarchical and variational geometric modeling\nwith wavelets. In Symposium on Interactive 3D Graphics, pp. 35–43, Monterey, CA.\nGortler, S. J., Grzeszczuk, R., Szeliski, R., and Cohen, M. F. (1996). The Lumigraph. In\nACM SIGGRAPH 1996 Conference Proceedings, pp. 43–54, New Orleans.\nGoshtasby, A. (1989). Correction of image deformation from lens distortion using B´ezier\npatches. Computer Vision, Graphics, and Image Processing, 47(4):385–394.\nGoshtasby, A. (2005). 2-D and 3-D Image Registration. Wiley, New York.\nGotchev, A. and Rosenhahn, B. (eds). (2009). Proceedings of the 3DTV Conference: The\nTrue Vision—Capture, Transmission and Display of 3D Video, IEEE Computer Society\nPress.\nGovindu, V. M. (2006). Revisiting the brightness constraint: Probabilistic formulation and\nalgorithms. In Ninth European Conference on Computer Vision (ECCV 2006), pp. 177–\n188.\nGrady, L. (2006). Random walks for image segmentation. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 28(11):1768–1783.\nGrady, L. (2008). A lattice-preserving multigrid method for solving the inhomogeneous\nPoisson equations used in image analysis. In Tenth European Conference on Computer\nVision (ECCV 2008), pp. 252–264, Marseilles.\nGrady, L. and Ali, S. (2008). Fast approximate random walker segmentation using eigen-\nvector precomputation. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2008), Anchorage, AK.\n834\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nGrady, L. and Alvino, C. (2008). Reformulating and optimizing the Mumford–Shah func-\ntional on a graph — a faster, lower energy solution. In Tenth European Conference on\nComputer Vision (ECCV 2008), pp. 248–261, Marseilles.\nGrauman, K. and Darrell, T. (2005). Efﬁcient image matching with distributions of lo-\ncal invariant features. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’2005), pp. 627–634, San Diego, CA.\nGrauman, K. and Darrell, T. (2007a). Pyramid match hashing: Sub-linear time index-\ning over partial correspondences. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nGrauman, K. and Darrell, T. (2007b). The pyramid match kernel: Efﬁcient learning with\nsets of features. Journal of Machine Learning Research, 8:725–760.\nGrauman, K., Shakhnarovich, G., and Darrell, T. (2003). Inferring 3D structure with a\nstatistical image-based shape model. In Ninth International Conference on Computer\nVision (ICCV 2003), pp. 641–648, Nice, France.\nGreene, N. (1986). Environment mapping and other applications of world projections.\nIEEE Computer Graphics and Applications, 6(11):21–29.\nGreene, N. and Heckbert, P. (1986). Creating raster Omnimax images from multiple per-\nspective views using the elliptical weighted average ﬁlter. IEEE Computer Graphics\nand Applications, 6(6):21–27.\nGreig, D., Porteous, B., and Seheult, A. (1989). Exact maximum a posteriori estimation\nfor binary images. Journal of the Royal Statistical Society, Series B, 51(2):271–279.\nGremban, K. D., Thorpe, C. E., and Kanade, T. (1988). Geometric camera calibration\nusing systems of linear equations. In IEEE International Conference on Robotics and\nAutomation, pp. 562–567, Philadelphia.\nGrifﬁn, G., Holub, A., and Perona, P. (2007). Caltech-256 Object Category Dataset. Tech-\nnical Report 7694, California Institute of Technology.\nGrimson, W. E. L. (1983). An implementation of a computational theory of visual surface\ninterpolation. Computer Vision, Graphics, and Image Processing, 22:39–69.\nGrimson, W. E. L. (1985). Computational experiments with a feature based stereo al-\ngorithm.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, PAMI-\n7(1):17–34.\nGross, R., Matthews, I., and Baker, S. (2006). Active appearance models with occlusion.\nImage and Vision Computing, 24(6):593–604.\nGross, R., Shi, J., and Cohn, J. F. (2005). Quo vadis face recognition? In IEEE Workshop\non Empirical Evaluation Methods in Computer Vision, San Diego.",
  "image_path": "page_855.jpg",
  "pages": [
    854,
    855,
    856
  ]
}