{
  "doc_id": "pages_949_951",
  "text": "References\n927\nYu, Y. and Malik, J. (1998). Recovering photometric properties of architectural scenes\nfrom photographs. In ACM SIGGRAPH 1996 Conference Proceedings, pp. 207–218,\nOrlando.\nYu, Y., Debevec, P., Malik, J., and Hawkins, T. (1999). Inverse global illumination: Recov-\nering reﬂectance models of real scenes from photographs. In ACM SIGGRAPH 1999\nConference Proceedings, pp. 215–224.\nYuan, L., Sun, J., Quan, L., and Shum, H.-Y. (2007). Image deblurring with blurred/noisy\nimage pairs. ACM Transactions on Graphics, 26(3).\nYuan, L., Sun, J., Quan, L., and Shum, H.-Y. (2008). Progressive inter-scale and intra-scale\nnon-blind image deconvolution. ACM Transactions on Graphics, 27(3).\nYuan, L., Wen, F., Liu, C., and Shum, H.-Y. (2004). Synthesizing dynamic texture with\nclosed-loop linear dynamic system. In Eighth European Conference on Computer Vi-\nsion (ECCV 2004), pp. 603–616, Prague.\nYuille, A. (1991). Deformable templates for face recognition. Journal of Cognitive Neuro-\nscience, 3(1):59–70.\nYuille, A. (2002). CCCP algorithms to minimize the Bethe and Kikuchi free energies:\nConvergent alternatives to belief propagation. Neural Computation, 14(7):1691–1722.\nYuille, A. (2010). Loopy belief propagation, mean-ﬁeld and Bethe approximations. In\nBlake, A., Kohli, P., and Rother, C. (eds), Advances in Markov Random Fields, MIT\nPress.\nYuille, A. and Poggio, T. (1984). A Generalized Ordering Constraint for Stereo Corre-\nspondence. A. I. Memo 777, Artiﬁcial Intelligence Laboratory, Massachusetts Institute\nof Technology.\nYuille, A., Vincent, L., and Geiger, D. (1992). Statistical morphology and Bayesian recon-\nstruction. Journal of Mathematical Imaging and Vision, 1(3):223–238.\nZabih, R. and Woodﬁll, J. (1994). Non-parametric local transforms for computing vi-\nsual correspondence. In Third European Conference on Computer Vision (ECCV’94),\npp. 151–158, Stockholm, Sweden.\nZach, C. (2008). Fast and high quality fusion of depth maps. In Fourth International Sym-\nposium on 3D Data Processing, Visualization and Transmission (3DPVT’08), Atlanta.\nZach, C., Gallup, D., and Frahm, J.-M. (2008). Fast gain-adaptive KLT tracking on the\nGPU. In CVPR 2008 Workshop on Visual Computer Vision on GPUs (CVGPU), An-\nchorage, AK.\n928\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nZach, C., Klopschitz, M., and Pollefeys, M. (2010). Disambiguating visual relations us-\ning loop constraints. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2010), San Francisco, CA.\nZach, C., Pock, T., and Bischof, H. (2007a). A duality based approach for realtime TV-L1\noptical ﬂow. In Pattern Recognition (DAGM 2007).\nZach, C., Pock, T., and Bischof, H. (2007b). A globally optimal algorithm for robust TV-\nL1 range image integration. In Eleventh International Conference on Computer Vision\n(ICCV 2007), Rio de Janeiro, Brazil.\nZanella, V. and Fuentes, O. (2004). An approach to automatic morphing of face images\nin frontal view. In Mexican International Conference on Artiﬁcial Intelligence (MICAI\n2004), pp. 679–687, Mexico City.\nZebedin, L., Bauer, J., Karner, K., and Bischof, H. (2008). Fusion of feature- and area-\nbased information for urban buildings modeling from aerial imagery. In Tenth European\nConference on Computer Vision (ECCV 2008), pp. 873–886, Marseilles.\nZelnik-Manor, L. and Perona, P. (2007). Automating joiners. In Symposium on Non Pho-\ntorealistic Animation and Rendering, Annecy.\nZhang, G., Jia, J., Wong, T.-T., and Bao, H. (2008). Recovering consistent video depth\nmaps via bundle optimization. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nZhang, J., McMillan, L., and Yu, J. (2006). Robust tracking and stereo matching under\nvariable illumination. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’2006), pp. 871–878, New York City, NY.\nZhang, J., Marszalek, M., Lazebnik, S., and Schmid, C. (2007). Local features and kernels\nfor classiﬁcation of texture and object categories: a comprehensive study. International\nJournal of Computer Vision, 73(2):213–238.\nZhang, L., Curless, B., and Seitz, S. (2003). Spacetime stereo: Shape recovery for dy-\nnamic scenes. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2003), pp. 367–374, Madison, WI.\nZhang, L., Dugas-Phocion, G., Samson, J.-S., and Seitz, S. M. (2002). Single view model-\ning of free-form scenes. Journal of Visualization and Computer Animation, 13(4):225–\n235.\nZhang, L., Snavely, N., Curless, B., and Seitz, S. M. (2004). Spacetime faces: High resolu-\ntion capture for modeling and animation. ACM Transactions on Graphics, 23(3):548–\n558.\nReferences\n929\nZhang, R., Tsai, P.-S., Cryer, J. E., and Shah, M. (1999). Shape from shading: A survey.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 21(8):690–706.\nZhang, Y. and Kambhamettu, C. (2003). On 3D scene ﬂow and structure recovery from\nmultiview image sequences. IEEE Transactions on Systems, Man, and Cybernetics,\n33(4):592–606.\nZhang, Z. (1994). Iterative point matching for registration of free-form curves and surfaces.\nInternational Journal of Computer Vision, 13(2):119–152.\nZhang, Z. (1998a). Determining the epipolar geometry and its uncertainty: A review.\nInternational Journal of Computer Vision, 27(2):161–195.\nZhang, Z. (1998b). On the optimization criteria used in two-view motion analysis. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 20(7):717–729.\nZhang, Z. (2000). A ﬂexible new technique for camera calibration. IEEE Transactions on\nPattern Analysis and Machine Intelligence, 22(11):1330–1334.\nZhang, Z. and He, L.-W. (2007). Whiteboard scanning and image enhancement. Digital\nSignal Processing, 17(2):414–432.\nZhang, Z. and Shan, Y. (2000). A progressive scheme for stereo matching. In Second\nEuropean Workshop on 3D Structure from Multiple Images of Large-Scale Environments\n(SMILE 2000), pp. 68–85, Dublin, Ireland.\nZhang, Z., Deriche, R., Faugeras, O., and Luong, Q. (1995). A robust technique for match-\ning two uncalibrated images through the recovery of the unknown epipolar geometry.\nArtiﬁcial Intelligence, 78:87–119.\nZhao, G. and Pietik¨ainen, M. (2007). Dynamic texture recognition using local binary pat-\nterns with an application to facial expressions. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 29(6):915–928.\nZhao, W., Chellappa, R., Phillips, P. J., and Rosenfeld, A. (2003). Face recognition: A\nliterature survey. ACM Computing Surveys, 35(4):399–358.\nZheng, J. Y. (1994). Acquiring 3-D models from sequences of contours. IEEE Transac-\ntions on Pattern Analysis and Machine Intelligence, 16(2):163–178.\nZheng, K. C., Kang, S. B., Cohen, M., and Szeliski, R. (2007). Layered depth panoramas.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.\nZheng, Y., Lin, S., and Kang, S. B.\n(2006).\nSingle-image vignetting correction.\nIn\nIEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2006), pp. 461–468, New York City, NY.",
  "image_path": "page_950.jpg",
  "pages": [
    949,
    950,
    951
  ]
}