{
  "doc_id": "pages_650_652",
  "text": "628\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nShum, Sun, Yamazaki et al. 2004) or to infer their 3D structure from monocular image cues\n(Section 14.4.4) (Hoiem, Efros, and Hebert 2005b; Saxena, Sun, and Ng 2009).\nHow can we render a sprite with depth from a novel viewpoint? One possibility, as with\na regular depth map, is to just forward warp each pixel to its new location, which can cause\naliasing and cracks. A better way, which we already mentioned in Section 3.6.2, is to ﬁrst\nwarp the depth (or (u, v) displacement) map to the novel view, ﬁll in the cracks, and then use\nhigher-quality inverse warping to resample the color image (Shade, Gortler, He et al. 1998).\nFigure 13.6d shows the results of applying such a two-pass rendering algorithm. From this\nstill image, you can appreciate that the foreground sprites look more rounded; however, to\nfully appreciate the improvement in realism, you would have to look at the actual animated\nsequence.\nSprites with depth can also be rendered using conventional graphics hardware, as de-\nscribed in (Zitnick, Kang, Uyttendaele et al. 2004). Rogmans, Lu, Bekaert et al. (2009)\ndescribe GPU implementations of both real-time stereo matching and real-time forward and\ninverse rendering algorithms.\n13.3 Light ﬁelds and Lumigraphs\nWhile image-based rendering approaches can synthesize scene renderings from novel view-\npoints, they raise the following more general question:\nIs is possible to capture and render the appearance of a scene from all possible\nviewpoints and, if so, what is the complexity of the resulting structure?\nLet us assume that we are looking at a static scene, i.e., one where the objects and illu-\nminants are ﬁxed, and only the observer is moving around. Under these conditions, we can\ndescribe each image by the location and orientation of the virtual camera (6 dof) as well as\nits intrinsics (e.g., its focal length). However, if we capture a two-dimensional spherical im-\nage around each possible camera location, we can re-render any view from this information.4\nThus, taking the cross-product of the three-dimensional space of camera positions with the\n2D space of spherical images, we obtain the 5D plenoptic function of Adelson and Bergen\n(1991), which forms the basis of the image-based rendering system of McMillan and Bishop\n(1995).\nNotice, however, that when there is no light dispersion in the scene, i.e., no smoke or fog,\nall the coincident rays along a portion of free space (between solid or refractive objects) have\nthe same color value. Under these conditions, we can reduce the 5D plenoptic function to\n4 Since we are counting dimensions, we ignore for now any sampling or resolution issues.\n13.3 Light ﬁelds and Lumigraphs\n629\ns\nt\nu\nv\n(s,t)\n(u,v)\nCamera center\nImage plane\n pixel\n(a)\n(b)\nFigure 13.7 The Lumigraph (Gortler, Grzeszczuk, Szeliski et al. 1996) c⃝1996 ACM: (a) a\nray is represented by its 4D two-plane parameters (s, t) and (u, v); (b) a slice through the 3D\nlight ﬁeld subset (u, v, s).\nthe 4D light ﬁeld of all possible rays (Gortler, Grzeszczuk, Szeliski et al. 1996; Levoy and\nHanrahan 1996; Levoy 2006).5\nTo make the parameterization of this 4D function simpler, let us put two planes in the\n3D scene roughly bounding the area of interest, as shown in Figure 13.7a. Any light ray\nterminating at a camera that lives in front of the st plane (assuming that this space is empty)\npasses through the two planes at (s, t) and (u, v) and can be described by its 4D coordinate\n(s, t, u, v). This diagram (and parameterization) can be interpreted as describing a family of\ncameras living on the st plane with their image planes being the uv plane. The uv plane\ncan be placed at inﬁnity, which corresponds to all the virtual cameras looking in the same\ndirection.\nIn practice, if the planes are of ﬁnite extent, the ﬁnite light slab L(s, t, u, v) can be used to\ngenerate any synthetic view that a camera would see through a (ﬁnite) viewport in the st plane\nwith a view frustum that wholly intersects the far uv plane. To enable the camera to move\nall the way around an object, the 3D space surrounding the object can be split into multiple\ndomains, each with its own light slab parameterization. Conversely, if the camera is moving\ninside a bounded volume of free space looking outward, multiple cube faces surrounding the\ncamera can be used as (s, t) planes.\n5 Levoy and Hanrahan (1996) borrowed the term light ﬁeld from a paper by Gershun (1939). Another name for\nthis representation is the photic ﬁeld (Moon and Spencer 1981).\n630\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 13.8\nDepth compensation in the Lumigraph (Gortler, Grzeszczuk, Szeliski et al.\n1996) c⃝1996 ACM. To resample the (s, u) dashed light ray, the u parameter corresponding\nto each discrete si camera location is modiﬁed according to the out-of-plane depth z to yield\nnew coordinates u and u′; in (u, s) ray space, the original sample (△) is resampled from\nthe (si, u′) and (si+1, u′′) samples, which are themselves linear blends of their adjacent (◦)\nsamples.\nThinking about 4D spaces is difﬁcult, so let us drop our visualization by one dimension.\nIf we ﬁx the row value t and constrain our camera to move along the s axis while looking\nat the uv plane, we can stack all of the stabilized images the camera sees to get the (u, v, s)\nepipolar volume, which we discussed in Section 11.6. A “horizontal” cross-section through\nthis volume is the well-known epipolar plane image (Bolles, Baker, and Marimont 1987),\nwhich is the us slice shown in Figure 13.7b.\nAs you can see in this slice, each color pixel moves along a linear track whose slope\nis related to its depth (parallax) from the uv plane. (Pixels exactly on the uv plane appear\n“vertical”, i.e., they do not move as the camera moves along s.) Furthermore, pixel tracks\nocclude one another as their corresponding 3D surface elements occlude. Translucent pixels,\nhowever, composite over background pixels (Section 3.1.3, (3.8)) rather than occluding them.\nThus, we can think of adjacent pixels sharing a similar planar geometry as EPI strips or EPI\ntubes (Criminisi, Kang, Swaminathan et al. 2005).\nThe equations mapping from pixels (x, y) in a virtual camera and the corresponding\n(s, t, u, v) coordinates are relatively straightforward to derive and are sketched out in Ex-\nercise 13.7. It is also possible to show that the set of pixels corresponding to a regular ortho-\ngraphic or perspective camera, i.e., one that has a linear projective relationship between 3D\npoints and (x, y) pixels (2.63), lie along a two-dimensional hyperplane in the (s, t, u, v) light\nﬁeld (Exercise 13.7).",
  "image_path": "page_651.jpg",
  "pages": [
    650,
    651,
    652
  ]
}