{
  "doc_id": "pages_836_838",
  "text": "814\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nforest. In Twelfth International Conference on Computer Vision (ICCV 2009), Kyoto,\nJapan.\nCour, T., B´en´ezit, F., and Shi, J. (2005). Spectral segmentation with multiscale graph\ndecomposition. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2005), pp. 1123–1130, San Diego, CA.\nCox, D., Little, J., and O’Shea, D. (2007). Ideals, Varieties, and Algorithms: An Introduc-\ntion to Computational Algebraic Geometry and Commutative Algebra. Springer.\nCox, I. J. (1994). A maximum likelihood N-camera stereo algorithm. In IEEE Computer\nSociety Conference on Computer Vision and Pattern Recognition (CVPR’94), pp. 733–\n739, Seattle.\nCox, I. J., Roy, S., and Hingorani, S. L. (1995). Dynamic histogram warping of image pairs\nfor constant image brightness. In IEEE International Conference on Image Processing\n(ICIP’95), pp. 366–369.\nCox, I. J., Hingorani, S. L., Rao, S. B., and Maggs, B. M. (1996). A maximum likelihood\nstereo algorithm. Computer Vision and Image Understanding, 63(3):542–567.\nCrandall, D. and Huttenlocher, D. (2007). Composite models of objects and scenes for\ncategory recognition. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2007), Minneapolis, MN.\nCrandall, D., Felzenszwalb, P., and Huttenlocher, D. (2005). Spatial priors for part-based\nrecognition using statistical models. In IEEE Computer Society Conference on Com-\nputer Vision and Pattern Recognition (CVPR’2005), pp. 10–17, San Diego, CA.\nCrandall, D., Backstrom, L., Huttenlocher, D., and Kleinberg, J. (2009). Mapping the\nworld’s photos. In 18th Int. World Wide Web Conference, pp. 761–770, Madrid.\nCrandall, D. J. and Huttenlocher, D. P. (2006). Weakly supervised learning of part-based\nspatial models for visual object recognition. In Ninth European Conference on Com-\nputer Vision (ECCV 2006), pp. 16–29.\nCrane, R. (1997). A Simpliﬁed Approach to Image Processing. Prentice Hall, Upper Saddle\nRiver, NJ.\nCraswell, N. and Szummer, M. (2007). Random walks on the click graph. In ACM SIGIR\nConference on Research and Development in Informaion Retrieval, pp. 239–246, New\nYork, NY.\nCremers, D. and Soatto, S. (2005). Motion competition: A variational framework for\npiecewise parametric motion segmentation. International Journal of Computer Vision,\n62(3):249–265.\nReferences\n815\nCremers, D., Rousson, M., and Deriche, R. (2007). A review of statistical approaches\nto level set segmentation: integrating color, texture, motion and shape. International\nJournal of Computer Vision, 72(2):195–215.\nCrevier, D. (1993). AI: The Tumultuous Search for Artiﬁcial Intelligence. BasicBooks,\nNew York, NY.\nCriminisi, A., P´erez, P., and Toyama, K. (2004). Region ﬁlling and object removal by\nexemplar-based inpainting. IEEE Transactions on Image Processing, 13(9):1200–1212.\nCriminisi, A., Reid, I., and Zisserman, A. (2000). Single view metrology. International\nJournal of Computer Vision, 40(2):123–148.\nCriminisi, A., Sharp, T., and Blake, A. (2008). Geos: Geodesic image segmentation. In\nTenth European Conference on Computer Vision (ECCV 2008), pp. 99–112, Marseilles.\nCriminisi, A., Cross, G., Blake, A., and Kolmogorov, V. (2006). Bilayer segmentation\nof live video. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2006), pp. 53–60, New York City, NY.\nCriminisi, A., Shotton, J., Blake, A., and Torr, P. (2003). Gaze manipulation for one-to-one\nteleconferencing. In Ninth International Conference on Computer Vision (ICCV 2003),\npp. 191–198, Nice, France.\nCriminisi, A., Kang, S. B., Swaminathan, R., Szeliski, R., and Anandan, P. (2005). Extract-\ning layers and analyzing their specular properties using epipolar-plane-image analysis.\nComputer Vision and Image Understanding, 97(1):51–85.\nCriminisi, A., Shotton, J., Blake, A., Rother, C., and Torr, P. H. S. (2007). Efﬁcient dense\nstereo with occlusion by four-state dynamic programming. International Journal of\nComputer Vision, 71(1):89–110.\nCrow, F. C. (1984). Summed-area table for texture mapping. Computer Graphics (SIG-\nGRAPH ’84), 18(3):207–212.\nCrowley, J. L. and Stern, R. M. (1984). Fast computation of the difference of low-pass\ntransform. IEEE Transactions on Pattern Analysis and Machine Intelligence, 6(2):212–\n222.\nCsurka, G. and Perronnin, F. (2008). A simple high performance approach to semantic\nsegmentation. In British Machine Vision Conference (BMVC 2008), Leeds.\nCsurka, G., Dance, C. R., Perronnin, F., and Willamowski, J. (2006). Generic visual cate-\ngorization using weak geometry. In Ponce, J., Hebert, M., Schmid, C., and Zisserman,\nA. (eds), Toward Category-Level Object Recognition, pp. 207–224, Springer, New York.\n816\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nCsurka, G., Dance, C. R., Fan, L., Willamowski, J., and Bray, C. (2004). Visual categoriza-\ntion with bags of keypoints. In ECCV International Workshop on Statistical Learning\nin Computer Vision, Prague.\nCui, J., Yang, Q., Wen, F., Wu, Q., Zhang, C., Van Gool, L., and Tang, X. (2008). Trans-\nductive object cutout. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2008), Anchorage, AK.\nCurless, B. (1999). From range scans to 3D models. Computer Graphics, 33(4):38–41.\nCurless, B. and Levoy, M. (1995). Better optical triangulation through spacetime anal-\nysis. In Fifth International Conference on Computer Vision (ICCV’95), pp. 987–994,\nCambridge, Massachusetts.\nCurless, B. and Levoy, M. (1996). A volumetric method for building complex models from\nrange images. In ACM SIGGRAPH 1996 Conference Proceedings, pp. 303–312, New\nOrleans.\nCutler, R. and Davis, L. S. (2000). Robust real-time periodic motion detection, analysis,\nand applications. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n22(8):781–796.\nCutler, R. and Turk, M. (1998). View-based interpretation of real-time optical ﬂow for\ngesture recognition. In IEEE International Conference on Automatic Face and Gesture\nRecognition, pp. 416–421, Nara, Japan.\nDai, S., Baker, S., and Kang, S. B. (2009). An MRF-based deinterlacing algorithm with\nexemplar-based reﬁnement. IEEE Transactions on Image Processing, 18(5):956–968.\nDalal, N. and Triggs, B. (2005). Histograms of oriented gradients for human detection.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 886–893, San Diego, CA.\nDalal, N., Triggs, B., and Schmid, C. (2006). Human detection using oriented histograms\nof ﬂow and appearance. In Ninth European Conference on Computer Vision (ECCV\n2006), pp. 428–441.\nDana, K. J., van Ginneken, B., Nayar, S. K., and Koenderink, J. J. (1999). Reﬂectance and\ntexture of real world surfaces. ACM Transactions on Graphics, 18(1):1–34.\nDanielsson, P. E. (1980). Euclidean distance mapping. Computer Graphics and Image\nProcessing, 14(3):227–248.\nDarrell, T. and Pentland, A. (1991). Robust estimation of a multi-layered motion represen-\ntation. In IEEE Workshop on Visual Motion, pp. 173–178, Princeton, New Jersey.\nDarrell, T. and Pentland, A. (1995). Cooperative robust estimation using layers of support.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 17(5):474–487.",
  "image_path": "page_837.jpg",
  "pages": [
    836,
    837,
    838
  ]
}