{
  "doc_id": "pages_939_941",
  "text": "References\n917\nVerbeek, J. and Triggs, B. (2007). Region classiﬁcation with Markov ﬁeld aspect models.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.\nVergauwen, M. and Van Gool, L. (2006). Web-based 3D reconstruction service. Machine\nVision and Applications, 17(2):321–329.\nVetter, T. and Poggio, T. (1997). Linear object classes and image synthesis from a sin-\ngle example image. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n19(7):733–742.\nVezhnevets, V., Sazonov, V., and Andreeva, A. (2003). A survey on pixel-based skin color\ndetection techniques. In GRAPHICON03, pp. 85–92.\nVicente, S., Kolmogorov, V., and Rother, C. (2008). Graph cut based image segmentation\nwith connectivity priors. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR 2008), Anchorage, AK.\nVidal, R., Ma, Y., and Sastry, S. S. (2010). Generalized Principal Component Analysis.\nSpringer.\nVi´eville, T. and Faugeras, O. D. (1990). Feedforward recovery of motion and structure\nfrom a sequence of 2D-lines matches. In Third International Conference on Computer\nVision (ICCV’90), pp. 517–520, Osaka, Japan.\nVincent, L. and Soille, P. (1991). Watersheds in digital spaces: An efﬁcient algorithm\nbased on immersion simulations. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 13(6):583–596.\nVineet, V. and Narayanan, P. J. (2008). CUDA cuts: Fast graph cuts on the GPU. In CVPR\n2008 Workshop on Visual Computer Vision on GPUs (CVGPU), Anchorage, AK.\nViola, P. and Wells III, W. (1997). Alignment by maximization of mutual information.\nInternational Journal of Computer Vision, 24(2):137–154.\nViola, P., Jones, M. J., and Snow, D. (2003). Detecting pedestrians using patterns of motion\nand appearance. In Ninth International Conference on Computer Vision (ICCV 2003),\npp. 734–741, Nice, France.\nViola, P. A. and Jones, M. J. (2004). Robust real-time face detection. International Journal\nof Computer Vision, 57(2):137–154.\nVlasic, D., Baran, I., Matusik, W., and Popovi´c, J. (2008). Articulated mesh animation\nfrom multi-view silhouettes. ACM Transactions on Graphics, 27(3).\nVlasic, D., Brand, M., Pﬁster, H., and Popovi´c, J. (2005). Face transfer with multilinear\nmodels. ACM Transactions on Graphics (Proc. SIGGRAPH 2005), 24(3):426–433.\n918\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nVogiatzis, G., Torr, P., and Cipolla, R. (2005). Multi-view stereo via volumetric graph-cuts.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 391–398, San Diego, CA.\nVogiatzis, G., Hernandez, C., Torr, P., and Cipolla, R. (2007). Multi-view stereo via volu-\nmetric graph-cuts and occlusion robust photo-consistency. IEEE Transactions on Pat-\ntern Analysis and Machine Intelligence, 29(12):2241–2246.\nvon Ahn, L. and Dabbish, L. (2004). Labeling images with a computer game. In CHI’04:\nSIGCHI Conference on Human Factors in Computing Systems, pp. 319–326, Vienna,\nAustria.\nvon Ahn, L., Liu, R., and Blum, M. (2006). Peekaboom: A game for locating objects\nin images. In CHI’06: SIGCHI Conference on Human Factors in Computing Systems,\npp. 55–64, Montr´eal, Qu´ebec, Canada.\nWainwright, M. J. and Jordan, M. I. (2008). Graphical models, exponential families, and\nvariational inference. Foundations and Trends in Machine Learning, 1(1-2):1–305.\nWainwright, M. J., Jaakkola, T. S., and Willsky, A. S. (2005). MAP estimation via agree-\nment on trees: message-passing and linear programming. IEEE Transactions on Infor-\nmation Theory, 51(11):3697–3717.\nWaithe, P. and Ferrie, F. (1991). From uncertainty to visual exploration. IEEE Transactions\non Pattern Analysis and Machine Intelligence, 13(10):1038–1049.\nWalker, E. L. and Herman, M. (1988). Geometric reasoning for constructing 3D scene\ndescriptions from images. Artiﬁcial Intelligence, 37:275–290.\nWallace, G. K. (1991). The JPEG still picture compression standard. Communications of\nthe ACM, 34(4):30–44.\nWallace, J. R., Cohen, M. F., and Greenberg, D. P. (1987). A two-pass solution to the ren-\ndering equation: A synthesis of ray tracing and radiosity methods. Computer Graphics\n(SIGGRAPH ’87), 21(4):311–320.\nWaltz, D. L. (1975). Understanding line drawings of scenes with shadows. In Winston,\nP. H. (ed.), The Psychology of Computer Vision, McGraw-Hill, New York.\nWang, H. and Oliensis, J. (2010). Shape matching by segmentation averaging. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 32(4):619–635.\nWang, J. and Cohen, M. F. (2005). An iterative optimization approach for uniﬁed im-\nage segmentation and matting. In Tenth International Conference on Computer Vision\n(ICCV 2005), Beijing, China.\nWang, J. and Cohen, M. F. (2007a). Image and video matting: A survey. Foundations and\nTrends in Computer Graphics and Computer Vision, 3(2).\nReferences\n919\nWang, J. and Cohen, M. F. (2007b). Optimized color sampling for robust matting. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR\n2007), Minneapolis, MN.\nWang, J. and Cohen, M. F. (2007c). Simultaneous matting and compositing. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR 2007),\nMinneapolis, MN.\nWang, J., Agrawala, M., and Cohen, M. F. (2007). Soft scissors: An interactive tool for\nrealtime high quality matting. ACM Transactions on Graphics, 26(3).\nWang, J., Thiesson, B., Xu, Y., and Cohen, M. (2004). Image and video segmentation\nby anisotropic kernel mean shift. In Eighth European Conference on Computer Vision\n(ECCV 2004), pp. 238–249, Prague.\nWang, J., Bhat, P., Colburn, R. A., Agrawala, M., and Cohen, M. F. (2005). Video cutout.\nACM Transactions on Graphics (Proc. SIGGRAPH 2005), 24(3):585–594.\nWang, J. Y. A. and Adelson, E. H. (1994). Representing moving images with layers. IEEE\nTransactions on Image Processing, 3(5):625–638.\nWang, L., Kang, S. B., Szeliski, R., and Shum, H.-Y. (2001). Optimal texture map re-\nconstruction from multiple views. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR’2001), pp. 347–354, Kauai, Hawaii.\nWang, Y. and Zhu, S.-C. (2003). Modeling textured motion: Particle, wave and sketch. In\nNinth International Conference on Computer Vision (ICCV 2003), pp. 213–220, Nice,\nFrance.\nWang, Z., Bovik, A. C., and Simoncelli, E. P. (2005). Structural approaches to image\nquality assessment. In Bovik, A. C. (ed.), Handbook of Image and Video Processing,\npp. 961–974, Elsevier Academic Press.\nWang, Z., Bovik, A. C., Sheikh, H. R., and Simoncelli, E. P. (2004). Image quality as-\nsessment: From error visibility to structural similarity. IEEE Transactions on Image\nProcessing, 13(4):600–612.\nWang, Z.-F. and Zheng, Z.-G. (2008). A region based stereo matching algorithm using\ncooperative optimization. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR 2008), Anchorage, AK.\nWard, G. (1992). Measuring and modeling anisotropic reﬂection. Computer Graphics\n(SIGGRAPH ’92), 26(4):265–272.\nWard, G. (1994). The radiance lighting simulation and rendering system. In ACM SIG-\nGRAPH 1994 Conference Proceedings, pp. 459–472.",
  "image_path": "page_940.jpg",
  "pages": [
    939,
    940,
    941
  ]
}