{
  "doc_id": "pages_727_729",
  "text": "14.4 Category recognition\n705\n(a)\n(b)\nCorrect\nCorrect\nINCORRECT\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nCorrect\nINCORRECT\nINCORRECT\nCorrect\nINCORRECT\nCorrect\nCorrect\nCorrect\n(c)\nFigure 14.42\nPart-based recognition (Fergus, Perona, and Zisserman 2007)\nc⃝2007\nSpringer: (a) locations and covariance ellipses for each part, along with their occurrence\nprobabilities (top) and relative log-scale densities (bottom); (b) part examples drawn from\nthe training images that best match the average appearance; (c) recognition results for the\nmotorcycle class, showing detected features (pink dots) and parts (colored circles).\n706\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 14.43\nInterleaved recognition and segmentation (Leibe, Leonardis, and Schiele\n2008) c⃝2008 Springer. The process starts by re-recognizing visual words (codebook en-\ntries) in a new image (scene) and having each part vote for likely locations and size in a\n3D (x, y, s) voting space (top row). Once a maximum has been found, the parts (features)\ncorresponding to this instance are determined by backprojecting the contributing votes. The\nforeground–background segmentation for each object can be found by backprojecting proba-\nbilistic masks associated with each codebook entry. The whole recognition and segmentation\nprocess can then be repeated.\nthe scene (Lowe 2004), as shown in Figure 14.1d, or matching portions of the new scene to\npre-learned (segmented) object models (Ferrari, Tuytelaars, and Van Gool 2006b; Kannala,\nRahtu, Brandt et al. 2008).\nFor more complex (ﬂexible) object models, such as those for humans Figure 14.1f, a\ndifferent approach is to pre-segment the image into larger or smaller pieces (Chapter 5) and\nthen match such pieces to portions of the model (Mori, Ren, Efros et al. 2004; Mori 2005;\nHe, Zemel, and Ray 2006; Gu, Lim, Arbelaez et al. 2009).\nAn alternative approach by Leibe, Leonardis, and Schiele (2008), which we introduced\nin the previous section, votes for potential object locations and scales based on the detec-\ntion of features corresponding to pre-clustered visual codebook entries (Figure 14.43). To\nsupport segmentation, each codebook entry has an associated foreground–background mask,\nwhich is learned as part of the codebook clustering process from pre-labeled object segmen-\ntation masks. During recognition, once a maximum in the voting space is found, the masks\nassociated with the entries that voted for this instance are combined to obtain an object seg-\nmentation, as shown on the left side of Figure 14.43.\nA more holistic approach to recognition and segmentation is to formulate the problem as\none of labeling every pixel in an image with its class membership, and to solve this prob-\n14.4 Category recognition\n707\n(a)\n(b)\nFigure 14.44\nSimultaneous recognition and segmentation using TextonBoost (Shotton,\nWinn, Rother et al. 2009) c⃝2009 Springer: (a) successful recognition results; (b) less suc-\ncessful results.",
  "image_path": "page_728.jpg",
  "pages": [
    727,
    728,
    729
  ]
}