{
  "doc_id": "pages_942_944",
  "text": "920\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nWard, G.\n(2003).\nFast, robust image registration for compositing high dynamic range\nphotographs from hand-held exposures. Journal of Graphics Tools, 8(2):17–30.\nWard, G. (2004). High dynamic range image encodings. http://www.anyhere.com/gward/\nhdrenc/hdr encodings.html.\nWare, C., Arthur, K., and Booth, K. S. (1993). Fish tank virtual reality. In INTERCHI’03,\npp. 37–42, Amsterdam.\nWarren, J. and Weimer, H. (2001). Subdivision Methods for Geometric Design: A Con-\nstructive Approach. Morgan Kaufmann.\nWatanabe, M. and Nayar, S. K. (1998). Rational ﬁlters for passive depth from defocus.\nInternational Journal of Computer Vision, 27(3):203–225.\nWatt, A. (1995). 3D Computer Graphics. Addison-Wesley, Harlow, England, third edition.\nWeber, J. and Malik, J. (1995). Robust computation of optical ﬂow in a multi-scale differ-\nential framework. International Journal of Computer Vision, 14(1):67–81.\nWeber, M., Welling, M., and Perona, P.\n(2000).\nUnsupervised learning of models for\nrecognition. In Sixth European Conference on Computer Vision (ECCV 2000), pp. 18–\n32, Dublin, Ireland.\nWedel, A., Cremers, D., Pock, T., and Bischof, H. (2009). Structure- and motion-adaptive\nregularization for high accuracy optic ﬂow.\nIn Twelfth International Conference on\nComputer Vision (ICCV 2009), Kyoto, Japan.\nWedel, A., Rabe, C., Vaudrey, T., Brox, T., Franke, U., and Cremers, D. (2008). Efﬁcient\ndense scene ﬂow from sparse or dense stereo data. In Tenth European Conference on\nComputer Vision (ECCV 2008), pp. 739–751, Marseilles.\nWei, C. Y. and Quan, L. (2004). Region-based progressive stereo matching. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR’2005),\npp. 106–113, Washington, D. C.\nWei, L.-Y. and Levoy, M. (2000). Fast texture synthesis using tree-structured vector quan-\ntization. In ACM SIGGRAPH 2000 Conference Proceedings, pp. 479–488.\nWeickert, J. (1998). Anisotropic Diffusion in Image Processing. Tuebner, Stuttgart.\nWeickert, J., ter Haar Romeny, B. M., and Viergever, M. A. (1998). Efﬁcient and reli-\nable schemes for nonlinear diffusion ﬁltering. IEEE Transactions on Image Processing,\n7(3):398–410.\nWeinland, D., Ronfard, R., and Boyer, E. (2006). Free viewpoint action recognition using\nmotion history volumes. Computer Vision and Image Understanding, 104(2-3):249–\n257.\nReferences\n921\nWeiss, Y. (1997). Smoothness in layers: Motion segmentation using nonparametric mixture\nestimation. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’97), pp. 520–526, San Juan, Puerto Rico.\nWeiss, Y. (1999). Segmentation using eigenvectors: A unifying view. In Seventh Interna-\ntional Conference on Computer Vision (ICCV’99), pp. 975–982, Kerkyra, Greece.\nWeiss, Y. (2001). Deriving intrinsic images from image sequences. In Eighth International\nConference on Computer Vision (ICCV 2001), pp. 7–14, Vancouver, Canada.\nWeiss, Y. and Adelson, E. H. (1996). A uniﬁed mixture framework for motion segmen-\ntation: Incorporating spatial coherence and estimating the number of models. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR’96),\npp. 321–326, San Francisco.\nWeiss, Y. and Freeman, B. (2007). What makes a good model of natural images? In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR\n2007), Minneapolis, MN.\nWeiss, Y. and Freeman, W. T. (2001a). Correctness of belief propagation in Gaussian\ngraphical models of arbitrary topology. Neural Computation, 13(10):2173–2200.\nWeiss, Y. and Freeman, W. T. (2001b). On the optimality of solutions of the max-product\nbelief propagation algorithm in arbitrary graphs. IEEE Transactions on Information\nTheory, 47(2):736–744.\nWeiss, Y., Torralba, A., and Fergus, R. (2008). Spectral hashing. In Advances in Neural\nInformation Processing Systems.\nWeiss, Y., Yanover, C., and Meltzer, T. (2010). Linear programming and variants of belief\npropagation. In Blake, A., Kohli, P., and Rother, C. (eds), Advances in Markov Random\nFields, MIT Press.\nWells, III, W. M. (1986). Efﬁcient synthesis of Gaussian ﬁlters by cascaded uniform ﬁlters.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 8(2):234–239.\nWeng, J., Ahuja, N., and Huang, T. S. (1993). Optimal motion and structure estimation.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 15(9):864–884.\nWenger, A., Gardner, A., Tchou, C., Unger, J., Hawkins, T., and Debevec, P. (2005). Per-\nformance relighting and reﬂectance transformation with time-multiplexed illumination.\nACM Transactions on Graphics (Proc. SIGGRAPH 2005), 24(3):756–764.\nWerlberger, M., Trobin, W., Pock, T., Bischof, H., Wedel, A., and Cremers, D. (2009).\nAnisotropic Huber-L1 optical ﬂow.\nIn British Machine Vision Conference (BMVC\n2009), London.\n922\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nWerner, T. (2007). A linear programming approach to max-sum problem: A review. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 29(7):1165–1179.\nWerner, T. and Zisserman, A. (2002). New techniques for automated architectural re-\nconstruction from photographs. In Seventh European Conference on Computer Vision\n(ECCV 2002), pp. 541–555, Copenhagen.\nWestin, S. H., Arvo, J. R., and Torrance, K. E. (1992). Predicting reﬂectance functions\nfrom complex surfaces. Computer Graphics (SIGGRAPH ’92), 26(4):255–264.\nWestover, L. (1989). Interactive volume rendering. In Workshop on Volume Visualization,\npp. 9–16, Chapel Hill.\nWexler, Y., Fitzgibbon, A., and Zisserman, A. (2002). Bayesian estimation of layers from\nmultiple images. In Seventh European Conference on Computer Vision (ECCV 2002),\npp. 487–501, Copenhagen.\nWexler, Y., Shechtman, E., and Irani, M. (2007). Space-time completion of video. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 29(3):463–476.\nWeyrich, T., Lawrence, J., Lensch, H. P. A., Rusinkiewicz, S., and Zickler, T. (2008).\nPrinciples of appearance acquisition and representation. Foundations and Trends in\nComputer Graphics and Computer Vision, 4(2):75–191.\nWeyrich, T., Matusik, W., Pﬁster, H., Bickel, B., Donner, C. et al. (2006). Analysis of\nhuman faces using a measurement-based skin reﬂectance model. ACM Transactions on\nGraphics, 25(3):1013–1024.\nWheeler, M. D., Sato, Y., and Ikeuchi, K. (1998). Consensus surfaces for modeling 3D\nobjects from multiple range images. In Sixth International Conference on Computer\nVision (ICCV’98), pp. 917–924, Bombay.\nWhite, R. and Forsyth, D. (2006). Combining cues: Shape from shading and texture.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2006), pp. 1809–1816, New York City, NY.\nWhite, R., Crane, K., and Forsyth, D. A. (2007). Capturing and animating occluded cloth.\nACM Transactions on Graphics, 26(3).\nWiejak, J. S., Buxton, H., and Buxton, B. F. (1985). Convolution with separable masks for\nearly image processing. Computer Vision, Graphics, and Image Processing, 32(3):279–\n290.\nWilburn, B., Joshi, N., Vaish, V., Talvala, E.-V., Antunez, E. et al. (2005). High per-\nformance imaging using large camera arrays. ACM Transactions on Graphics (Proc.\nSIGGRAPH 2005), 24(3):765–776.",
  "image_path": "page_943.jpg",
  "pages": [
    942,
    943,
    944
  ]
}