{
  "doc_id": "pages_841_843",
  "text": "References\n819\nDebevec, P. E., Yu, Y., and Borshukov, G. D. (1998). Efﬁcient view-dependent image-based\nrendering with projective texture-mapping. In Eurographics Rendering Workshop 1998,\npp. 105–116.\nDeCarlo, D. and Santella, A. (2002). Stylization and abstraction of photographs. ACM\nTransactions on Graphics (Proc. SIGGRAPH 2002), 21(3):769–776.\nDeCarlo, D., Metaxas, D., and Stone, M. (1998). An anthropometric face model using\nvariational techniques. In ACM SIGGRAPH 1998 Conference Proceedings, pp. 67–74.\nDelingette, H., Hebert, M., and Ikeuichi, K. (1992). Shape representation and image seg-\nmentation using deformable surfaces. Image and Vision Computing, 10(3):132–144.\nDellaert, F. and Collins, R. (1999). Fast image-based tracking by selective pixel integration.\nIn ICCV Workshop on Frame-Rate Vision, pp. 1–22.\nDelong, A., Osokin, A., Isack, H. N., and Boykov, Y. (2010). Fast approximate energy\nminimization with label costs. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2010), San Francisco, CA.\nDeMenthon, D. I. and Davis, L. S. (1995). Model-based object pose in 25 lines of code.\nInternational Journal of Computer Vision, 15(1-2):123–141.\nDemmel, J., Dongarra, J., Eijkhout, V., Fuentes, E., Petitet, A. et al. (2005). Self-adapting\nlinear algebra algorithms and software. Proceedings of the IEEE, 93(2):293–312.\nDempster, A., Laird, N. M., and Rubin, D. B. (1977). Maximum likelihood from incom-\nplete data via the EM algorithm. Journal of the Royal Statistical Society B, 39(1):1–38.\nDeng, J., Dong, W., Socher, R., Li, L.-J., Li, K., and Fei-Fei, L. (2009). ImageNet: A large-\nscale hierarchical image database. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2009), Miami Beach, FL.\nDeriche, R. (1987). Using Canny’s criteria to derive a recursively implemented optimal\nedge detector. International Journal of Computer Vision, 1(2):167–187.\nDeriche, R. (1990). Fast algorithms for low-level vision. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 12(1):78–87.\nDeutscher, J. and Reid, I. (2005). Articulated body motion capture by stochastic search.\nInternational Journal of Computer Vision, 61(2):185–205.\nDeutscher, J., Blake, A., and Reid, I. (2000). Articulated body motion capture by annealed\nparticle ﬁltering. In IEEE Computer Society Conference on Computer Vision and Pat-\ntern Recognition (CVPR’2000), pp. 126–133, Hilton Head Island.\nDev, P. (1974). Segmentation Processes in Visual Perception: A Cooperative Neural Model.\nCOINS Technical Report 74C-5, University of Massachusetts at Amherst.\n820\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nDhond, U. R. and Aggarwal, J. K. (1989). Structure from stereo—a review. IEEE Trans-\nactions on Systems, Man, and Cybernetics, 19(6):1489–1510.\nDick, A., Torr, P. H. S., and Cipolla, R. (2004). Modelling and interpretation of architecture\nfrom several images. International Journal of Computer Vision, 60(2):111–134.\nDickinson, S., Leonardis, A., Schiele, B., and Tarr, M. J. (eds). (2007). Object Catego-\nrization: Computer and Human Vision Perspectives, Cambridge University Press, New\nYork.\nDickmanns, E. D. and Graefe, V. (1988). Dynamic monocular machine vision. Machine\nVision and Applications, 1:223–240.\nDiebel, J. (2006). Representing Attitude: Euler Angles, Quaternions, and Rotation Vectors.\nTechnical Report, Stanford University. http://ai.stanford.edu/∼diebel/attitude.html.\nDiebel, J. R., Thrun, S., and Br¨unig, M. (2006). A Bayesian method for probable surface\nreconstruction and decimation. ACM Transactions on Graphics, 25(1).\nDimitrijevic, M., Lepetit, V., and Fua, P.\n(2006).\nHuman body pose detection us-\ning Bayesian spatio-temporal templates. Computer Vision and Image Understanding,\n104(2-3):127–139.\nDinh, H. Q., Turk, G., and Slabaugh, G. (2002). Reconstructing surfaces by volumetric\nregularization using radial basis functions. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 24(10):1358–1371.\nDivvala, S., Hoiem, D., Hays, J., Efros, A. A., and Hebert, M. (2009). An empirical study\nof context in object detection. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2009), Miami, FL.\nDodgson, N. A. (1992). Image Resampling. Technical Report TR261, Wolfson College\nand Computer Laboratory, University of Cambridge.\nDoll`ar, P., Belongie, S., and Perona, P. (2010). The fastest pedestrian detector in the west.\nIn British Machine Vision Conference (BMVC 2010), Aberystwyth, Wales, UK.\nDoll`ar, P., Wojek, C., Schiele, B., and Perona, P. (2009). Pedestrian detection: A bench-\nmark. In IEEE Computer Society Conference on Computer Vision and Pattern Recog-\nnition (CVPR 2009), Miami Beach, FL.\nDoretto, G. and Soatto, S. (2006). Dynamic shape and appearance models. IEEE Transac-\ntions on Pattern Analysis and Machine Intelligence, 28(12):2006–2019.\nDoretto, G., Chiuso, A., Wu, Y. N., and Soatto, S. (2003). Dynamic textures. International\nJournal of Computer Vision, 51(2):91–109.\nReferences\n821\nDork´o, G. and Schmid, C. (2003). Selection of scale-invariant parts for object class recog-\nnition. In Ninth International Conference on Computer Vision (ICCV 2003), pp. 634–\n640, Nice, France.\nDorsey, J., Rushmeier, H., and Sillion, F. (2007). Digital Modeling of Material Appear-\nance. Morgan Kaufmann, San Francisco.\nDouglas, D. H. and Peucker, T. K. (1973). Algorithms for the reduction of the number of\npoints required to represent a digitized line or its caricature. The Canadian Cartogra-\npher, 10(2):112–122.\nDrori, I., Cohen-Or, D., and Yeshurun, H. (2003). Fragment-based image completion.\nACM Transactions on Graphics (Proc. SIGGRAPH 2003), 22(3):303–312.\nDuda, R. O. and Hart, P. E. (1972). Use of the Hough transform to detect lines and curves\nin pictures. Communications of the ACM, 15(1):11–15.\nDuda, R. O., Hart, P. E., and Stork, D. G. (2001). Pattern Classiﬁcation. John Wiley &\nSons, New York, 2nd edition.\nDupuis, P. and Oliensis, J. (1994). An optimal control formulation and related numer-\nical methods for a problem in shape reconstruction. Annals of Applied Probability,\n4(2):287–346.\nDurand, F. and Dorsey, J. (2002). Fast bilateral ﬁltering for the display of high-dynamic-\nrange images. ACM Transactions on Graphics (Proc. SIGGRAPH 2002), 21(3):257–\n266.\nDurand, F. and Szeliski, R. (2007). Computational photography. IEEE Computer Graphics\nand Applications, 27(2):21–22. Guest Editors’ Introduction to Special Issue.\nDurbin, R. and Willshaw, D. (1987). An analogue approach to the traveling salesman\nproblem using an elastic net method. Nature, 326:689–691.\nDurbin, R., Szeliski, R., and Yuille, A. (1989). An analysis of the elastic net approach to\nthe travelling salesman problem. Neural Computation, 1(3):348–358.\nEck, M., DeRose, T., Duchamp, T., Hoppe, H., Lounsbery, M., and Stuetzle, W. (1995).\nMultiresolution analysis of arbitrary meshes. In ACM SIGGRAPH 1995 Conference\nProceedings, pp. 173–182, Los Angeles.\nEden, A., Uyttendaele, M., and Szeliski, R. (2006). Seamless image stitching of scenes\nwith large motions and exposure differences. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR’2006), pp. 2498–2505, New York,\nNY.\nEfros, A. A. and Freeman, W. T. (2001). Image quilting for texture synthesis and transfer.\nIn ACM SIGGRAPH 2001 Conference Proceedings, pp. 341–346.",
  "image_path": "page_842.jpg",
  "pages": [
    841,
    842,
    843
  ]
}