{
  "doc_id": "pages_429_431",
  "text": "8.3 Spline-based motion\n407\n(a)\n(b)\n(c)\n(d)\nFigure 8.9\nQuadtree spline-based motion estimation (Szeliski and Shum 1996) c⃝1996\nIEEE: (a) quadtree spline representation, (b) which can lead to cracks, unless the white nodes\nare constrained to depend on their parents; (c) deformed quadtree spline mesh overlaid on\ngrayscale image; (d) ﬂow ﬁeld visualized as a needle diagram.\ncontrol point (Szeliski and Kang 1995; Szeliski and Coughlan 1997).\nIn many cases, the small number of spline vertices results in a motion estimation problem\nthat is well conditioned. However, if large textureless regions (or elongated edges subject\nto the aperture problem) persist across several spline patches, it may be necessary to add a\nregularization term to make the problem well posed (Section 3.7.1). The simplest way to\ndo this is to directly add squared difference penalties between adjacent vertices in the spline\ncontrol mesh {ˆuj}, as in (3.100). If a multi-resolution (coarse-to-ﬁne) strategy is being used,\nit is important to re-scale these smoothness terms while going from level to level.\nThe linear system corresponding to the spline-based motion estimator is sparse and regu-\nlar. Because it is usually of moderate size, it can often be solved using direct techniques such\nas Cholesky decomposition (Appendix A.4). Alternatively, if the problem becomes too large\nand subject to excessive ﬁll-in, iterative techniques such as hierarchically preconditioned con-\njugate gradient (Szeliski 1990b, 2006b) can be used instead (Appendix A.5).\nBecause of its robustness, spline-based motion estimation has been used for a number\nof applications, including visual effects (Roble 1999) and medical image registration (Sec-\ntion 8.3.1) (Szeliski and Lavall´ee 1996; Kybic and Unser 2003).\nOne disadvantage of the basic technique, however, is that the model does a poor job\nnear motion discontinuities, unless an excessive number of nodes is used. To remedy this\nsituation, Szeliski and Shum (1996) propose using a quadtree representation embedded in the\nspline control grid (Figure 8.9a). Large cells are used to present regions of smooth motion,\nwhile smaller cells are added in regions of motion discontinuities (Figure 8.9c).\nTo estimate the motion, a coarse-to-ﬁne strategy is used. Starting with a regular spline\nimposed over a lower-resolution image, an initial motion estimate is obtained. Spline patches\nwhere the motion is inconsistent, i.e., the squared residual (8.67) is above a threshold, are\nsubdivided into smaller patches. In order to avoid cracks in the resulting motion ﬁeld (Fig-\n408\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\nFigure 8.10\nElastic brain registration (Kybic and Unser 2003) c⃝2003 IEEE: (a) original\nbrain atlas and patient MRI images overlaid in red–green; (b) after elastic registration with\neight user-speciﬁed landmarks (not shown); (c) a cubic B-spline deformation ﬁeld, shown as\na deformed grid.\nure 8.9b), the values of certain nodes in the reﬁned mesh, i.e., those adjacent to larger cells,\nneed to be restricted so that they depend on their parent values. This is most easily accom-\nplished using a hierarchical basis representation for the quadtree spline (Szeliski 1990b) and\nselectively setting some of the hierarchical basis functions to 0, as described in (Szeliski and\nShum 1996).\n8.3.1 Application: Medical image registration\nBecause they excel at representing smooth elastic deformation ﬁelds, spline-based motion\nmodels have found widespread use in medical image registration (Bajcsy and Kovacic 1989;\nSzeliski and Lavall´ee 1996; Christensen, Joshi, and Miller 1997).10 Registration techniques\ncan be used both to track an individual patient’s development or progress over time (a lon-\ngitudinal study) or to match different patient images together to ﬁnd commonalities and de-\ntect variations or pathologies (cross-sectional studies). When different imaging modalities\nare being registered, e.g., computed tomography (CT) scans and magnetic resonance images\n(MRI), mutual information measures of similarity are often necessary (Viola and Wells III\n1997; Maes, Collignon, Vandermeulen et al. 1997).\nKybic and Unser (2003) provide a nice literature review and describe a complete working\nsystem based on representing both the images and the deformation ﬁelds as multi-resolution\nsplines. Figure 8.10 shows an example of the Kybic and Unser system being used to register\na patient’s brain MRI with a labeled brain atlas image. The system can be run in a fully auto-\n10 In computer graphics, such elastic volumetric deformation are known as free-form deformations (Sederberg and\nParry 1986; Coquillart 1990; Celniker and Gossard 1991).\n8.4 Optical ﬂow\n409\n(a)\n(b)\n(c)\nFigure 8.11 Octree spline-based image registration of two vertebral surface models (Szeliski\nand Lavall´ee 1996) c⃝1996 Springer: (a) after initial rigid alignment; (b) after elastic align-\nment; (c) a cross-section through the adapted octree spline deformation ﬁeld.\nmatic mode but more accurate results can be obtained by locating a few key landmarks. More\nrecent papers on deformable medical image registration, including performance evaluations,\ninclude (Klein, Staring, and Pluim 2007; Glocker, Komodakis, Tziritas et al. 2008).\nAs with other applications, regular volumetric splines can be enhanced using selective\nreﬁnement. In the case of 3D volumetric image or surface registration, these are known as\noctree splines (Szeliski and Lavall´ee 1996) and have been used to register medical surface\nmodels such as vertebrae and faces from different patients (Figure 8.11).\n8.4 Optical ﬂow\nThe most general (and challenging) version of motion estimation is to compute an indepen-\ndent estimate of motion at each pixel, which is generally known as optical (or optic) ﬂow. As\nwe mentioned in the previous section, this generally involves minimizing the brightness or\ncolor difference between corresponding pixels summed over the image,\nESSD−OF({ui}) =\nX\ni\n[I1(xi + ui) −I0(xi)]2.\n(8.69)\nSince the number of variables {ui} is twice the number of measurements, the problem is\nunderconstrained. The two classic approaches to this problem are to perform the summa-\ntion locally over overlapping regions (the patch-based or window-based approach) or to\nadd smoothness terms on the {ui} ﬁeld using regularization or Markov random ﬁelds (Sec-\ntion 3.7) and to search for a global minimum.\nThe patch-based approach usually involves using a Taylor series expansion of the dis-\nplaced image function (8.35) in order to obtain sub-pixel estimates (Lucas and Kanade 1981).",
  "image_path": "page_430.jpg",
  "pages": [
    429,
    430,
    431
  ]
}