{
  "doc_id": "pages_884_886",
  "text": "862\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nLiu, F., Gleicher, M., Jin, H., and Agarwala, A. (2009). Content-preserving warps for 3d\nvideo stabilization. ACM Transactions on Graphics, 28(3).\nLiu, X., Chen, T., and Kumar, B. V. (2003). Face authentication for multiple subjects using\neigenﬂow. Pattern Recognition, 36(2):313–328.\nLiu, Y., Collins, R. T., and Tsin, Y. (2004). A computational model for periodic pattern per-\nception based on frieze and wallpaper groups. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 26(3):354–371.\nLiu, Y., Lin, W.-C., and Hays, J. (2004). Near-regular texture analysis and manipulation.\nACM Transactions on Graphics, 23(3):368–376.\nLivingstone, M. (2008). Vision and Art: The Biology of Seeing. Abrams, New York.\nLobay, A. and Forsyth, D. A. (2006). Shape from texture without boundaries. International\nJournal of Computer Vision, 67(1):71–91.\nLombaert, H., Sun, Y., Grady, L., and Xu, C. (2005). A multilevel banded graph cuts\nmethod for fast image segmentation. In Tenth International Conference on Computer\nVision (ICCV 2005), pp. 259–265, Beijing, China.\nLongere, P., Delahunt, P. B., Zhang, X., and Brainard, D. H. (2002). Perceptual assessment\nof demosaicing algorithm performance. Proceedings of the IEEE, 90(1):123–132.\nLonguet-Higgins, H. C. (1981). A computer algorithm for reconstructing a scene from two\nprojections. Nature, 293:133–135.\nLoop, C. and Zhang, Z. (1999). Computing rectifying homographies for stereo vision.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’99), pp. 125–131, Fort Collins.\nLorensen, W. E. and Cline, H. E. (1987). Marching cubes: A high resolution 3D surface\nconstruction algorithm. Computer Graphics (SIGGRAPH ’87), 21(4):163–169.\nLorusso, A., Eggert, D., and Fisher, R. B. (1995). A comparison of four algorithms for\nestimating 3-D rigid transformations. In British Machine Vision Conference (BMVC95),\npp. 237–246, Birmingham, England.\nLourakis, M. I. A. and Argyros, A. A. (2009). SBA: A software package for generic sparse\nbundle adjustment. ACM Transactions on Mathematical Software, 36(1).\nLowe, D. G. (1988). Organization of smooth image curves at multiple scales. In Second\nInternational Conference on Computer Vision (ICCV’88), pp. 558–567, Tampa.\nLowe, D. G. (1989). Organization of smooth image curves at multiple scales. International\nJournal of Computer Vision, 3(2):119–130.\nReferences\n863\nLowe, D. G. (1999). Object recognition from local scale-invariant features. In Seventh\nInternational Conference on Computer Vision (ICCV’99), pp. 1150–1157, Kerkyra,\nGreece.\nLowe, D. G. (2004). Distinctive image features from scale-invariant keypoints. Interna-\ntional Journal of Computer Vision, 60(2):91–110.\nLucas, B. D. and Kanade, T. (1981). An iterative image registration technique with an\napplication in stereo vision. In Seventh International Joint Conference on Artiﬁcial\nIntelligence (IJCAI-81), pp. 674–679, Vancouver.\nLuong, Q.-T. and Faugeras, O. D. (1996). The fundamental matrix: Theory, algorithms,\nand stability analysis. International Journal of Computer Vision, 17(1):43–75.\nLuong, Q.-T. and Vi´eville, T. (1996). Canonical representations for the geometries of\nmultiple projective views. Computer Vision and Image Understanding, 64(2):193–229.\nLyu, S. and Simoncelli, E. (2008). Nonlinear image representation using divisive nor-\nmalization. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2008), Anchorage, AK.\nLyu, S. and Simoncelli, E. (2009). Modeling multiscale subbands of photographic images\nwith ﬁelds of Gaussian scale mixtures. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 31(4):693–706.\nMa, W.-C., Jones, A., Chiang, J.-Y., Hawkins, T., Frederiksen, S., Peers, P., Vukovic,\nM., Ouhyoung, M., and Debevec, P.\n(2008).\nFacial performance synthesis using\ndeformation-driven polynomial displacement maps. ACM Transactions on Graphics,\n27(5).\nMa, Y., Derksen, H., Hong, W., and Wright, J. (2007). Segmentation of multivariate mixed\ndata via lossy data coding and compression. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 29(9):1546–1562.\nMacDonald, L. (ed.). (2006). Digital Heritage: Applying Digital Imaging to Cultural\nHeritage, Butterworth-Heinemann.\nMadsen, K., Nielsen, H. B., and Tingleff, O. (2004). Methods for non-linear least squares\nproblems. Informatics and Mathematical Modelling, Technical University of Denmark\n(DTU).\nMaes, F., Collignon, A., Vandermeulen, D., Marchal, G., and Suetens, P. (1997). Multi-\nmodality image registration by maximization of mutual information. IEEE Transactions\non Medical Imaging, 16(2):187–198.\nMagnor, M. (2005). Video-Based Rendering. A. K. Peters, Wellesley, MA.\n864\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nMagnor, M. and Girod, B.\n(2000).\nData compression for light-ﬁeld rendering.\nIEEE\nTransactions on Circuits and Systems for Video Technology, 10(3):338–343.\nMagnor, M., Ramanathan, P., and Girod, B. (2003). Multi-view coding for image-based\nrendering using 3-D scene geometry. IEEE Transactions on Circuits and Systems for\nVideo Technology, 13(11):1092–1106.\nMahajan, D., Huang, F.-C., Matusik, W., Ramamoorthi, R., and Belhumeur, P. (2009).\nMoving gradients: A path-based method for plausible image interpolation. ACM Trans-\nactions on Graphics, 28(3).\nMaimone, M., Cheng, Y., and Matthies, L. (2007). Two years of visual odometry on the\nMars exploration rovers. Journal of Field Robotics, 24(3).\nMaire, M., Arbelaez, P., Fowlkes, C., and Malik, J.\n(2008).\nUsing contours to detect\nand localize junctions in natural images. In IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nMaitin-Shepard, J., Cusumano-Towner, M., Lei, J., and Abbeel, P. (2010). Cloth grasp\npoint detection based on multiple-view geometric cues with application to robotic towel\nfolding. In IEEE International Conference on Robotics and Automation, Anchorage,\nAK.\nMaitre, M., Shinagawa, Y., and Do, M. N. (2008). Symmetric multi-view stereo reconstruc-\ntion from planar camera arrays. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nMaji, S., Berg, A., and Malik, J. (2008). Classiﬁcation using intersection kernel support\nvector machines is efﬁcient. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR 2008), Anchorage, AK.\nMalik, J. and Rosenholtz, R. (1997). Computing local surface orientation and shape from\ntexture for curved surfaces. International Journal of Computer Vision, 23(2):149–168.\nMalik, J., Belongie, S., Leung, T., and Shi, J. (2001). Contour and texture analysis for\nimage segmentation. International Journal of Computer Vision, 43(1):7–27.\nMalisiewicz, T. and Efros, A. A. (2008). Recognition by association via learning per-\nexemplar distances. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2008), Anchorage, AK.\nMalladi, R., Sethian, J. A., and Vemuri, B. C. (1995). Shape modeling with front propaga-\ntion. IEEE Transactions on Pattern Analysis and Machine Intelligence, 17(2):158–176.\nMallat, S. G. (1989). A theory for multiresolution signal decomposition: the wavelet rep-\nresentation. IEEE Transactions on Pattern Analysis and Machine Intelligence, PAMI-\n11(7):674–693.",
  "image_path": "page_885.jpg",
  "pages": [
    884,
    885,
    886
  ]
}