{
  "doc_id": "pages_091_093",
  "text": "2.2 Photometric image formation\n69\nzi=102 mm\nf = 100 mm\nW=35mm\nzo=5 m\nf.o.v.\nc\nΔzi\nP\nd\nFigure 2.19\nA thin lens of focal length f focuses the light from a plane a distance zo in front\nof the lens at a distance zi behind the lens, where\n1\nzo + 1\nzi = 1\nf . If the focal plane (vertical\ngray line next to c) is moved forward, the images are no longer in focus and the circle of\nconfusion c (small thick line segments) depends on the distance of the image plane motion\n∆zi relative to the lens aperture diameter d. The ﬁeld of view (f.o.v.) depends on the ratio\nbetween the sensor width W and the focal length f (or, more precisely, the focusing distance\nzi, which is usually quite close to f).\nration, we need to develop a more sophisticated model, which is where the study of optics\ncomes in (M¨oller 1988; Hecht 2001; Ray 2002).\nFigure 2.19 shows a diagram of the most basic lens model, i.e., the thin lens composed\nof a single piece of glass with very low, equal curvature on both sides. According to the\nlens law (which can be derived using simple geometric arguments on light ray refraction), the\nrelationship between the distance to an object zo and the distance behind the lens at which a\nfocused image is formed zi can be expressed as\n1\nzo\n+ 1\nzi\n= 1\nf ,\n(2.96)\nwhere f is called the focal length of the lens. If we let zo →∞, i.e., we adjust the lens (move\nthe image plane) so that objects at inﬁnity are in focus, we get zi = f, which is why we can\nthink of a lens of focal length f as being equivalent (to a ﬁrst approximation) to a pinhole a\ndistance f from the focal plane (Figure 2.10), whose ﬁeld of view is given by (2.60).\nIf the focal plane is moved away from its proper in-focus setting of zi (e.g., by twisting\nthe focus ring on the lens), objects at zo are no longer in focus, as shown by the gray plane in\nFigure 2.19. The amount of mis-focus is measured by the circle of confusion c (shown as short\nthick blue line segments on the gray plane).7 The equation for the circle of confusion can be\nderived using similar triangles; it depends on the distance of travel in the focal plane ∆zi\nrelative to the original focus distance zi and the diameter of the aperture d (see Exercise 2.4).\n7 If the aperture is not completely circular, e.g., if it is caused by a hexagonal diaphragm, it is sometimes possible\nto see this effect in the actual blur function (Levin, Fergus, Durand et al. 2007; Joshi, Szeliski, and Kriegman 2008)\nor in the “glints” that are seen when shooting into the sun.\n70\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\nFigure 2.20 Regular and zoom lens depth of ﬁeld indicators.\nThe allowable depth variation in the scene that limits the circle of confusion to an accept-\nable number is commonly called the depth of ﬁeld and is a function of both the focus distance\nand the aperture, as shown diagrammatically by many lens markings (Figure 2.20). Since this\ndepth of ﬁeld depends on the aperture diameter d, we also have to know how this varies with\nthe commonly displayed f-number, which is usually denoted as f/# or N and is deﬁned as\nf/# = N = f\nd ,\n(2.97)\nwhere the focal length f and the aperture diameter d are measured in the same unit (say,\nmillimeters).\nThe usual way to write the f-number is to replace the # in f/# with the actual number,\ni.e., f/1.4, f/2, f/2.8, . . . , f/22. (Alternatively, we can say N = 1.4, etc.) An easy way to\ninterpret these numbers is to notice that dividing the focal length by the f-number gives us the\ndiameter d, so these are just formulas for the aperture diameter.8\nNotice that the usual progression for f-numbers is in full stops, which are multiples of\n√\n2,\nsince this corresponds to doubling the area of the entrance pupil each time a smaller f-number\nis selected. (This doubling is also called changing the exposure by one exposure value or EV.\nIt has the same effect on the amount of light reaching the sensor as doubling the exposure\nduration, e.g., from 1/125 to 1/250, see Exercise 2.5.)\nNow that you know how to convert between f-numbers and aperture diameters, you can\nconstruct your own plots for the depth of ﬁeld as a function of focal length f, circle of\nconfusion c, and focus distance zo, as explained in Exercise 2.4 and see how well these match\nwhat you observe on actual lenses, such as those shown in Figure 2.20.\nOf course, real lenses are not inﬁnitely thin and therefore suffer from geometric aber-\nrations, unless compound elements are used to correct for them. The classic ﬁve Seidel\naberrations, which arise when using third-order optics, include spherical aberration, coma,\nastigmatism, curvature of ﬁeld, and distortion (M¨oller 1988; Hecht 2001; Ray 2002).\n8 This also explains why, with zoom lenses, the f-number varies with the current zoom (focal length) setting.\n2.2 Photometric image formation\n71\nzi’=103mm\nf’ = 101mm\nzo=5m\nP\nd\nc\nFigure 2.21\nIn a lens subject to chromatic aberration, light at different wavelengths (e.g.,\nthe red and blur arrows) is focused with a different focal length f ′ and hence a different depth\nz′\ni, resulting in both a geometric (in-plane) displacement and a loss of focus.\nChromatic aberration\nBecause the index of refraction for glass varies slightly as a function of wavelength, sim-\nple lenses suffer from chromatic aberration, which is the tendency for light of different\ncolors to focus at slightly different distances (and hence also with slightly different mag-\nniﬁcation factors), as shown in Figure 2.21. The wavelength-dependent magniﬁcation fac-\ntor, i.e., the transverse chromatic aberration, can be modeled as a per-color radial distortion\n(Section 2.1.6) and, hence, calibrated using the techniques described in Section 6.3.5. The\nwavelength-dependent blur caused by longitudinal chromatic aberration can be calibrated\nusing techniques described in Section 10.1.4. Unfortunately, the blur induced by longitudinal\naberration can be harder to undo, as higher frequencies can get strongly attenuated and hence\nhard to recover.\nIn order to reduce chromatic and other kinds of aberrations, most photographic lenses\ntoday are compound lenses made of different glass elements (with different coatings). Such\nlenses can no longer be modeled as having a single nodal point P through which all of the\nrays must pass (when approximating the lens with a pinhole model). Instead, these lenses\nhave both a front nodal point, through which the rays enter the lens, and a rear nodal point,\nthrough which they leave on their way to the sensor. In practice, only the location of the front\nnodal point is of interest when performing careful camera calibration, e.g., when determining\nthe point around which to rotate to capture a parallax-free panorama (see Section 9.1.3).\nNot all lenses, however, can be modeled as having a single nodal point. In particular, very\nwide-angle lenses such as ﬁsheye lenses (Section 2.1.6) and certain catadioptric imaging\nsystems consisting of lenses and curved mirrors (Baker and Nayar 1999) do not have a single\npoint through which all of the acquired light rays pass. In such cases, it is preferable to\nexplicitly construct a mapping function (look-up table) between pixel coordinates and 3D\nrays in space (Gremban, Thorpe, and Kanade 1988; Champleboux, Lavall´ee, Sautot et al.",
  "image_path": "page_092.jpg",
  "pages": [
    91,
    92,
    93
  ]
}