{
  "doc_id": "pages_922_924",
  "text": "900\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nKyoto, Japan.\nSinha, S. N., Steedly, D., Szeliski, R., Agrawala, M., and Pollefeys, M. (2008). Interactive\n3D architectural modeling from unordered photo collections. ACM Transactions on\nGraphics (Proc. SIGGRAPH Asia 2008), 27(5).\nSinop, A. K. and Grady, L. (2007). A seeded image segmentation framework unifying\ngraph cuts and random walker which yields a new algorithm. In Eleventh International\nConference on Computer Vision (ICCV 2007), Rio de Janeiro, Brazil.\nSivic, J. and Zisserman, A. (2003). Video Google: A text retrieval approach to object\nmatching in videos.\nIn Ninth International Conference on Computer Vision (ICCV\n2003), pp. 1470–1477, Nice, France.\nSivic, J. and Zisserman, A. (2009). Efﬁcient visual search of videos cast as text retrieval.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 31(4):591–606.\nSivic, J., Everingham, M., and Zisserman, A. (2009). “Who are you?”—Learning person\nspeciﬁc classiﬁers from video. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2009), Miami Beach, FL.\nSivic, J., Zitnick, C. L., and Szeliski, R.\n(2006).\nFinding people in repeated shots of\nthe same scene. In British Machine Vision Conference (BMVC 2006), pp. 909–918,\nEdinburgh.\nSivic, J., Russell, B., Zisserman, A., Freeman, W. T., and Efros, A. A. (2008). Unsuper-\nvised discovery of visual object class hierarchies. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nSivic, J., Russell, B. C., Efros, A. A., Zisserman, A., and Freeman, W. T. (2005). Dis-\ncovering objects and their localization in images. In Tenth International Conference on\nComputer Vision (ICCV 2005), pp. 370–377, Beijing, China.\nSlabaugh, G. G., Culbertson, W. B., Slabaugh, T. G., Culbertson, B., Malzbender, T., and\nStevens, M. (2004). Methods for volumetric reconstruction of visual scenes. Interna-\ntional Journal of Computer Vision, 57(3):179–199.\nSlama, C. C. (ed.). (1980). Manual of Photogrammetry. American Society of Photogram-\nmetry, Falls Church, Virginia, fourth edition.\nSmelyanskiy, V. N., Cheeseman, P., Maluf, D. A., and Morris, R. D. (2000). Bayesian\nsuper-resolved surface reconstruction from images. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR’2000), pp. 375–382, Hilton\nHead Island.\nReferences\n901\nSmeulders, A. W. M., Worring, M., Santini, S., Gupta, A., and Jain, R. C. (2000). Content-\nbased image retrieval at the end of the early years. IEEE Transactions on Pattern Anal-\nysis and Machine Intelligence, 22(12):477–490.\nSminchisescu, C. and Triggs, B. (2001). Covariance scaled sampling for monocular 3D\nbody tracking. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2001), pp. 447–454, Kauai, Hawaii.\nSminchisescu, C., Kanaujia, A., and Metaxas, D. (2006). Conditional models for con-\ntextual human motion recognition. Computer Vision and Image Understanding, 104(2-\n3):210–220.\nSminchisescu, C., Kanaujia, A., Li, Z., and Metaxas, D. (2005). Discriminative density\npropagation for 3D human motion estimation. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR’2005), pp. 390–397, San Diego,\nCA.\nSmith, A. R. and Blinn, J. F. (1996). Blue screen matting. In ACM SIGGRAPH 1996\nConference Proceedings, pp. 259–268, New Orleans.\nSmith, B. M., Zhang, L., Jin, H., and Agarwala, A. (2009). Light ﬁeld video stabilization.\nIn Twelfth International Conference on Computer Vision (ICCV 2009), Kyoto, Japan.\nSmith, S. M. and Brady, J. M.\n(1997).\nSUSAN—a new approach to low level image\nprocessing. International Journal of Computer Vision, 23(1):45–78.\nSmolic, A. and Kauff, P. (2005). Interactive 3-D video representation and coding technolo-\ngies. Proceedings of the IEEE, 93(1):98–110.\nSnavely, N., Seitz, S. M., and Szeliski, R. (2006). Photo tourism: Exploring photo collec-\ntions in 3D. ACM Transactions on Graphics (Proc. SIGGRAPH 2006), 25(3):835–846.\nSnavely, N., Seitz, S. M., and Szeliski, R. (2008a). Modeling the world from Internet photo\ncollections. International Journal of Computer Vision, 80(2):189–210.\nSnavely, N., Seitz, S. M., and Szeliski, R. (2008b). Skeletal graphs for efﬁcient structure\nfrom motion. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2008), Anchorage, AK.\nSnavely, N., Garg, R., Seitz, S. M., and Szeliski, R. (2008). Finding paths through the\nworld’s photos. ACM Transactions on Graphics (Proc. SIGGRAPH 2008), 27(3).\nSnavely, N., Simon, I., Goesele, M., Szeliski, R., and Seitz, S. M.\n(2010).\nScene re-\nconstruction and visualization from community photo collections. Proceedings of the\nIEEE, 98(8):1370–1390.\n902\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nSoatto, S., Yezzi, A. J., and Jin, H. (2003). Tales of shape and radiance in multiview stereo.\nIn Ninth International Conference on Computer Vision (ICCV 2003), pp. 974–981, Nice,\nFrance.\nSoille, P. (2006). Morphological image compositing. IEEE Transactions on Pattern Anal-\nysis and Machine Intelligence, 28(5):673–683.\nSolina, F. and Bajcsy, R.\n(1990).\nRecovery of parametric models from range images:\nThe case for superquadrics with global deformations. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 12(2):131–147.\nSontag, D. and Jaakkola, T. (2007). New outer bounds on the marginal polytope. In\nAdvances in Neural Information Processing Systems.\nSontag, D., Meltzer, T., Globerson, A., Jaakkola, T., and Weiss, Y. (2008). Tightening LP\nrelaxations for MAP using message passing. In Uncertainty in Artiﬁcial Intelligence\n(UAI).\nSoucy, M. and Laurendeau, D. (1992). Multi-resolution surface modeling from multiple\nrange views. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’92), pp. 348–353, Champaign, Illinois.\nSrinivasan, S., Chellappa, R., Veeraraghavan, A., and Aggarwal, G. (2005). Electronic\nimage stabilization and mosaicking algorithms. In Bovik, A. (ed.), Handbook of Image\nand Video Processing, Academic Press.\nSrivasan, P., Liang, P., and Hackwood, S. (1990). Computational geometric methods in\nvolumetric intersections for 3D reconstruction. Pattern Recognition, 23(8):843–857.\nStamos, I., Liu, L., Chen, C., Wolberg, G., Yu, G., and Zokai, S. (2008). Integrating\nautomated range registration with multiview geometry for the photorealistic modeling\nof large-scale scenes. International Journal of Computer Vision, 78(2-3):237–260.\nStark, J. A. (2000). Adaptive image contrast enhancement using generalizations of his-\ntogram equalization. IEEE Transactions on Image Processing, 9(5):889–896.\nStauffer, C. and Grimson, W.\n(1999).\nAdaptive background mixture models for real-\ntime tracking. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’99), pp. 246–252, Fort Collins.\nSteedly, D. and Essa, I. (2001). Propagation of innovative information in non-linear least-\nsquares structure from motion. In Eighth International Conference on Computer Vision\n(ICCV 2001), pp. 223–229, Vancouver, Canada.\nSteedly, D., Essa, I., and Dellaert, F. (2003). Spectral partitioning for structure from mo-\ntion. In Ninth International Conference on Computer Vision (ICCV 2003), pp. 996–\n1003, Nice, France.",
  "image_path": "page_923.jpg",
  "pages": [
    922,
    923,
    924
  ]
}