{
  "doc_id": "pages_629_631",
  "text": "12.6 Model-based reconstruction\n607\nand detecting if they are carrying objects (Haritaoglu, Harwood, and Davis 2000; Mittal and\nDavis 2003; Dimitrijevic, Lepetit, and Fua 2006).\nInitialization and detection.\nIn order to track people in a fully automated manner, it is\nnecessary to ﬁrst detect (or re-acquire) their presence in individual video frames. This topic\nis closely related to pedestrian detection, which is often considered as a kind of object recog-\nnition (Mori, Ren, Efros et al. 2004; Felzenszwalb and Huttenlocher 2005; Felzenszwalb,\nMcAllester, and Ramanan 2008), and is therefore treated in more depth in Section 14.1.2.\nAdditional techniques for initializing 3D trackers based on 2D images include those described\nby Howe, Leventon, and Freeman (2000), Rosales and Sclaroff (2000), Shakhnarovich, Viola,\nand Darrell (2003), Sminchisescu, Kanaujia, Li et al. (2005), Agarwal and Triggs (2006), Lee\nand Cohen (2006), Sigal and Black (2006), and Stenger, Thayananthan, Torr et al. (2006).\nSingle-frame human detection and pose estimation algorithms can sometimes be used by\nthemselves to perform tracking (Ramanan, Forsyth, and Zisserman 2005; Rogez, Rihan, Ra-\nmalingam et al. 2008; Bourdev and Malik 2009), as described in Section 4.1.4. More often,\nhowever, they are combined with frame-to-frame tracking techniques to provide better relia-\nbility (Fossati, Dimitrijevic, Lepetit et al. 2007; Andriluka, Roth, and Schiele 2008; Ferrari,\nMarin-Jimenez, and Zisserman 2008).\nTracking with ﬂow.\nThe tracking of people and their pose from frame to frame can be en-\nhanced by computing optic ﬂow or matching the appearance of their limbs from one frame\nto another. For example, the cardboard people model of Ju, Black, and Yacoob (1996) mod-\nels the appearance of each leg portion (upper and lower) as a moving rectangle, and uses\noptic ﬂow to estimate their location in each subsequent frame. Cham and Rehg (1999) and\nSidenbladh, Black, and Fleet (2000) track limbs using optical ﬂow and templates, along with\ntechniques for dealing with multiple hypotheses and uncertainty. Bregler, Malik, and Pullen\n(2004) use a full 3D model of limb and body motion, as described below. It is also possible to\nmatch the estimated motion ﬁeld itself to some prototypes in order to identify the particular\nphase of a running motion or to match two low-resolution video portions in order to perform\nvideo replacement (Efros, Berg, Mori et al. 2003).\n3D kinematic models.\nThe effectiveness of human modeling and tracking can be greatly\nenhanced using a more accurate 3D model of a person’s shape and motion. Underlying such\nrepresentations, which are ubiquitous in 3D computer animation in games and special effects,\nis a kinematic model or kinematic chain, which speciﬁes the length of each limb in a skeleton\nas well as the 2D or 3D rotation angles between the limbs or segments (Figure 12.20a–b).\nInferring the values of the joint angles from the locations of the visible surface points is\ncalled inverse kinematics (IK) and is widely studied in computer graphics.\n608\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\nFigure 12.20\nTracking 3D human motion: (a) kinematic chain model for a human hand\n(Rehg, Morris, and Kanade 2003) c⃝2003, reprinted by permission of SAGE; (b) tracking a\nkinematic chain blob model in a video sequence (Bregler, Malik, and Pullen 2004) c⃝2004\nSpringer; (c–d) probabilistic loose-limbed collection of body parts (Sigal, Bhatia, Roth et al.\n2004)\nFigure 12.20a shows the kinematic model for a human hand used by Rehg, Morris, and\nKanade (2003) to track hand motion in a video. As you can see, the attachment points between\nthe ﬁngers and the thumb have two degrees of freedom, while the ﬁnger joints themselves\nhave only one. Using this kind of model can greatly enhance the ability of an edge-based\ntracker to cope with rapid motion, ambiguities in 3D pose, and partial occlusions.\nKinematic chain models are even more widely used for whole body modeling and tracking\n(O’Rourke and Badler 1980; Hogg 1983; Rohr 1994). One popular approach is to associate\nan ellipsoid or superquadric with each rigid limb in the kinematic model, as shown in Fig-\nure 12.20b. This model can then be ﬁtted to each frame in one or more video streams either\nby matching silhouettes extracted from known backgrounds or by matching and tracking the\nlocations of occluding edges (Gavrila and Davis 1996; Kakadiaris and Metaxas 2000; Bre-\ngler, Malik, and Pullen 2004; Kehl and Van Gool 2006). Note that some techniques use 2D\nmodels coupled to 2D measurements, some use 3D measurements (range data or multi-view\nvideo) with 3D models, and some use monocular video to infer and track 3D models directly.\nIt is also possible to use temporal models to improve the tracking of periodic motions,\nsuch as walking, by analyzing the joint angles as functions of time (Polana and Nelson 1997;\nSeitz and Dyer 1997; Cutler and Davis 2000). The generality and applicability of such tech-\nniques can be improved by learning typical motion patterns using principal component anal-\nysis (Sidenbladh, Black, and Fleet 2000; Urtasun, Fleet, and Fua 2006).\nProbabilistic models.\nBecause tracking can be such a difﬁcult task, sophisticated proba-\nbilistic inference techniques are often used to estimate the likely states of the person being\ntracked. One popular approach, called particle ﬁltering (Isard and Blake 1998), was origi-\nnally developed for tracking the outlines of people and hands, as described in Section 5.1.2\n12.6 Model-based reconstruction\n609\nFigure 12.21 Estimating human shape and pose from a single image using a parametric 3D\nmodel (Guan, Weiss, Bˇalan et al. 2009) c⃝2009 IEEE.\n(Figures 5.6–5.8). It was subsequently applied to whole-body tracking (Deutscher, Blake,\nand Reid 2000; Sidenbladh, Black, and Fleet 2000; Deutscher and Reid 2005) and continues\nto be used in modern trackers (Ong, Micilotta, Bowden et al. 2006). Alternative approaches\nto handling the uncertainty inherent in tracking include multiple hypothesis tracking (Cham\nand Rehg 1999) and inﬂated covariances (Sminchisescu and Triggs 2001).\nFigure 12.20c–d shows an example of a sophisticated spatio-temporal probabilistic graph-\nical model called loose-limbed people, which models not only the geometric relationship be-\ntween various limbs, but also their likely temporal dynamics (Sigal, Bhatia, Roth et al. 2004).\nThe conditional probabilities relating various limbs and time instances are learned from train-\ning data, and particle ﬁltering is used to perform the ﬁnal pose inference.\nAdaptive shape modeling.\nAnother essential component of whole body modeling and\ntracking is the ﬁtting of parameterized shape models to visual data. As we saw in Sec-\ntion 12.6.3 (Figure 12.19), the availability of large numbers of registered 3D range scans can\nbe used to create morphable models of shape and appearance (Allen, Curless, and Popovi´c\n2003). Building on this work, Anguelov, Srinivasan, Koller et al. (2005) develop a sophis-\nticated system called SCAPE (Shape Completion and Animation for PEople), which ﬁrst",
  "image_path": "page_630.jpg",
  "pages": [
    629,
    630,
    631
  ]
}