{
  "doc_id": "pages_660_662",
  "text": "638\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nmultiple depth maps, sidestep the need for coherent 3D geometry, and can sometimes better\nmodel local non-rigid effects such as specular motion (Swaminathan, Kang, Szeliski et al.\n2002; Criminisi, Kang, Swaminathan et al. 2005). Sprites with depth and layered depth\nimages use image-based representations of both color and geometry and can be efﬁciently\nrendered using warping operations rather than 3D geometric rasterization.\nThe best choice of representation and rendering algorithm depends on both the quantity\nand quality of the input imagery as well as the intended application. When nearby views are\nbeing rendered, image-based representations capture more of the visual ﬁdelity of the real\nworld because they directly sample its appearance. On the other hand, if only a few input\nimages are available or the image-based models need to be manipulated, e.g., to change their\nshape or appearance, more abstract 3D representations such as geometric and local reﬂection\nmodels are a better ﬁt. As we continue to capture and manipulate increasingly larger quan-\ntities of visual data, research into these aspects of image-based modeling and rendering will\ncontinue to evolve.\n13.5 Video-based rendering\nSince multiple images can be used to render new images or interactive experiences, can some-\nthing similar be done with video? In fact, a fair amount of work has been done in the area\nof video-based rendering and video-based animation, two terms ﬁrst introduced by Sch¨odl,\nSzeliski, Salesin et al. (2000) to denote the process of generating new video sequences from\ncaptured video footage. An early example of such work is Video Rewrite (Bregler, Covell,\nand Slaney 1997), in which archival video footage is “re-animated” by having actors say new\nutterances (Figure 13.12). More recently, the term video-based rendering has been used by\nsome researchers to denote the creation of virtual camera moves from a set of synchronized\nvideo cameras placed in a studio (Magnor 2005). (The terms free-viewpoint video and 3D\nvideo are also sometimes used, see Section 13.5.4.)\nIn this section, we present a number of video-based rendering systems and applications.\nWe start with video-based animation (Section 13.5.1), in which video footage is re-arranged\nor modiﬁed, e.g., in the capture and re-rendering of facial expressions. A special case of this\nare video textures (Section 13.5.2), in which source video is automatically cut into segments\nand re-looped to create inﬁnitely long video animations. It is also possible to create such\nanimations from still pictures or paintings, by segmenting the image into separately moving\nregions and animating them using stochastic motion ﬁelds (Section 13.5.3).\nNext, we turn our attention to 3D video (Section 13.5.4), in which multiple synchronized\nvideo cameras are used to ﬁlm a scene from different directions. The source video frames can\nthen be re-combined using image-based rendering techniques, such as view interpolation, to\n13.5 Video-based rendering\n639\nFigure 13.12\nVideo Rewrite (Bregler, Covell, and Slaney 1997) c⃝1997 ACM: the video\nframes are composed from bits and pieces of old video footage matched to a new audio track.\ncreate virtual camera paths between the source cameras as part of a real-time viewing expe-\nrience. Finally, we discuss capturing environments by driving or walking through them with\npanoramic video cameras in order to create interactive video-based walkthrough experiences\n(Section 13.5.5).\n13.5.1 Video-based animation\nAs we mentioned above, an early example of video-based animation is Video Rewrite, in\nwhich frames from original video footage are rearranged in order to match them to novel\nspoken utterances, e.g., for movie dubbing (Figure 13.12). This is similar in spirit to the way\nthat concatenative speech synthesis systems work (Taylor 2009).\nIn their system, Bregler, Covell, and Slaney (1997) ﬁrst use speech recognition to extract\nphonemes from both the source video material and the novel audio stream. Phonemes are\ngrouped into triphones (triplets of phonemes), since these better model the coarticulation\neffect present when people speak. Matching triphones are then found in the source footage\nand audio track. The mouth images corresponding to the selected video frames are then\ncut and pasted into the desired video footage being re-animated or dubbed, with appropriate\ngeometric transformations to account for head motion. During the analysis phase, features\ncorresponding to the lips, chin, and head are tracked using computer vision techniques. Dur-\ning synthesis, image morphing techniques are used to blend and stitch adjacent mouth shapes\ninto a more coherent whole. In more recent work, Ezzat, Geiger, and Poggio (2002) describe\nhow to use a multidimensional morphable model (Section 12.6.2) combined with regularized\ntrajectory synthesis to improve these results.\nA more sophisticated version of this system, called face transfer, uses a novel source\nvideo, instead of just an audio track, to drive the animation of a previously captured video, i.e.,\nto re-render a video of a talking head with the appropriate visual speech, expression, and head\npose elements (Vlasic, Brand, Pﬁster et al. 2005). This work is one of many performance-\ndriven animation systems (Section 4.1.5), which are often used to animate 3D facial models\n640\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(Figures 12.18–12.19). While traditional performance-driven animation systems use marker-\nbased motion capture (Williams 1990; Litwinowicz and Williams 1994; Ma, Jones, Chiang\net al. 2008), video footage can now often be used directly to control the animation (Buck,\nFinkelstein, Jacobs et al. 2000; Pighin, Szeliski, and Salesin 2002; Zhang, Snavely, Curless\net al. 2004; Vlasic, Brand, Pﬁster et al. 2005; Roble and Zafar 2009).\nIn addition to its most common application to facial animation, video-based animation\ncan also be applied to whole body motion (Section 12.6.4), e.g., by matching the ﬂow ﬁelds\nbetween two different source videos and using one to drive the other (Efros, Berg, Mori et al.\n2003). Another approach to video-based rendering is to use ﬂow or 3D modeling to unwrap\nsurface textures into stabilized images, which can then be manipulated and re-rendered onto\nthe original video (Pighin, Szeliski, and Salesin 2002; Rav-Acha, Kohli, Fitzgibbon et al.\n2008).\n13.5.2 Video textures\nVideo-based animation is a powerful means of creating photo-realistic videos by re-purposing\nexisting video footage to match some other desired activity or script. What if instead of\nconstructing a special animation or narrative, we simply want the video to continue playing\nin a plausible manner? For example, many Web sites use images or videos to highlight their\ndestinations, e.g., to portray attractive beaches with surf and palm trees waving in the wind.\nInstead of using a static image or a video clip that has a discontinuity when it loops, can we\ntransform the video clip into an inﬁnite-length animation that plays forever?\nThis idea is the basis of video textures, in which a short video clip can be arbitrarily\nextended by re-arranging video frames while preserving visual continuity (Sch¨odl, Szeliski,\nSalesin et al. 2000). The basic problem in creating video textures is how to perform this\nre-arrangement without introducing visual artifacts. Can you think of how you might do this?\nThe simplest approach is to match frames by visual similarity (e.g., L2 distance) and to\njump between frames that appear similar. Unfortunately, if the motions in the two frames\nare different, a dramatic visual artifact will occur (the video will appear to “stutter”). For\nexample, if we fail to match the motions of the clock pendulum in Figure 13.13a, it can\nsuddenly change direction in mid-swing.\nHow can we extend our basic frame matching to also match motion? In principle, we\ncould compute optic ﬂow at each frame and match this. However, ﬂow estimates are often\nunreliable (especially in textureless regions) and it is not clear how to weight the visual and\nmotion similarities relative to each other. As an alternative, Sch¨odl, Szeliski, Salesin et al.\n(2000) suggest matching triplets or larger neighborhoods of adjacent video frames, much\nin the same way as Video Rewrite matches triphones. Once we have constructed an n ×\nn similarity matrix between all video frames (where n is the number of frames), a simple",
  "image_path": "page_661.jpg",
  "pages": [
    660,
    661,
    662
  ]
}