{
  "doc_id": "pages_394_396",
  "text": "372\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 7.11 Incremental structure from motion (Snavely, Seitz, and Szeliski 2006) c⃝2006\nACM: Starting with an initial two-frame reconstruction of Trevi Fountain, batches of images\nare added using pose estimation, and their positions (along with the 3D model) are reﬁned\nusing bundle adjustment.\nure 7.11 shows the progression of the incremental bundle adjustment algorithm, where sets of\ncameras are added after each successive round of bundle adjustment, while Figure 7.12 shows\nsome additional results. An alternative to this kind of seed and grow approach is to ﬁrst re-\nconstruct triplets of images and then hierarchically merge triplets into larger collections, as\ndescribed by Fitzgibbon and Zisserman (1998).\nUnfortunately, as the incremental structure from motion algorithm continues to add more\ncameras and points, it can become extremely slow. The direct solution of a dense system\nof O(N) equations for the camera pose updates can take O(N 3) time; while structure from\nmotion problems are rarely dense, scenes such as city squares have a high percentage of\ncameras that see points in common. Re-running the bundle adjustment algorithm after every\nfew camera additions results in a quartic scaling of the run time with the number of images\nin the dataset. One approach to solving this problem is to select a smaller number of images\nfor the original scene reconstruction and to fold in the remaining images at the very end.\nSnavely, Seitz, and Szeliski (2008b) develop an algorithm for computing such a skele-\ntal set of images, which is guaranteed to produce a reconstruction whose error is within a\nbounded factor of the optimal reconstruction accuracy. Their algorithm ﬁrst evaluates all\npairwise uncertainties (position covariances) between overlapping images and then chains\nthem together to estimate a lower bound for the relative uncertainty of any distant pair. The\nskeletal set is constructed so that the maximal uncertainty between any pair grows by no\nmore than a constant factor. Figure 7.13 shows an example of the skeletal set computed for\n784 images of the Pantheon in Rome. As you can see, even though the skeletal set contains\njust a fraction of the original images, the shapes of the skeletal set and full bundle adjusted\nreconstructions are virtually indistinguishable.\nThe ability to automatically reconstruct 3D models from large, unstructured image col-\nlections has opened a wide variety of additional applications, including the ability to automat-\n7.4 Bundle adjustment\n373\n(a)\n(b)\n(c)\nFigure 7.12\n3D reconstructions produced by the incremental structure from motion algo-\nrithm developed by Snavely, Seitz, and Szeliski (2006) c⃝2006 ACM: (a) cameras and point\ncloud from Trafalgar Square; (b) cameras and points overlaid on an image from the Great Wall\nof China; (c) overhead view of a reconstruction of the Old Town Square in Prague registered\nto an aerial photograph.\n(a)\n(b)\n(c)\n(d)\n(e)\nFigure 7.13\nLarge scale structure from motion using skeletal sets (Snavely, Seitz, and\nSzeliski 2008b) c⃝2008 IEEE: (a) original match graph for 784 images; (b) skeletal set\ncontaining 101 images; (c) top-down view of scene (Pantheon) reconstructed from the skele-\ntal set; (d) reconstruction after adding in the remaining images using pose estimation; (e) ﬁnal\nbundle adjusted reconstruction, which is almost identical.\n374\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nically ﬁnd and label locations and regions of interest (Simon, Snavely, and Seitz 2007; Simon\nand Seitz 2008; Gammeter, Bossard, Quack et al. 2009) and to cluster large image collections\nso that they can be automatically labeled (Li, Wu, Zach et al. 2008; Quack, Leibe, and Van\nGool 2008). Some of these application are discussed in more detail in Section 13.1.2.\n7.5 Constrained structure and motion\nThe most general algorithms for structure from motion make no prior assumptions about the\nobjects or scenes that they are reconstructing. In many cases, however, the scene contains\nhigher-level geometric primitives, such as lines and planes. These can provide information\ncomplementary to interest points and also serve as useful building blocks for 3D modeling\nand visualization. Furthermore, these primitives are often arranged in particular relationships,\ni.e., many lines and planes are either parallel or orthogonal to each other. This is particularly\ntrue of architectural scenes and models, which we study in more detail in Section 12.6.1.\nSometimes, instead of exploiting regularity in the scene structure, it is possible to take\nadvantage of a constrained motion model. For example, if the object of interest is rotating\non a turntable (Szeliski 1991b), i.e., around a ﬁxed but unknown axis, specialized techniques\ncan be used to recover this motion (Fitzgibbon, Cross, and Zisserman 1998). In other situa-\ntions, the camera itself may be moving in a ﬁxed arc around some center of rotation (Shum\nand He 1999). Specialized capture setups, such as mobile stereo camera rigs or moving ve-\nhicles equipped with multiple ﬁxed cameras, can also take advantage of the knowledge that\nindividual cameras are (mostly) ﬁxed with respect to the capture rig, as shown in Figure 7.8.19\n7.5.1 Line-based techniques\nIt is well known that pairwise epipolar geometry cannot be recovered from line matches\nalone, even if the cameras are calibrated. To see this, think of projecting the set of lines in\neach image into a set of 3D planes in space. You can move the two cameras around into any\nconﬁguration you like and still obtain a valid reconstruction for 3D lines.\nWhen lines are visible in three or more views, the trifocal tensor can be used to transfer\nlines from one pair of images to another (Hartley and Zisserman 2004). The trifocal tensor\ncan also be computed on the basis of line matches alone.\nSchmid and Zisserman (1997) describe a widely used technique for matching 2D lines\nbased on the average of 15 × 15 pixel correlation scores evaluated at all pixels along their\n19 Because of mechanical compliance and jitter, it may be prudent to allow for a small amount of individual camera\nrotation around a nominal position.",
  "image_path": "page_395.jpg",
  "pages": [
    394,
    395,
    396
  ]
}