{
  "doc_id": "pages_821_823",
  "text": "References\n799\nBeardsley, P., Torr, P., and Zisserman, A. (1996). 3D model acquisition from extended\nimage sequences. In Fourth European Conference on Computer Vision (ECCV’96),\npp. 683–695, Cambridge, England.\nBeare, R. (2006). A locally constrained watershed transform. IEEE Transactions on Pat-\ntern Analysis and Machine Intelligence, 28(7):1063–1074.\nBecker, S. and Bove, V. M. (1995). Semiautomatic 3-D model extraction from uncalibrated\n2-D camera views. In SPIE Vol. 2410, Visual Data Exploration and Analysis II, pp. 447–\n461, San Jose.\nBeier, T. and Neely, S. (1992). Feature-based image metamorphosis. Computer Graphics\n(SIGGRAPH ’92), 26(2):35–42.\nBeis, J. S. and Lowe, D. G. (1999). Indexing without invariants in 3D object recognition.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 21(10):1000–1015.\nBelhumeur, P. N. (1996). A Bayesian approach to binocular stereopsis. International\nJournal of Computer Vision, 19(3):237–260.\nBelhumeur, P. N., Hespanha, J. P., and Kriegman, D. J. (1997). Eigenfaces vs. Fisher-\nfaces: Recognition using class speciﬁc linear projection. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 19(7):711–720.\nBelongie, S. and Malik, J. (1998). Finding boundaries in natural images: a new method us-\ning point descriptors and area completion. In Fifth European Conference on Computer\nVision (ECCV’98), pp. 751–766, Freiburg, Germany.\nBelongie, S., Malik, J., and Puzicha, J. (2002). Shape matching and object recognition\nusing shape contexts. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n24(4):509–522.\nBelongie, S., Fowlkes, C., Chung, F., and Malik, J. (2002). Spectral partitioning with\nindeﬁnite kernels using the Nystr¨om extension. In Seventh European Conference on\nComputer Vision (ECCV 2002), pp. 531–543, Copenhagen.\nBennett, E., Uyttendaele, M., Zitnick, L., Szeliski, R., and Kang, S. B. (2006). Video\nand image Bayesian demosaicing with a two color image prior. In Ninth European\nConference on Computer Vision (ECCV 2006), pp. 508–521, Graz.\nBenosman, R. and Kang, S. B. (eds). (2001). Panoramic Vision: Sensors, Theory, and\nApplications, Springer, New York.\nBerg, T.\n(2008).\nInternet vision.\nSUNY Stony Brook Course CSE 690, http://www.\ntamaraberg.com/teaching/Fall 08/.\n800\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nBerg, T. and Forsyth, D. (2006). Animals on the web. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR’2006), pp. 1463–1470, New\nYork City, NY.\nBergen, J. R., Anandan, P., Hanna, K. J., and Hingorani, R.\n(1992).\nHierarchical\nmodel-based motion estimation. In Second European Conference on Computer Vision\n(ECCV’92), pp. 237–252, Santa Margherita Liguere, Italy.\nBergen, J. R., Burt, P. J., Hingorani, R., and Peleg, S. (1992). A three-frame algorithm for\nestimating two-component image motion. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 14(9):886–896.\nBerger, J. O. (1993). Statistical Decision Theory and Bayesian Analysis. Springer, New\nYork, second edition.\nBertalmio, M., Sapiro, G., Caselles, V., and Ballester, C. (2000). Image inpainting. In\nACM SIGGRAPH 2000 Conference Proceedings, pp. 417–424.\nBertalmio, M., Vese, L., Sapiro, G., and Osher, S. (2003). Simultaneous structure and\ntexture image inpainting. IEEE Transactions on Image Processing, 12(8):882–889.\nBertero, M., Poggio, T. A., and Torre, V. (1988). Ill-posed problems in early vision. Pro-\nceedings of the IEEE, 76(8):869–889.\nBesag, J. (1986). On the statistical analysis of dirty pictures. Journal of the Royal Statisti-\ncal Society B, 48(3):259–302.\nBesl, P. (1989). Active optical range imaging sensors. In Sanz, J. L. (ed.), Advances in\nMachine Vision, chapter 1, pp. 1–63, Springer-Verlag.\nBesl, P. J. and Jain, R. C.\n(1985).\nThree-dimensional object recognition.\nComputing\nSurveys, 17(1):75–145.\nBesl, P. J. and McKay, N. D. (1992). A method for registration of 3-D shapes. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 14(2):239–256.\nBetrisey, C., Blinn, J. F., Dresevic, B., Hill, B., Hitchcock, G. et al. (2000). Displaced ﬁlter-\ning for patterned displays. In Society for Information Display Symposium,, pp. 296–299.\nBeymer, D. (1996). Feature correspondence by interleaving shape and texture computa-\ntions. In IEEE Computer Society Conference on Computer Vision and Pattern Recogni-\ntion (CVPR’96), pp. 921–928, San Francisco.\nBhat, D. N. and Nayar, S. K. (1998). Ordinal measures for image correspondence. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 20(4):415–423.\nBickel, B., Botsch, M., Angst, R., Matusik, W., Otaduy, M., Pﬁster, H., and Gross, M.\n(2007).\nMulti-scale capture of facial geometry and motion.\nACM Transactions on\nGraphics, 26(3).\nReferences\n801\nBillinghurst, M., Kato, H., and Poupyrev, I. (2001). The MagicBook: a transitional AR\ninterface. Computers & Graphics, 25:745–753.\nBimber, O. (2006). Computational photography—the next big step. Computer, 39(8):28–\n29.\nBirchﬁeld, S. and Tomasi, C. (1998). A pixel dissimilarity measure that is insensitive\nto image sampling. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n20(4):401–406.\nBirchﬁeld, S. and Tomasi, C. (1999). Depth discontinuities by pixel-to-pixel stereo. Inter-\nnational Journal of Computer Vision, 35(3):269–293.\nBirchﬁeld, S. T., Natarajan, B., and Tomasi, C. (2007). Correspondence as energy-based\nsegmentation. Image and Vision Computing, 25(8):1329–1340.\nBishop, C. M. (2006). Pattern Recognition and Machine Learning. Springer, New York,\nNY.\nBitouk, D., Kumar, N., Dhillon, S., Belhumeur, P., and Nayar, S. K. (2008). Face swapping:\nAutomatically replacing faces in photographs. ACM Transactions on Graphics, 27(3).\nBj¨orck, A. (1996). Numerical Methods for Least Squares Problems. Society for Industrial\nand Applied Mathematics.\nBj¨orck, A. and Dahlquist, G. (2010). Numerical Methods in Scientiﬁc Computing. Vol-\nume II, Society for Industrial and Applied Mathematics.\nBlack, M., Yacoob, Y., Jepson, A. D., and Fleet, D. J. (1997). Learning parameterized\nmodels of image motion. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR’97), pp. 561–567, San Juan, Puerto Rico.\nBlack, M. J. and Anandan, P. (1996). The robust estimation of multiple motions: Para-\nmetric and piecewise-smooth ﬂow ﬁelds. Computer Vision and Image Understanding,\n63(1):75–104.\nBlack, M. J. and Jepson, A. D.\n(1996).\nEstimating optical ﬂow in segmented images\nusing variable-order parametric models with local deformations. IEEE Transactions on\nPattern Analysis and Machine Intelligence, 18(10):972–986.\nBlack, M. J. and Jepson, A. D. (1998). EigenTracking: robust matching and tracking of ar-\nticulated objects using a view-based representation. International Journal of Computer\nVision, 26(1):63–84.\nBlack, M. J. and Rangarajan, A.\n(1996).\nOn the uniﬁcation of line processes, outlier\nrejection, and robust statistics with applications in early vision. International Journal\nof Computer Vision, 19(1):57–91.",
  "image_path": "page_822.jpg",
  "pages": [
    821,
    822,
    823
  ]
}