{
  "doc_id": "pages_085_087",
  "text": "2.2 Photometric image formation\n63\nMost surfaces are isotropic, i.e., there are no preferred directions on the surface as far\nas light transport is concerned. (The exceptions are anisotropic surfaces such as brushed\n(scratched) aluminum, where the reﬂectance depends on the light orientation relative to the\ndirection of the scratches.) For an isotropic material, we can simplify the BRDF to\nfr(θi, θr, |φr −φi|; λ) or fr(ˆvi, ˆvr, ˆn; λ),\n(2.82)\nsince the quantities θi, θr and φr −φi can be computed from the directions ˆvi, ˆvr, and ˆn.\nTo calculate the amount of light exiting a surface point p in a direction ˆvr under a given\nlighting condition, we integrate the product of the incoming light Li(ˆvi; λ) with the BRDF\n(some authors call this step a convolution). Taking into account the foreshortening factor\ncos+ θi, we obtain\nLr(ˆvr; λ) =\nZ\nLi(ˆvi; λ)fr(ˆvi, ˆvr, ˆn; λ) cos+ θi dˆvi,\n(2.83)\nwhere\ncos+ θi = max(0, cos θi).\n(2.84)\nIf the light sources are discrete (a ﬁnite number of point light sources), we can replace the\nintegral with a summation,\nLr(ˆvr; λ) =\nX\ni\nLi(λ)fr(ˆvi, ˆvr, ˆn; λ) cos+ θi.\n(2.85)\nBRDFs for a given surface can be obtained through physical modeling (Torrance and\nSparrow 1967; Cook and Torrance 1982; Glassner 1995), heuristic modeling (Phong 1975), or\nthrough empirical observation (Ward 1992; Westin, Arvo, and Torrance 1992; Dana, van Gin-\nneken, Nayar et al. 1999; Dorsey, Rushmeier, and Sillion 2007; Weyrich, Lawrence, Lensch\net al. 2008).6 Typical BRDFs can often be split into their diffuse and specular components,\nas described below.\nDiffuse reﬂection\nThe diffuse component (also known as Lambertian or matte reﬂection) scatters light uni-\nformly in all directions and is the phenomenon we most normally associate with shading,\ne.g., the smooth (non-shiny) variation of intensity with surface normal that is seen when ob-\nserving a statue (Figure 2.16). Diffuse reﬂection also often imparts a strong body color to\nthe light since it is caused by selective absorption and re-emission of light inside the object’s\nmaterial (Shafer 1985; Glassner 1995).\n6 See http://www1.cs.columbia.edu/CAVE/software/curet/ for a database of some empirically sampled BRDFs.\n64\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 2.16\nThis close-up of a statue shows both diffuse (smooth shading) and specular\n(shiny highlight) reﬂection, as well as darkening in the grooves and creases due to reduced\nlight visibility and interreﬂections. (Photo courtesy of the Caltech Vision Lab, http://www.\nvision.caltech.edu/archive.html.)\nWhile light is scattered uniformly in all directions, i.e., the BRDF is constant,\nfd(ˆvi, ˆvr, ˆn; λ) = fd(λ),\n(2.86)\nthe amount of light depends on the angle between the incident light direction and the surface\nnormal θi. This is because the surface area exposed to a given amount of light becomes larger\nat oblique angles, becoming completely self-shadowed as the outgoing surface normal points\naway from the light (Figure 2.17a). (Think about how you orient yourself towards the sun or\nﬁreplace to get maximum warmth and how a ﬂashlight projected obliquely against a wall is\nless bright than one pointing directly at it.) The shading equation for diffuse reﬂection can\nthus be written as\nLd(ˆvr; λ) =\nX\ni\nLi(λ)fd(λ) cos+ θi =\nX\ni\nLi(λ)fd(λ)[ˆvi · ˆn]+,\n(2.87)\nwhere\n[ˆvi · ˆn]+ = max(0, ˆvi · ˆn).\n(2.88)\nSpecular reﬂection\nThe second major component of a typical BRDF is specular (gloss or highlight) reﬂection,\nwhich depends strongly on the direction of the outgoing light. Consider light reﬂecting off a\nmirrored surface (Figure 2.17b). Incident light rays are reﬂected in a direction that is rotated\nby 180◦around the surface normal ˆn. Using the same notation as in Equations (2.29–2.30),\n2.2 Photometric image formation\n65\nvi•n = 1\n^  ^\n0 < vi•n < 1\n^  ^\nvi•n < 0\n^  ^\nvi•n = 0\n^  ^\nvi\nv┴\nn^\nv║\n-v┴\nsi\n180°\nv║\n^\n^\n(a)\n(b)\nFigure 2.17 (a) The diminution of returned light caused by foreshortening depends on ˆvi·ˆn,\nthe cosine of the angle between the incident light direction ˆvi and the surface normal ˆn. (b)\nMirror (specular) reﬂection: The incident light ray direction ˆvi is reﬂected onto the specular\ndirection ˆsi around the surface normal ˆn.\nwe can compute the specular reﬂection direction ˆsi as\nˆsi = v∥−v⊥= (2ˆnˆnT −I)vi.\n(2.89)\nThe amount of light reﬂected in a given direction ˆvr thus depends on the angle θs =\ncos−1(ˆvr · ˆsi) between the view direction ˆvr and the specular direction ˆsi. For example, the\nPhong (1975) model uses a power of the cosine of the angle,\nfs(θs; λ) = ks(λ) coske θs,\n(2.90)\nwhile the Torrance and Sparrow (1967) micro-facet model uses a Gaussian,\nfs(θs; λ) = ks(λ) exp(−c2\nsθ2\ns).\n(2.91)\nLarger exponents ke (or inverse Gaussian widths cs) correspond to more specular surfaces\nwith distinct highlights, while smaller exponents better model materials with softer gloss.\nPhong shading\nPhong (1975) combined the diffuse and specular components of reﬂection with another term,\nwhich he called the ambient illumination. This term accounts for the fact that objects are\ngenerally illuminated not only by point light sources but also by a general diffuse illumination\ncorresponding to inter-reﬂection (e.g., the walls in a room) or distant sources, such as the",
  "image_path": "page_086.jpg",
  "pages": [
    85,
    86,
    87
  ]
}