{
  "doc_id": "pages_820_822",
  "text": "798\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nBartoli, A. (2003). Towards gauge invariant bundle adjustment: A solution based on gauge\ndependent damping.\nIn Ninth International Conference on Computer Vision (ICCV\n2003), pp. 760–765, Nice, France.\nBartoli, A. and Sturm, P. (2003). Multiple-view structure and motion from line correspon-\ndences. In Ninth International Conference on Computer Vision (ICCV 2003), pp. 207–\n212, Nice, France.\nBartoli, A., Coquerelle, M., and Sturm, P.\n(2004).\nA framework for pencil-of-points\nstructure-from-motion. In Eighth European Conference on Computer Vision (ECCV\n2004), pp. 28–40, Prague.\nBascle, B., Blake, A., and Zisserman, A.\n(1996).\nMotion deblurring and super-\nresolution from an image sequence. In Fourth European Conference on Computer Vi-\nsion (ECCV’96), pp. 573–582, Cambridge, England.\nBathe, K.-J. (2007). Finite Element Procedures. Prentice-Hall, Inc., Englewood Cliffs,\nNew Jersey.\nBatra, D., Sukthankar, R., and Chen, T. (2008). Learning class-speciﬁc afﬁnities for im-\nage labelling. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2008), Anchorage, AK.\nBaudisch, P., Tan, D., Steedly, D., Rudolph, E., Uyttendaele, M., Pal, C., and Szeliski, R.\n(2006). An exploration of user interface designs for real-time panoramic photography.\nAustralian Journal of Information Systems, 13(2).\nBaumberg, A.\n(2000).\nReliable feature matching across widely separated views.\nIn\nIEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2000), pp. 774–781, Hilton Head Island.\nBaumberg, A. M. and Hogg, D. C. (1996). Generating spatiotemporal models from exam-\nples. Image and Vision Computing, 14(8):525–532.\nBaumgart, B. G.\n(1974).\nGeometric Modeling for Computer Vision.\nTechnical Re-\nport AIM-249, Artiﬁcial Intelligence Laboratory, Stanford University.\nBay, H., Ferrari, V., and Van Gool, L. (2005). Wide-baseline stereo matching with line seg-\nments. In IEEE Computer Society Conference on Computer Vision and Pattern Recog-\nnition (CVPR’2005), pp. 329–336, San Diego, CA.\nBay, H., Tuytelaars, T., and Van Gool, L. (2006). SURF: Speeded up robust features. In\nNinth European Conference on Computer Vision (ECCV 2006), pp. 404–417.\nBayer, B. E. (1976). Color imaging array. US Patent No. 3,971,065.\nReferences\n799\nBeardsley, P., Torr, P., and Zisserman, A. (1996). 3D model acquisition from extended\nimage sequences. In Fourth European Conference on Computer Vision (ECCV’96),\npp. 683–695, Cambridge, England.\nBeare, R. (2006). A locally constrained watershed transform. IEEE Transactions on Pat-\ntern Analysis and Machine Intelligence, 28(7):1063–1074.\nBecker, S. and Bove, V. M. (1995). Semiautomatic 3-D model extraction from uncalibrated\n2-D camera views. In SPIE Vol. 2410, Visual Data Exploration and Analysis II, pp. 447–\n461, San Jose.\nBeier, T. and Neely, S. (1992). Feature-based image metamorphosis. Computer Graphics\n(SIGGRAPH ’92), 26(2):35–42.\nBeis, J. S. and Lowe, D. G. (1999). Indexing without invariants in 3D object recognition.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 21(10):1000–1015.\nBelhumeur, P. N. (1996). A Bayesian approach to binocular stereopsis. International\nJournal of Computer Vision, 19(3):237–260.\nBelhumeur, P. N., Hespanha, J. P., and Kriegman, D. J. (1997). Eigenfaces vs. Fisher-\nfaces: Recognition using class speciﬁc linear projection. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 19(7):711–720.\nBelongie, S. and Malik, J. (1998). Finding boundaries in natural images: a new method us-\ning point descriptors and area completion. In Fifth European Conference on Computer\nVision (ECCV’98), pp. 751–766, Freiburg, Germany.\nBelongie, S., Malik, J., and Puzicha, J. (2002). Shape matching and object recognition\nusing shape contexts. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n24(4):509–522.\nBelongie, S., Fowlkes, C., Chung, F., and Malik, J. (2002). Spectral partitioning with\nindeﬁnite kernels using the Nystr¨om extension. In Seventh European Conference on\nComputer Vision (ECCV 2002), pp. 531–543, Copenhagen.\nBennett, E., Uyttendaele, M., Zitnick, L., Szeliski, R., and Kang, S. B. (2006). Video\nand image Bayesian demosaicing with a two color image prior. In Ninth European\nConference on Computer Vision (ECCV 2006), pp. 508–521, Graz.\nBenosman, R. and Kang, S. B. (eds). (2001). Panoramic Vision: Sensors, Theory, and\nApplications, Springer, New York.\nBerg, T.\n(2008).\nInternet vision.\nSUNY Stony Brook Course CSE 690, http://www.\ntamaraberg.com/teaching/Fall 08/.\n800\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nBerg, T. and Forsyth, D. (2006). Animals on the web. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR’2006), pp. 1463–1470, New\nYork City, NY.\nBergen, J. R., Anandan, P., Hanna, K. J., and Hingorani, R.\n(1992).\nHierarchical\nmodel-based motion estimation. In Second European Conference on Computer Vision\n(ECCV’92), pp. 237–252, Santa Margherita Liguere, Italy.\nBergen, J. R., Burt, P. J., Hingorani, R., and Peleg, S. (1992). A three-frame algorithm for\nestimating two-component image motion. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 14(9):886–896.\nBerger, J. O. (1993). Statistical Decision Theory and Bayesian Analysis. Springer, New\nYork, second edition.\nBertalmio, M., Sapiro, G., Caselles, V., and Ballester, C. (2000). Image inpainting. In\nACM SIGGRAPH 2000 Conference Proceedings, pp. 417–424.\nBertalmio, M., Vese, L., Sapiro, G., and Osher, S. (2003). Simultaneous structure and\ntexture image inpainting. IEEE Transactions on Image Processing, 12(8):882–889.\nBertero, M., Poggio, T. A., and Torre, V. (1988). Ill-posed problems in early vision. Pro-\nceedings of the IEEE, 76(8):869–889.\nBesag, J. (1986). On the statistical analysis of dirty pictures. Journal of the Royal Statisti-\ncal Society B, 48(3):259–302.\nBesl, P. (1989). Active optical range imaging sensors. In Sanz, J. L. (ed.), Advances in\nMachine Vision, chapter 1, pp. 1–63, Springer-Verlag.\nBesl, P. J. and Jain, R. C.\n(1985).\nThree-dimensional object recognition.\nComputing\nSurveys, 17(1):75–145.\nBesl, P. J. and McKay, N. D. (1992). A method for registration of 3-D shapes. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 14(2):239–256.\nBetrisey, C., Blinn, J. F., Dresevic, B., Hill, B., Hitchcock, G. et al. (2000). Displaced ﬁlter-\ning for patterned displays. In Society for Information Display Symposium,, pp. 296–299.\nBeymer, D. (1996). Feature correspondence by interleaving shape and texture computa-\ntions. In IEEE Computer Society Conference on Computer Vision and Pattern Recogni-\ntion (CVPR’96), pp. 921–928, San Francisco.\nBhat, D. N. and Nayar, S. K. (1998). Ordinal measures for image correspondence. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 20(4):415–423.\nBickel, B., Botsch, M., Angst, R., Matusik, W., Otaduy, M., Pﬁster, H., and Gross, M.\n(2007).\nMulti-scale capture of facial geometry and motion.\nACM Transactions on\nGraphics, 26(3).",
  "image_path": "page_821.jpg",
  "pages": [
    820,
    821,
    822
  ]
}