{
  "doc_id": "pages_514_516",
  "text": "492\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nlog\nexp\ndiff\nint.\ncompress\n2500:1\n7.5:1\nH(x)\nI(x)\nH’(x)\nG(x)\nFigure 10.25\nGradient domain tone mapping (Fattal, Lischinski, and Werman 2002) c⃝\n2002 ACM. The original image with a dynamic range of 2415:1 is ﬁrst converted into the log\ndomain, H(x), and its gradients are computed, H′(x). These are attenuated (compressed)\nbased on local contrast, G(x), and integrated to produce the new logarithmic exposure image\nI(x), which is exponentiated to produce the ﬁnal intensity image, whose dynamic range is\n7.5:1.\nto obtain the compressed log-luminance image I(x, y). This least squares problem is the\nsame that was used for Poisson blending (Section 9.3.4) and was ﬁrst introduced in our study\nof regularization (Section 3.7.1, 3.100). It can efﬁciently be solved using techniques such\nas multigrid and hierarchical basis preconditioning (Fattal, Lischinski, and Werman 2002;\nSzeliski 2006b; Farbman, Fattal, Lischinski et al. 2008). Once the new luminance image has\nbeen computed, it is combined with the original color image using\nCout =\n\u0012Cin\nLin\n\u0013s\nLout,\n(10.20)\nwhere C = (R, G, B) and Lin and Lout are the original and compressed luminance images.\nThe exponent s controls the saturation of the colors and is typically in the range s ∈[0.4, 0.6].\nFigure 10.26b shows the ﬁnal tone-mapped color image, which shows no visible halos despite\nthe extremely large variation in input radiance values.\nYet another alternative to these two approaches is to perform the local dodging and burn-\ning using a locally scale-selective operator (Reinhard, Stark, Shirley et al. 2002). Figure 10.27\nshows how such a scale selection operator can determine a radius (scale) that only includes\n10.2 High dynamic range imaging\n493\n(a)\n(b)\nFigure 10.26\nGradient domain tone mapping (Fattal, Lischinski, and Werman 2002) c⃝\n2002 ACM: (a) attenuation map, with darker values corresponding to more attenuation; (b)\nﬁnal tone-mapped image.\nsimilar color values within the inner circle while avoiding much brighter values in the sur-\nrounding circle. In practice, a difference of Gaussians normalized by the inner Gaussian\nresponse is evaluated over a range of scales, and the largest scale whose metric is below a\nthreshold is selected (Reinhard, Stark, Shirley et al. 2002).\nWhat all of these techniques have in common is that they adaptively attenuate or brighten\ndifferent regions of the image so that they can be displayed in a limited gamut without loss of\ncontrast. Lischinski, Farbman, Uyttendaele et al. (2006b) introduce an interactive technique\nthat performs this operation by interpolating a set of sparse user-drawn adjustments (strokes\nand associated exposure value corrections) to a piecewise-continuous exposure correction\nmap (Figure 10.28). The interpolation is performed by minimizing a locally weighted least\nsquare (WLS) variational problem,\nmin\nZ Z\nwd(x, y)∥f(x, y) −g(x, y)∥2dx dy + λ\nZ Z\nws(x, y)∥∇f(x, y)∥2dx dy,\n(10.21)\nwhere g(x, y) and f(x, y) are the input and output log exposure (attenuation) maps (Fig-\nure 10.28). The data weighting term wd(x, y) is 1 at stroke locations and 0 elsewhere. The\nsmoothness weighting term ws(x, y) is inversely proportional to the log-luminance gradient,\nws =\n1\n∥∇H∥α + ϵ\n(10.22)\nand hence encourages the f(x, y) map to be smoother in low-gradient areas than along high-\ngradient discontinuities.14 The same approach can also be used for fully automated tone map-\n14 In practice, the x and y discrete derivatives are weighted separately (Lischinski, Farbman, Uyttendaele et al.\n494\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 10.27\nScale selection for tone mapping (Reinhard, Stark, Shirley et al. 2002) c⃝\n2002 ACM.\nping by setting target exposure values at each pixel and allowing the weighted least squares\nto convert these into piecewise smooth adjustment maps.\nThe weighted least squares algorithm, which was originally developed for image coloriza-\ntion applications (Levin, Lischinski, and Weiss 2004), has recently been applied to general\nedge-preserving smoothing in applications such as contrast enhancement (Bae, Paris, and\nDurand 2006) and tone mapping (Farbman, Fattal, Lischinski et al. 2008) where the bilateral\nﬁltering was previously used. It can also be used to perform HDR merging and tone mapping\nsimultaneously (Raman and Chaudhuri 2007, 2009).\nGiven the wide range of locally adaptive tone mapping algorithms that have been devel-\noped, which ones should be used in practice? Freeman (2008) provides a great discussion\nof commercially available algorithms, their artifacts, and the parameters that can be used to\ncontrol them. He also has a wealth of tips for HDR photography and workﬂow. I highly rec-\nommend his book for anyone contemplating additional research (or personal photography) in\nthis area.\n10.2.2 Application: Flash photography\nWhile high dynamic range imaging combines images of a scene taken at different exposures,\nit is also possible to combine ﬂash and non-ﬂash images to achieve better exposure and color\nbalance and to reduce noise (Eisemann and Durand 2004; Petschnigg, Agrawala, Hoppe et\nal. 2004).\nThe problem with ﬂash images is that the color is often unnatural (it fails to capture the\nambient illumination), there may be strong shadows or specularities, and there is a radial\nfalloff in brightness away from the camera (Figures 10.1b and 10.29a). Non-ﬂash photos\n2006b). Their default parameter settings are λ = 0.2, α = 1, and ϵ = 0.0001.",
  "image_path": "page_515.jpg",
  "pages": [
    514,
    515,
    516
  ]
}