{
  "doc_id": "pages_325_327",
  "text": "5.5 Graph cuts and energy-based methods\n303\nFigure 5.25\nSegmentation with a directed graph cut (Boykov and Funka-Lea 2006) c⃝2006\nSpringer: (a) directed graph; (b) image with seed points; (c) the undirected graph incorrectly\ncontinues the boundary along the bright object; (d) the directed graph correctly segments the\nlight gray region from its darker surround.\ndirected edges, which allows boundary regions to be oriented, e.g., to prefer light to dark tran-\nsitions or vice versa (Kolmogorov and Boykov 2005). Figure 5.25 shows an example where\nthe directed graph cut correctly segments the light gray liver from its dark gray surround. The\nsame approach can be used to measure the ﬂux exiting a region, i.e., the signed gradient pro-\njected normal to the region boundary. Combining oriented graphs with larger neighborhoods\nenables approximating continuous problems such as those traditionally solved using level sets\nin the globally optimal graph cut framework (Boykov and Kolmogorov 2003; Kolmogorov\nand Boykov 2005).\nEven more recent developments in graph cut-based segmentation techniques include the\naddition of connectivity priors to force the foreground to be in a single piece (Vicente, Kol-\nmogorov, and Rother 2008) and shape priors to use knowledge about an object’s shape during\nthe segmentation process (Lempitsky and Boykov 2007; Lempitsky, Blake, and Rother 2008).\nWhile optimizing the binary MRF energy (5.50) requires the use of combinatorial op-\ntimization techniques, such as maximum ﬂow, an approximate solution can be obtained by\nconverting the binary energy terms into quadratic energy terms deﬁned over a continuous\n[0, 1] random ﬁeld, which then becomes a classical membrane-based regularization problem\n(3.100–3.102). The resulting quadratic energy function can then be solved using standard\nlinear system solvers (3.102–3.103), although if speed is an issue, you should use multigrid\nor one of its variants (Appendix A.5).\nOnce the continuous solution has been computed, it\ncan be thresholded at 0.5 to yield a binary segmentation.\nThe [0, 1] continuous optimization problem can also be interpreted as computing the prob-\n304\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nability at each pixel that a random walker starting at that pixel ends up at one of the labeled\nseed pixels, which is also equivalent to computing the potential in a resistive grid where the\nresistors are equal to the edge weights (Grady 2006; Sinop and Grady 2007). K-way seg-\nmentations can also be computed by iterating through the seed labels, using a binary problem\nwith one label set to 1 and all the others set to 0 to compute the relative membership proba-\nbilities for each pixel. In follow-on work, Grady and Ali (2008) use a precomputation of the\neigenvectors of the linear system to make the solution with a novel set of seeds faster, which\nis related to the Laplacian matting problem presented in Section 10.4.3 (Levin, Acha, and\nLischinski 2008). Couprie, Grady, Najman et al. (2009) relate the random walker to water-\nsheds and other segmentation techniques. Singaraju, Grady, and Vidal (2008) add directed-\nedge constraints in order to support ﬂux, which makes the energy piecewise quadratic and\nhence not solvable as a single linear system. The random walker algorithm can also be used\nto solve the Mumford–Shah segmentation problem (Grady and Alvino 2008) and to com-\npute fast multigrid solutions (Grady 2008). A nice review of these techniques is given by\nSingaraju, Grady, Sinop et al. (2010).\nAn even faster way to compute a continuous [0, 1] approximate segmentation is to com-\npute weighted geodesic distances between the 0 and 1 seed regions (Bai and Sapiro 2009),\nwhich can also be used to estimate soft alpha mattes (Section 10.4.3). A related approach by\nCriminisi, Sharp, and Blake (2008) can be used to ﬁnd fast approximate solutions to general\nbinary Markov random ﬁeld optimization problems.\n5.5.1 Application: Medical image segmentation\nOne of the most promising applications of image segmentation is in the medical imaging\ndomain, where it can be used to segment anatomical tissues for later quantitative analysis.\nFigure 5.25 shows a binary graph cut with directed edges being used to segment the liver tis-\nsue (light gray) from its surrounding bone (white) and muscle (dark gray) tissue. Figure 5.26\nshows the segmentation of bones in a 256 × 256 × 119 computed X-ray tomography (CT)\nvolume. Without the powerful optimization techniques available in today’s image segmen-\ntation algorithms, such processing used to require much more laborious manual tracing of\nindividual X-ray slices.\nThe ﬁelds of medical image segmentation (McInerney and Terzopoulos 1996) and med-\nical image registration (Kybic and Unser 2003) (Section 8.3.1) are rich research ﬁelds with\ntheir own specialized conferences, such as Medical Imaging Computing and Computer As-\nsisted Intervention (MICCAI),11 and journals, such as Medical Image Analysis and IEEE\nTransactions on Medical Imaging. These can be great sources of references and ideas for\nresearch in this area.\n11http://www.miccai.org/.\n5.6 Additional reading\n305\n(a)\n(b)\nFigure 5.26\n3D volumetric medical image segmentation using graph cuts (Boykov and\nFunka-Lea 2006) c⃝2006 Springer: (a) computed tomography (CT) slice with some seeds;\n(b) recovered 3D volumetric bone model (on a 256 × 256 × 119 voxel grid).\n5.6 Additional reading\nThe topic of image segmentation is closely related to clustering techniques, which are treated\nin a number of monographs and review articles (Jain and Dubes 1988; Kaufman and Rousseeuw\n1990; Jain, Duin, and Mao 2000; Jain, Topchy, Law et al. 2004). Some early segmentation\ntechniques include those describerd by Brice and Fennema (1970); Pavlidis (1977); Riseman\nand Arbib (1977); Ohlander, Price, and Reddy (1978); Rosenfeld and Davis (1979); Haralick\nand Shapiro (1985), while examples of newer techniques are developed by Leclerc (1989);\nMumford and Shah (1989); Shi and Malik (2000); Felzenszwalb and Huttenlocher (2004b).\nArbel´aez, Maire, Fowlkes et al. (2010) provide a good review of automatic segmentation\ntechniques and also compare their performance on the Berkeley Segmentation Dataset and\nBenchmark (Martin, Fowlkes, Tal et al. 2001).12 Additional comparison papers and databases\ninclude those by Unnikrishnan, Pantofaru, and Hebert (2007); Alpert, Galun, Basri et al.\n(2007); Estrada and Jepson (2009).\nThe topic of active contours has a long history, beginning with the seminal work on\nsnakes and other energy-minimizing variational methods (Kass, Witkin, and Terzopoulos\n1988; Cootes, Cooper, Taylor et al. 1995; Blake and Isard 1998), continuing through tech-\nniques such as intelligent scissors (Mortensen and Barrett 1995, 1999; P´erez, Blake, and\nGangnet 2001), and culminating in level sets (Malladi, Sethian, and Vemuri 1995; Caselles,\nKimmel, and Sapiro 1997; Sethian 1999; Paragios and Deriche 2000; Sapiro 2001; Osher and\nParagios 2003; Paragios, Faugeras, Chan et al. 2005; Cremers, Rousson, and Deriche 2007;\nRousson and Paragios 2008; Paragios and Sgallari 2009), which are currently the most widely\n12 http://www.eecs.berkeley.edu/Research/Projects/CS/vision/grouping/segbench/.",
  "image_path": "page_326.jpg",
  "pages": [
    325,
    326,
    327
  ]
}