{
  "doc_id": "pages_208_210",
  "text": "186\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nf (i, j)\nsx(i, j)\nf (i, j+1)\nsy(i, j)\nw(i, j)\nd (i, j)\nf (i+1, j)\nf (i+1, j+1)\nd (i, j+1)\nFigure 3.59\nGraphical model for a Markov random ﬁeld with a more complex measurement\nmodel. The additional colored edges show how combinations of unknown values (say, in a\nsharp image) produce the measured values (a noisy blurred image). The resulting graphical\nmodel is still a classic MRF and is just as easy to sample from, but some inference algorithms\n(e.g., those based on graph cuts) may not be applicable because of the increased network\ncomplexity, since state changes during the inference become more entangled and the posterior\nMRF has much larger cliques.\nbelief propagation algorithm computes a slightly lower energy and also a smoother image\nthan the alpha-expansion graph cut algorithm.\nOf course, the above formula (3.113) for the smoothness term Ep(i, j) just shows the\nsimplest case. In more recent work, Roth and Black (2009) propose a Field of Experts (FoE)\nmodel, which sums up a large number of exponentiated local ﬁlter outputs to arrive at the\nsmoothness penalty. Weiss and Freeman (2007) analyze this approach and compare it to the\nsimpler hyper-Laplacian model of natural image statistics. Lyu and Simoncelli (2009) use\nGaussian Scale Mixtures (GSMs) to construct an inhomogeneous multi-scale MRF, with one\n(positive exponential) GMRF modulating the variance (amplitude) of another Gaussian MRF.\nIt is also possible to extend the measurement model to make the sampled (noise-corrupted)\ninput pixels correspond to blends of unknown (latent) image pixels, as in Figure 3.59. This is\nthe commonly occurring case when trying to de-blur an image. While this kind of a model is\nstill a traditional generative Markov random ﬁeld, ﬁnding an optimal solution can be difﬁcult\nbecause the clique sizes get larger. In such situations, gradient descent techniques, such\nas iteratively reweighted least squares, can be used (Joshi, Zitnick, Szeliski et al. 2009).\nExercise 3.31 has you explore some of these issues.\n3.7 Global optimization\n187\nFigure 3.60\nAn unordered label MRF (Agarwala, Dontcheva, Agrawala et al. 2004) c⃝\n2004 ACM: Strokes in each of the source images on the left are used as constraints on an\nMRF optimization, which is solved using graph cuts. The resulting multi-valued label ﬁeld is\nshown as a color overlay in the middle image, and the ﬁnal composite is shown on the right.\nUnordered labels\nAnother case with multi-valued labels where Markov random ﬁelds are often applied are\nunordered labels, i.e., labels where there is no semantic meaning to the numerical difference\nbetween the values of two labels. For example, if we are classifying terrain from aerial\nimagery, it makes no sense to take the numeric difference between the labels assigned to\nforest, ﬁeld, water, and pavement. In fact, the adjacencies of these various kinds of terrain\neach have different likelihoods, so it makes more sense to use a prior of the form\nEp(i, j) = sx(i, j)V (l(i, j), l(i + 1, j)) + sy(i, j)V (l(i, j), l(i, j + 1)),\n(3.115)\nwhere V (l0, l1) is a general compatibility or potential function. (Note that we have also\nreplaced f(i, j) with l(i, j) to make it clearer that these are labels rather than discrete function\nsamples.) An alternative way to write this prior energy (Boykov, Veksler, and Zabih 2001;\nSzeliski, Zabih, Scharstein et al. 2008) is\nEp =\nX\n(p,q)∈N\nVp,q(lp, lq),\n(3.116)\nwhere the (p, q) are neighboring pixels and a spatially varying potential function Vp,q is eval-\nuated for each neighboring pair.\nAn important application of unordered MRF labeling is seam ﬁnding in image composit-\ning (Davis 1998; Agarwala, Dontcheva, Agrawala et al. 2004) (see Figure 3.60, which is\nexplained in more detail in Section 9.3.2). Here, the compatibility Vp,q(lp, lq) measures the\nquality of the visual appearance that would result from placing a pixel p from image lp next\nto a pixel q from image lq. As with most MRFs, we assume that Vp,q(l, l) = 0, i.e., it is per-\nfectly ﬁne to choose contiguous pixels from the same image. For different labels, however,\n188\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 3.61\nImage segmentation (Boykov and Funka-Lea 2006) c⃝2006 Springer: The user\ndraws a few red strokes in the foreground object and a few blue ones in the background. The\nsystem computes color distributions for the foreground and background and solves a binary\nMRF. The smoothness weights are modulated by the intensity gradients (edges), which makes\nthis a conditional random ﬁeld (CRF).\nthe compatibility Vp,q(lp, lq) may depend on the values of the underlying pixels Ilp(p) and\nIlq(q).\nConsider, for example, where one image I0 is all sky blue, i.e., I0(p) = I0(q) = B, while\nthe other image I1 has a transition from sky blue, I1(p) = B, to forest green, I1(q) = G.\nI0 :\np\nq\np\nq\n: I1\nIn this case, Vp,q(1, 0) = 0 (the colors agree), while Vp,q(0, 1) > 0 (the colors disagree).\nConditional random ﬁelds\nIn a classic Bayesian model (3.106–3.108),\np(x|y) ∝p(y|x)p(x),\n(3.117)\nthe prior distribution p(x) is independent of the observations y. Sometimes, however, it is\nuseful to modify our prior assumptions, say about the smoothness of the ﬁeld we are trying\nto estimate, in response to the sensed data. Whether this makes sense from a probability\nviewpoint is something we discuss once we have explained the new model.\nConsider the interactive image segmentation problem shown in Figure 3.61 (Boykov and\nFunka-Lea 2006). In this application, the user draws foreground (red) and background (blue)\nstrokes, and the system then solves a binary MRF labeling problem to estimate the extent of\nthe foreground object. In addition to minimizing a data term, which measures the pointwise\nsimilarity between pixel colors and the inferred region distributions (Section 5.5), the MRF",
  "image_path": "page_209.jpg",
  "pages": [
    208,
    209,
    210
  ]
}