{
  "doc_id": "pages_610_612",
  "text": "588\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\nFigure 12.7 Real-time dense 3D face capture using spacetime stereo (Zhang, Snavely, Cur-\nless et al. 2004) c⃝2004 ACM: (a) set of ﬁve consecutive video frames from one of two stereo\ncameras (every ﬁfth frame is free of stripe patterns, in order to extract texture); (b) resulting\nhigh-quality 3D surface model (depth map visualized as a shaded rendering).\nThe basic idea (Davis, Ramamoorthi, and Rusinkiewicz 2003; Zhang, Curless, and Seitz\n2003) is to assume that depth is nearly constant within a 3D space–time window around\neach pixel and to use the 3D window for matching and reconstruction. Depending on the\nsurface shape and motion, this assumption may be error-prone, as shown in (Davis, Nahab,\nRamamoorthi et al. 2005). To model shapes more accurately, Zhang, Curless, and Seitz\n(2003) model the linear disparity variation within the space–time window and show that bet-\nter results can be obtained by globally optimizing disparity and disparity gradient estimates\nover video volumes (Zhang, Snavely, Curless et al. 2004). Figure 12.7 shows the results of\napplying this system to a person’s face; the frame-rate 3D surface model can then be used for\nfurther model-based ﬁtting and computer graphics manipulation (Section 12.6.2).\n12.2.1 Range data merging\nWhile individual range images can be useful for applications such as real-time z-keying or fa-\ncial motion capture, they are often used as building blocks for more complete 3D object mod-\neling. In such applications, the next two steps in processing are the registration (alignment) of\npartial 3D surface models and their integration into coherent 3D surfaces (Curless 1999). If\ndesired, this can be followed by a model ﬁtting stage using either parametric representations\nsuch as generalized cylinders (Agin and Binford 1976; Nevatia and Binford 1977; Marr and\nNishihara 1978; Brooks 1981), superquadrics (Pentland 1986; Solina and Bajcsy 1990; Ter-\nzopoulos and Metaxas 1991), or non-parametric models such as triangular meshes (Boissonat\n1984) or physically-based models (Terzopoulos, Witkin, and Kass 1988; Delingette, Hebert,\nand Ikeuichi 1992; Terzopoulos and Metaxas 1991; McInerney and Terzopoulos 1993; Ter-\nzopoulos 1999). A number of techniques have also been developed for segmenting range\nimages into simpler constituent surfaces (Hoover, Jean-Baptiste, Jiang et al. 1996).\nThe most widely used 3D registration technique is the iterated closest point (ICP) algo-\n12.2 Active rangeﬁnding\n589\nrithm, which alternates between ﬁnding the closest point matches between the two surfaces\nbeing aligned and then solving a 3D absolute orientation problem (Section 6.1.5, (6.31–6.32)\n(Besl and McKay 1992; Chen and Medioni 1992; Zhang 1994; Szeliski and Lavall´ee 1996;\nGold, Rangarajan, Lu et al. 1998; David, DeMenthon, Duraiswami et al. 2004; Li and Hart-\nley 2007; Enqvist, Josephson, and Kahl 2009).3 Since the two surfaces being aligned usually\nonly have partial overlap and may also have outliers, robust matching criteria (Section 6.1.4\nand Appendix B.3) are typically used. In order to speed up the determination of the closest\npoint, and also to make the distance-to-surface computation more accurate, one of the two\npoint sets (e.g., the current merged model) can be converted into a signed distance function,\noptionally represented using an octree spline for compactness (Lavall´ee and Szeliski 1995).\nVariants on the basic ICP algorithm can be used to register 3D point sets under non-rigid de-\nformations, e.g., for medical applications (Feldmar and Ayache 1996; Szeliski and Lavall´ee\n1996). Color values associated with the points or range measurements can also be used as\npart of the registration process to improve robustness (Johnson and Kang 1997; Pulli 1999).\nUnfortunately, the ICP algorithm and its variants can only ﬁnd a locally optimal alignment\nbetween 3D surfaces. If this is not known a priori, more global correspondence or search\ntechniques, based on local descriptors invariant to 3D rigid transformations, need to be used.\nAn example of such a descriptor is the spin image, which is a local circular projection of a\n3D surface patch around the local normal axis (Johnson and Hebert 1999). Another (earlier)\nexample is the splash representation introduced by Stein and Medioni (1992).\nOnce two or more 3D surfaces have been aligned, they can be merged into a single model.\nOne approach is to represent each surface using a triangulated mesh and combine these\nmeshes using a process that is sometimes called zippering (Soucy and Laurendeau 1992;\nTurk and Levoy 1994). Another, now more widely used, approach is to compute a signed\ndistance function that ﬁts all of the 3D data points (Hoppe, DeRose, Duchamp et al. 1992;\nCurless and Levoy 1996; Hilton, Stoddart, Illingworth et al. 1996; Wheeler, Sato, and Ikeuchi\n1998).\nFigure 12.8 shows one such approach, the volumetric range image processing (VRIP)\ntechnique developed by Curless and Levoy (1996), which ﬁrst computes a weighted signed\ndistance function from each range image and then merges them using a weighted averaging\nprocess. To make the representation more compact, run-length coding is used to encode\nthe empty, seen, and varying (signed distance) voxels, and only the signed distance values\nnear each surface are stored.4 Once the merged signed distance function has been computed,\na zero-crossing surface extraction algorithm, such as marching cubes (Lorensen and Cline\n1987), can be used to recover a meshed surface model. Figure 12.9 shows an example of the\n3 Some techniques, such as the one developed by Chen and Medioni (1992), use local surface tangent planes to\nmake this computation more accurate and to accelerate convergence.\n4 An alternative, even more compact, representation could be to use octrees (Lavall´ee and Szeliski 1995).\n590\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\nFigure 12.8 Range data merging (Curless and Levoy 1996) c⃝1996 ACM: (a) two signed\ndistance functions (top left) are merged with their (weights) bottom left to produce a com-\nbined set of functions (right column) from which an isosurface can be extracted (green dashed\nline); (b) the signed distance functions are combined with empty and unseen space labels to\nﬁll holes in the isosurface.\ncomplete range data merging and isosurface extraction pipeline.\nVolumetric range data merging techniques based on signed distance or characteristic\n(inside–outside) functions are also widely used to extract smooth well-behaved surfaces from\noriented or unoriented sets of points (Hoppe, DeRose, Duchamp et al. 1992; Ohtake, Belyaev,\nAlexa et al. 2003; Kazhdan, Bolitho, and Hoppe 2006; Lempitsky and Boykov 2007; Zach,\nPock, and Bischof 2007b; Zach 2008), as discussed in more detail in Section 12.5.1.\n12.2.2 Application: Digital heritage\nActive rangeﬁnding technologies, combined with surface modeling and appearance model-\ning techniques (Section 12.7), are widely used in the ﬁelds of archeological and historical\npreservation, which often also goes under the name digital heritage (MacDonald 2006). In\nsuch applications, detailed 3D models of cultural objects are acquired and later used for ap-\nplications such as analysis, preservation, restoration, and the production of duplicate artwork\n(Rioux and Bird 1993).\nA more recent example of such an endeavor is the Digital Michelangelo project of Levoy,\nPulli, Curless et al. (2000), which used Cyberware laser stripe scanners and high-quality\ndigital SLR cameras mounted on a large gantry to obtain detailed scans of Michelangelo’s\nDavid and other sculptures in Florence. The project also took scans of the Forma Urbis\nRomae, an ancient stone map of Rome that had shattered into pieces, for which new matches\nwere obtained using digital techniques. The whole process, from initial planning, to software",
  "image_path": "page_611.jpg",
  "pages": [
    610,
    611,
    612
  ]
}