{
  "doc_id": "pages_615_617",
  "text": "12.3 Surface representations\n593\nwhere the weights,\nwi(x) = K(∥x −xi∥),\n(12.7)\nare computed using a radial basis (spherically symmetrical) function K(r).\nIf we want the function f(x) to exactly interpolate the data points, the kernel functions\nmust either be singular at the origin, limr→0 K(r) →∞(Nielson 1993), or a dense linear\nsystem must be solved to determine the magnitude associated with each basis function (Boult\nand Kender 1986). It turns out that, for certain regularized problems, e.g., (3.94–3.96), there\nexist radial basis functions (kernels) that give the same results as a full analytical solution\n(Boult and Kender 1986). Unfortunately, because the dense system solving is cubic in the\nnumber of data points, basis function approaches can only be used for small problems such\nas feature-based image morphing (Beier and Neely 1992).\nWhen a three-dimensional parametric surface is being modeled, the vector-valued func-\ntion f in (12.6) or (3.94–3.102) encodes 3D coordinates (x, y, z) on the surface and the\ndomain x = (s, t) encodes the surface parameterization. One example of such surfaces are\nsymmetry-seeking parametric models, which are elastically deformable versions of general-\nized cylinders6 (Terzopoulos, Witkin, and Kass 1987). In these models, s is the parameter\nalong the spine of the deformable tube and t is the parameter around the tube. A variety of\nsmoothness and radial symmetry forces are used to constrain the model while it is ﬁtted to\nimage-based silhouette curves.\nIt is also possible to deﬁne non-parametric surface models such as general triangulated\nmeshes and to equip such meshes (using ﬁnite element analysis) with both internal smooth-\nness metrics and external data ﬁtting metrics (Sander and Zucker 1990; Fua and Sander 1992;\nDelingette, Hebert, and Ikeuichi 1992; McInerney and Terzopoulos 1993). While most of\nthese approaches assume a standard elastic deformation model, which uses quadratic inter-\nnal smoothness terms, it is also possible to use sub-linear energy models in order to better\npreserve surface creases (Diebel, Thrun, and Br¨unig 2006). Triangle meshes can also be aug-\nmented with either spline elements (Sullivan and Ponce 1998) or subdivision surfaces (Stoll-\nnitz, DeRose, and Salesin 1996; Zorin, Schr¨oder, and Sweldens 1996; Warren and Weimer\n2001; Peters and Reif 2008) to produce surfaces with better smoothness control.\nBoth parametric and non-parametric surface models assume that the topology of the sur-\nface is known and ﬁxed ahead of time. For more ﬂexible surface modeling, we can either rep-\nresent the surface as a collection of oriented points (Section 12.4) or use 3D implicit functions\n(Section 12.5.1), which can also be combined with elastic 3D surface models (McInerney and\nTerzopoulos 1993).\n6 A generalized cylinder (Brooks 1981) is a solid of revolution, i.e., the result of rotating a (usually smooth) curve\naround an axis. It can also be generated by sweeping a slowly varying circular cross-section along the axis. (These\ntwo interpretations are equivalent.)\n594\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\nFigure 12.11 Progressive mesh representation of an airplane model (Hoppe 1996) c⃝1996\nACM: (a) base mesh M 0 (150 faces); (b) mesh M 175 (500 faces); (c) mesh M 425 (1000\nfaces); (d) original mesh M = M n (13,546 faces).\n12.3.2 Surface simpliﬁcation\nOnce a triangle mesh has been created from 3D data, it is often desirable to create a hierarchy\nof mesh models, for example, to control the displayed level of detail (LOD) in a computer\ngraphics application. (In essence, this is a 3D analog to image pyramids (Section 3.5).) One\napproach to doing this is to approximate a given mesh with one that has subdivision connec-\ntivity, over which a set of triangular wavelet coefﬁcients can then be computed (Eck, DeRose,\nDuchamp et al. 1995). A more continuous approach is to use sequential edge collapse opera-\ntions to go from the original ﬁne-resolution mesh to a coarse base-level mesh (Hoppe 1996).\nThe resulting progressive mesh (PM) representation can be used to render the 3D model at\narbitrary levels of detail, as shown in Figure 12.11.\n12.3.3 Geometry images\nWhile multi-resolution surface representations such as (Eck, DeRose, Duchamp et al. 1995;\nHoppe 1996) support level of detail operations, they still consist of an irregular collection of\ntriangles, which makes them more difﬁcult to compress and store in a cache-efﬁcient manner.7\nTo make the triangulation completely regular (uniform and gridded), Gu, Gortler, and\nHoppe (2002) describe how to create geometry images by cutting surface meshes along well-\nchosen lines and “ﬂattening” the resulting representation into a square. Figure 12.12a shows\nthe resulting (x, y, z) values of the surface mesh mapped over the unit square, while Fig-\nure 12.12b shows the associated (nx, ny, nz) normal map, i.e., the surface normals associ-\nated with each mesh vertex, which can be used to compensate for loss in visual ﬁdelity if the\noriginal geometry image is heavily compressed.\n7 Subdivision triangulations, such as those in (Eck, DeRose, Duchamp et al. 1995), are semi-regular, i.e., regular\n(ordered and nested) within each subdivided base triangle.\n12.4 Point-based representations\n595\n(x, y, z)\n+\n(nx, ny, nz)\n=⇒\n(a)\n(b)\n(c)\nFigure 12.12 Geometry images (Gu, Gortler, and Hoppe 2002) c⃝2002 ACM: (a) the 257×\n257 geometry image deﬁnes a mesh over the surface; (b) the 512 × 512 normal map deﬁnes\nvertex normals; (c) ﬁnal lit 3D model.\n12.4 Point-based representations\nAs we mentioned previously, triangle-based surface models assume that the topology (and\noften the rough shape) of the 3D model is known ahead of time. While it is possible to\nre-mesh a model as it is being deformed or ﬁtted, a simpler solution is to dispense with an\nexplicit triangle mesh altogether and to have triangle vertices behave as oriented points, or\nparticles, or surface elements (surfels) (Szeliski and Tonnesen 1992).\nIn order to endow the resulting particle system with internal smoothness constraints, pair-\nwise interaction potentials can be deﬁned that approximate the equivalent elastic bending\nenergies that would be obtained using local ﬁnite-element analysis.8 Instead of deﬁning the\nﬁnite element neighborhood for each particle (vertex) ahead of time, a soft inﬂuence function\nis used to couple nearby particles. The resulting 3D model can change both topology and par-\nticle density as it evolves and can therefore be used to interpolate partial 3D data with holes\n(Szeliski, Tonnesen, and Terzopoulos 1993b). Discontinuities in both the surface orientation\nand crease curves can also be modeled (Szeliski, Tonnesen, and Terzopoulos 1993a).\nTo render the particle system as a continuous surface, local dynamic triangulation heuris-\ntics (Szeliski and Tonnesen 1992) or direct surface element splatting (Pﬁster, Zwicker, van\nBaar et al. 2000) can be used. Another alternative is to ﬁrst convert the point cloud into an\nimplicit signed distance or inside–outside function, using either minimum signed distances\nto the oriented points (Hoppe, DeRose, Duchamp et al. 1992) or by interpolating a charac-\nteristic (inside–outside) function using radial basis functions (Turk and O’Brien 2002; Dinh,\nTurk, and Slabaugh 2002). Even greater precision over the implicit function ﬁtting, including\nthe ability to handle irregular point densities, can be obtained by computing a moving least\n8 As mentioned before, an alternative is to use sub-linear interaction potentials, which encourage the preservation\nof surface creases (Diebel, Thrun, and Br¨unig 2006).",
  "image_path": "page_616.jpg",
  "pages": [
    615,
    616,
    617
  ]
}