{
  "doc_id": "pages_028_030",
  "text": "6\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFigure 1.4 Some industrial applications of computer vision: (a) optical character recognition\n(OCR) http://yann.lecun.com/exdb/lenet/; (b) mechanical inspection http://www.cognitens.\ncom/; (c) retail http://www.evoretail.com/; (d) medical imaging http://www.clarontech.com/;\n(e) automotive safety http://www.mobileye.com/; (f) surveillance and trafﬁc monitoring http:\n//www.honeywellvideo.com/, courtesy of Honeywell International Inc.\n1.1 What is computer vision?\n7\n• Motion capture (mocap): using retro-reﬂective markers viewed from multiple cam-\neras or other vision-based techniques to capture actors for computer animation;\n• Surveillance: monitoring for intruders, analyzing highway trafﬁc (Figure 1.4f), and\nmonitoring pools for drowning victims;\n• Fingerprint recognition and biometrics: for automatic access authentication as well\nas forensic applications.\nDavid Lowe’s Web site of industrial vision applications (http://www.cs.ubc.ca/spider/lowe/\nvision.html) lists many other interesting industrial applications of computer vision. While the\nabove applications are all extremely important, they mostly pertain to fairly specialized kinds\nof imagery and narrow domains.\nIn this book, we focus more on broader consumer-level applications, such as fun things\nyou can do with your own personal photographs and video. These include:\n• Stitching: turning overlapping photos into a single seamlessly stitched panorama (Fig-\nure 1.5a), as described in Chapter 9;\n• Exposure bracketing: merging multiple exposures taken under challenging lighting\nconditions (strong sunlight and shadows) into a single perfectly exposed image (Fig-\nure 1.5b), as described in Section 10.2;\n• Morphing: turning a picture of one of your friends into another, using a seamless\nmorph transition (Figure 1.5c);\n• 3D modeling: converting one or more snapshots into a 3D model of the object or\nperson you are photographing (Figure 1.5d), as described in Section 12.6\n• Video match move and stabilization: inserting 2D pictures or 3D models into your\nvideos by automatically tracking nearby reference points (see Section 7.4.2)3 or using\nmotion estimates to remove shake from your videos (see Section 8.2.1);\n• Photo-based walkthroughs: navigating a large collection of photographs, such as the\ninterior of your house, by ﬂying between different photos in 3D (see Sections 13.1.2\nand 13.5.5)\n• Face detection: for improved camera focusing as well as more relevant image search-\ning (see Section 14.1.1);\n• Visual authentication: automatically logging family members onto your home com-\nputer as they sit down in front of the webcam (see Section 14.2).\n8\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\nFigure 1.5\nSome consumer applications of computer vision: (a) image stitching: merging\ndifferent views (Szeliski and Shum 1997) c⃝1997 ACM; (b) exposure bracketing: merging\ndifferent exposures; (c) morphing: blending between two photographs (Gomes, Darsa, Costa\net al. 1999) c⃝1999 Morgan Kaufmann; (d) turning a collection of photographs into a 3D\nmodel (Sinha, Steedly, Szeliski et al. 2008) c⃝2008 ACM.",
  "image_path": "page_029.jpg",
  "pages": [
    28,
    29,
    30
  ]
}