{
  "doc_id": "pages_027_029",
  "text": "1.1 What is computer vision?\n5\ndomains, such as rendering a still scene composed of everyday objects or animating extinct\ncreatures such as dinosaurs, the illusion of reality is perfect.\nIn computer vision, we are trying to do the inverse, i.e., to describe the world that we see\nin one or more images and to reconstruct its properties, such as shape, illumination, and color\ndistributions. It is amazing that humans and animals do this so effortlessly, while computer\nvision algorithms are so error prone. People who have not worked in the ﬁeld often under-\nestimate the difﬁculty of the problem. (Colleagues at work often ask me for software to ﬁnd\nand name all the people in photos, so they can get on with the more “interesting” work.) This\nmisperception that vision should be easy dates back to the early days of artiﬁcial intelligence\n(see Section 1.2), when it was initially believed that the cognitive (logic proving and plan-\nning) parts of intelligence were intrinsically more difﬁcult than the perceptual components\n(Boden 2006).\nThe good news is that computer vision is being used today in a wide variety of real-world\napplications, which include:\n• Optical character recognition (OCR): reading handwritten postal codes on letters\n(Figure 1.4a) and automatic number plate recognition (ANPR);\n• Machine inspection: rapid parts inspection for quality assurance using stereo vision\nwith specialized illumination to measure tolerances on aircraft wings or auto body parts\n(Figure 1.4b) or looking for defects in steel castings using X-ray vision;\n• Retail: object recognition for automated checkout lanes (Figure 1.4c);\n• 3D model building (photogrammetry): fully automated construction of 3D models\nfrom aerial photographs used in systems such as Bing Maps;\n• Medical imaging: registering pre-operative and intra-operative imagery (Figure 1.4d)\nor performing long-term studies of people’s brain morphology as they age;\n• Automotive safety: detecting unexpected obstacles such as pedestrians on the street,\nunder conditions where active vision techniques such as radar or lidar do not work\nwell (Figure 1.4e; see also Miller, Campbell, Huttenlocher et al. (2008); Montemerlo,\nBecker, Bhat et al. (2008); Urmson, Anhalt, Bagnell et al. (2008) for examples of fully\nautomated driving);\n• Match move: merging computer-generated imagery (CGI) with live action footage by\ntracking feature points in the source video to estimate the 3D camera motion and shape\nof the environment. Such techniques are widely used in Hollywood (e.g., in movies\nsuch as Jurassic Park) (Roble 1999; Roble and Zafar 2009); they also require the use of\nprecise matting to insert new elements between foreground and background elements\n(Chuang, Agarwala, Curless et al. 2002).\n6\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFigure 1.4 Some industrial applications of computer vision: (a) optical character recognition\n(OCR) http://yann.lecun.com/exdb/lenet/; (b) mechanical inspection http://www.cognitens.\ncom/; (c) retail http://www.evoretail.com/; (d) medical imaging http://www.clarontech.com/;\n(e) automotive safety http://www.mobileye.com/; (f) surveillance and trafﬁc monitoring http:\n//www.honeywellvideo.com/, courtesy of Honeywell International Inc.\n1.1 What is computer vision?\n7\n• Motion capture (mocap): using retro-reﬂective markers viewed from multiple cam-\neras or other vision-based techniques to capture actors for computer animation;\n• Surveillance: monitoring for intruders, analyzing highway trafﬁc (Figure 1.4f), and\nmonitoring pools for drowning victims;\n• Fingerprint recognition and biometrics: for automatic access authentication as well\nas forensic applications.\nDavid Lowe’s Web site of industrial vision applications (http://www.cs.ubc.ca/spider/lowe/\nvision.html) lists many other interesting industrial applications of computer vision. While the\nabove applications are all extremely important, they mostly pertain to fairly specialized kinds\nof imagery and narrow domains.\nIn this book, we focus more on broader consumer-level applications, such as fun things\nyou can do with your own personal photographs and video. These include:\n• Stitching: turning overlapping photos into a single seamlessly stitched panorama (Fig-\nure 1.5a), as described in Chapter 9;\n• Exposure bracketing: merging multiple exposures taken under challenging lighting\nconditions (strong sunlight and shadows) into a single perfectly exposed image (Fig-\nure 1.5b), as described in Section 10.2;\n• Morphing: turning a picture of one of your friends into another, using a seamless\nmorph transition (Figure 1.5c);\n• 3D modeling: converting one or more snapshots into a 3D model of the object or\nperson you are photographing (Figure 1.5d), as described in Section 12.6\n• Video match move and stabilization: inserting 2D pictures or 3D models into your\nvideos by automatically tracking nearby reference points (see Section 7.4.2)3 or using\nmotion estimates to remove shake from your videos (see Section 8.2.1);\n• Photo-based walkthroughs: navigating a large collection of photographs, such as the\ninterior of your house, by ﬂying between different photos in 3D (see Sections 13.1.2\nand 13.5.5)\n• Face detection: for improved camera focusing as well as more relevant image search-\ning (see Section 14.1.1);\n• Visual authentication: automatically logging family members onto your home com-\nputer as they sit down in front of the webcam (see Section 14.2).",
  "image_path": "page_028.jpg",
  "pages": [
    27,
    28,
    29
  ]
}