{
  "doc_id": "pages_903_905",
  "text": "References\n881\nPﬁster, H., Zwicker, M., van Baar, J., and Gross, M. (2000). Surfels: Surface elements as\nrendering primitives. In ACM SIGGRAPH 2000 Conference Proceedings, pp. 335–342.\nPﬂugfelder, R. (2008). Self-calibrating Cameras in Video Surveillance. Ph.D. thesis, Graz\nUniversity of Technology.\nPhilbin, J. and Zisserman, A. (2008). Object mining using a matching graph on very large\nimage collections.\nIn Indian Conference on Computer Vision, Graphics and Image\nProcessing, Bhubaneswar, India.\nPhilbin, J., Chum, O., Isard, M., Sivic, J., and Zisserman, A. (2007). Object retrieval with\nlarge vocabularies and fast spatial matching. In IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nPhilbin, J., Chum, O., Sivic, J., Isard, M., and Zisserman, A. (2008). Lost in quantization:\nImproving particular object retrieval in large scale image databases. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR 2008),\nAnchorage, AK.\nPhillips, P. J., Moon, H., Rizvi, S. A., and Rauss, P. J. (2000). The FERET evaluation\nmethodology for face recognition algorithms. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 22(10):1090–1104.\nPhillips, P. J., Scruggs, W. T., O’Toole, A. J., Flynn, P. J., Bowyer, K. W. et al. (2010).\nFRVT 2006 and ICE 2006 large-scale experimental results. IEEE Transactions on Pat-\ntern Analysis and Machine Intelligence, 32(5):831–846.\nPhong, B. T. (1975). Illumination for computer generated pictures. Communications of the\nACM, 18(6):311–317.\nPickup, L. C. (2007). Machine Learning in Multi-frame Image Super-resolution. Ph.D.\nthesis, University of Oxford.\nPickup, L. C. and Zisserman, A. (2009). Automatic retrieval of visual continuity errors\nin movies. In ACM International Conference on Image and Video Retrieval, Santorini,\nGreece.\nPickup, L. C., Capel, D. P., Roberts, S. J., and Zisserman, A. (2007). Overcoming reg-\nistration uncertainty in image super-resolution: Maximize or marginalize? EURASIP\nJournal on Advances in Signal Processing, 2010(Article ID 23565).\nPickup, L. C., Capel, D. P., Roberts, S. J., and Zisserman, A. (2009). Bayesian methods for\nimage super-resolution. The Computer Journal, 52.\nPighin, F., Szeliski, R., and Salesin, D. H. (2002). Modeling and animating realistic faces\nfrom images. International Journal of Computer Vision, 50(2):143–169.\n882\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nPighin, F., Hecker, J., Lischinski, D., Salesin, D. H., and Szeliski, R. (1998). Synthesizing\nrealistic facial expressions from photographs. In ACM SIGGRAPH 1998 Conference\nProceedings, pp. 75–84, Orlando.\nPilet, J., Lepetit, V., and Fua, P. (2008). Fast non-rigid surface detection, registration, and\nrealistic augmentation. International Journal of Computer Vision, 76(2).\nPinz, A. (2005). Object categorization. Foundations and Trends in Computer Graphics\nand Computer Vision, 1(4):255–353.\nPizer, S. M., Amburn, E. P., Austin, J. D., Cromartie, R., Geselowitz, A. et al. (1987).\nAdaptive histogram equalization and its variations. Computer Vision, Graphics, and\nImage Processing, 39(3):355–368.\nPlatel, B., Balmachnova, E., Florack, L., and ter Haar Romeny, B. (2006). Top-points as\ninterest points for image matching. In Ninth European Conference on Computer Vision\n(ECCV 2006), pp. 418–429.\nPlatt, J. C. (2000). Optimal ﬁltering for patterned displays. IEEE Signal Processing Let-\nters, 7(7):179–180.\nPock, T., Unger, M., Cremers, D., and Bischof, H. (2008). Fast and exact solution of total\nvariation models on the GPU. In CVPR 2008 Workshop on Visual Computer Vision on\nGPUs (CVGPU), Anchorage, AK.\nPoelman, C. J. and Kanade, T. (1997). A paraperspective factorization method for shape\nand motion recovery. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n19(3):206–218.\nPoggio, T. and Koch, C. (1985). Ill-posed problems in early vision: from computational\ntheory to analogue networks. Proceedings of the Royal Society of London, B 226:303–\n323.\nPoggio, T., Gamble, E., and Little, J. (1988). Parallel integration of vision modules. Sci-\nence, 242(4877):436–440.\nPoggio, T., Torre, V., and Koch, C. (1985). Computational vision and regularization theory.\nNature, 317(6035):314–319.\nPoggio, T., Little, J., Gamble, E., Gillet, W., Geiger, D. et al. (1988). The MIT vision\nmachine. In Image Understanding Workshop, pp. 177–198, Boston.\nPolana, R. and Nelson, R. C. (1997). Detection and recognition of periodic, nonrigid\nmotion. International Journal of Computer Vision, 23(3):261–282.\nPollard, S. B., Mayhew, J. E. W., and Frisby, J. P. (1985). PMF: A stereo correspondence\nalgorithm using a disparity gradient limit. Perception, 14:449–470.\nReferences\n883\nPollefeys, M. and Van Gool, L. (2002). From images to 3D models. Communications of\nthe ACM, 45(7):50–55.\nPollefeys, M., Nist´er, D., Frahm, J.-M., Akbarzadeh, A., Mordohai, P. et al. (2008). De-\ntailed real-time urban 3D reconstruction from video. International Journal of Computer\nVision, 78(2-3):143–167.\nPonce, J., Hebert, M., Schmid, C., and Zisserman, A. (eds). (2006). Toward Category-Level\nObject Recognition, Springer, New York.\nPonce, J., Berg, T., Everingham, M., Forsyth, D., Hebert, M. et al. (2006). Dataset issues\nin object recognition. In Ponce, J., Hebert, M., Schmid, C., and Zisserman, A. (eds),\nToward Category-Level Object Recognition, pp. 29–48, Springer, New York.\nPons, J.-P., Keriven, R., and Faugeras, O. (2005). Modelling dynamic scenes by register-\ning multi-view image sequences. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR’2005), pp. 822–827, San Diego, CA.\nPons, J.-P., Keriven, R., and Faugeras, O. (2007). Multi-view stereo reconstruction and\nscene ﬂow estimation with a global image-based matching score. International Journal\nof Computer Vision, 72(2):179–193.\nPorter, T. and Duff, T. (1984). Compositing digital images. Computer Graphics (SIG-\nGRAPH ’84), 18(3):253–259.\nPortilla, J. and Simoncelli, E. P. (2000). A parametric texture model based on joint statistics\nof complex wavelet coefﬁcients. International Journal of Computer Vision, 40(1):49–\n71.\nPortilla, J., Strela, V., Wainwright, M., and Simoncelli, E. P. (2003). Image denoising\nusing scale mixtures of Gaussians in the wavelet domain. IEEE Transactions on Image\nProcessing, 12(11):1338–1351.\nPotetz, B. and Lee, T. S. (2008). Efﬁcient belief propagation for higher-order cliques using\nlinear constraint nodes. Computer Vision and Image Understanding, 112(1):39–54.\nPotmesil, M. (1987). Generating octree models of 3D objects from their silhouettes in a\nsequence of images. Computer Vision, Graphics, and Image Processing, 40:1–29.\nPratt, W. K. (2007). Digital Image Processing. Wiley-Interscience, Hoboken, NJ, 4th\nedition.\nPrazdny, K. (1985). Detection of binocular disparities. Biological Cybernetics, 52:93–99.\nPritchett, P. and Zisserman, A. (1998). Wide baseline stereo matching. In Sixth Interna-\ntional Conference on Computer Vision (ICCV’98), pp. 754–760, Bombay.",
  "image_path": "page_904.jpg",
  "pages": [
    903,
    904,
    905
  ]
}