{
  "doc_id": "pages_930_932",
  "text": "908\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTabb, M. and Ahuja, N. (1997). Multiscale image segmentation by integrated edge and\nregion detection. IEEE Transactions on Image Processing, 6(5):642–655.\nTaguchi, Y., Wilburn, B., and Zitnick, C. L. (2008). Stereo reconstruction with mixed pixels\nusing adaptive over-segmentation. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nTanaka, M. and Okutomi, M. (2008). Locally adaptive learning for translation-variant MRF\nimage priors. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2008), Anchorage, AK.\nTao, H., Sawhney, H. S., and Kumar, R. (2001). A global matching framework for stereo\ncomputation. In Eighth International Conference on Computer Vision (ICCV 2001),\npp. 532–539, Vancouver, Canada.\nTappen, M. F. (2007). Utilizing variational optimization to learn Markov random ﬁelds.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.\nTappen, M. F. and Freeman, W. T. (2003). Comparison of graph cuts with belief propaga-\ntion for stereo, using identical MRF parameters. In Ninth International Conference on\nComputer Vision (ICCV 2003), pp. 900–907, Nice, France.\nTappen, M. F., Freeman, W. T., and Adelson, E. H. (2005). Recovering intrinsic images\nfrom a single image. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n27(9):1459–1472.\nTappen, M. F., Russell, B. C., and Freeman, W. T. (2003). Exploiting the sparse derivative\nprior for super-resolution and image demosaicing. In Third International Workshop on\nStatistical and Computational Theories of Vision, Nice, France.\nTappen, M. F., Liu, C., Freeman, W., and Adelson, E. (2007). Learning Gaussian con-\nditional random ﬁelds for low-level vision. In IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nTardif, J.-P. (2009). Non-iterative approach for fast and accurate vanishing point detection.\nIn Twelfth International Conference on Computer Vision (ICCV 2009), Kyoto, Japan.\nTardif, J.-P., Sturm, P., and Roy, S. (2007). Plane-based self-calibration of radial distortion.\nIn Eleventh International Conference on Computer Vision (ICCV 2007), Rio de Janeiro,\nBrazil.\nTardif, J.-P., Sturm, P., Trudeau, M., and Roy, S. (2009). Calibration of cameras with\nradially symmetric distortion. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 31(9):1552–1566.\nReferences\n909\nTaubin, G. (1995). Curve and surface smoothing without shrinkage. In Fifth International\nConference on Computer Vision (ICCV’95), pp. 852–857, Cambridge, Massachusetts.\nTaubman, D. S. and Marcellin, M. W. (2002). Jpeg2000: standard for interactive imaging.\nProceedings of the IEEE, 90(8):1336–1357.\nTaylor, C. J. (2003). Surface reconstruction from feature based stereo. In Ninth Interna-\ntional Conference on Computer Vision (ICCV 2003), pp. 184–190, Nice, France.\nTaylor, C. J., Debevec, P. E., and Malik, J. (1996). Reconstructing polyhedral models of\narchitectural scenes from photographs. In Fourth European Conference on Computer\nVision (ECCV’96), pp. 659–668, Cambridge, England.\nTaylor, C. J., Kriegman, D. J., and Anandan, P.\n(1991).\nStructure and motion in two\ndimensions from multiple images: A least squares approach. In IEEE Workshop on\nVisual Motion, pp. 242–248, Princeton, New Jersey.\nTaylor, P. (2009). Text-to-Speech Synthesis. Cambridge University Press, Cambridge.\nTek, K. and Kimia, B. B. (2003). Symmetry maps of free-form curve segments via wave\npropagation. International Journal of Computer Vision, 54(1-3):35–81.\nTekalp, M. (1995). Digital Video Processing. Prentice Hall, Upper Saddle River, NJ.\nTelea, A. (2004). An image inpainting technique based on fast marching method. Journal\nof Graphics Tools, 9(1):23–34.\nTeller, S., Antone, M., Bodnar, Z., Bosse, M., Coorg, S., Jethwa, M., and Master, N. (2003).\nCalibrated, registered images of an extended urban area. International Journal of Com-\nputer Vision, 53(1):93–107.\nTeodosio, L. and Bender, W. (1993). Salient video stills: Content and context preserved.\nIn ACM Multimedia 93, pp. 39–46, Anaheim, California.\nTerzopoulos, D. (1983). Multilevel computational processes for visual surface reconstruc-\ntion. Computer Vision, Graphics, and Image Processing, 24:52–96.\nTerzopoulos, D. (1986a). Image analysis using multigrid relaxation methods. IEEE Trans-\nactions on Pattern Analysis and Machine Intelligence, PAMI-8(2):129–139.\nTerzopoulos, D.\n(1986b).\nRegularization of inverse visual problems involving discon-\ntinuities.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, PAMI-\n8(4):413–424.\nTerzopoulos, D. (1988). The computation of visible-surface representations. IEEE Trans-\nactions on Pattern Analysis and Machine Intelligence, PAMI-10(4):417–438.\nTerzopoulos, D. (1999). Visual modeling for computer animation: Graphics with a vision.\nComputer Graphics, 33(4):42–45.\n910\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTerzopoulos, D. and Fleischer, K. (1988). Deformable models. The Visual Computer,\n4(6):306–331.\nTerzopoulos, D. and Metaxas, D. (1991). Dynamic 3D models with local and global de-\nformations: Deformable superquadrics. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 13(7):703–714.\nTerzopoulos, D. and Szeliski, R. (1992). Tracking with Kalman snakes. In Blake, A. and\nYuille, A. L. (eds), Active Vision, pp. 3–20, MIT Press, Cambridge, Massachusetts.\nTerzopoulos, D. and Waters, K.\n(1990).\nAnalysis of facial images using physical and\nanatomical models. In Third International Conference on Computer Vision (ICCV’90),\npp. 727–732, Osaka, Japan.\nTerzopoulos, D. and Witkin, A. (1988). Physically-based models with rigid and deformable\ncomponents. IEEE Computer Graphics and Applications, 8(6):41–51.\nTerzopoulos, D., Witkin, A., and Kass, M. (1987). Symmetry-seeking models and 3D\nobject reconstruction. International Journal of Computer Vision, 1(3):211–221.\nTerzopoulos, D., Witkin, A., and Kass, M. (1988). Constraints on deformable models:\nRecovering 3D shape and nonrigid motion. Artiﬁcial Intelligence, 36(1):91–123.\nThayananthan, A., Iwasaki, M., and Cipolla, R. (2008). Principled fusion of high-level\nmodel and low-level cues for motion segmentation. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nThirthala, S. and Pollefeys, M. (2005). The radial trifocal tensor: A tool for calibrating\nthe radial distortion of wide-angle cameras. In IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR’2005), pp. 321–328, San Diego, CA.\nThomas, D. B., Luk, W., Leong, P. H., and Villasenor, J. D. (2007). Gaussian random\nnumber generators. ACM Computing Surveys, 39(4).\nThrun, S., Burgard, W., and Fox, D. (2005). Probabilistic Robotics. The MIT Press,\nCambridge, Massachusetts.\nThrun, S., Montemerlo, M., Dahlkamp, H., Stavens, D., Aron, A. et al. (2006). Stanley, the\nrobot that won the DARPA Grand Challenge. Journal of Field Robotics, 23(9):661–692.\nTian, Q. and Huhns, M. N. (1986). Algorithms for subpixel registration. Computer Vision,\nGraphics, and Image Processing, 35:220–233.\nTikhonov, A. N. and Arsenin, V. Y. (1977). Solutions of Ill-Posed Problems. V. H. Winston,\nWashington, D. C.\nTipping, M. E. and Bishop, C. M. (1999). Probabilistic principal components analysis.\nJournal of the Royal Statistical Society, Series B, 61(3):611–622.",
  "image_path": "page_931.jpg",
  "pages": [
    930,
    931,
    932
  ]
}