{
  "doc_id": "pages_511_513",
  "text": "10.2 High dynamic range imaging\n489\nand added to the detail layer to produce the new log-luminance image\nI(x, y) = H′\nH(x, y) + HL(x, y),\n(10.16)\nwhich can then be exponentiated to produce the tone-mapped (compressed) luminance im-\nage. Note that this process is equivalent to dividing each luminance value by (a monotonic\nmapping of) the average log-luminance value in a region around that pixel.\nFigure 10.21 shows the low-pass and high-pass log luminance image and the resulting\ntone-mapped color image. Note how the detail layer has visible halos around the high-\ncontrast edges, which are visible in the ﬁnal tone-mapped image. This is because linear\nﬁltering, which is not edge preserving, produces halos in the detail layer (Figure 10.23).\nThe solution to this problem is to use an edge-preserving ﬁlter to create the base layer. Du-\nrand and Dorsey (2002) study a number of such edge-preserving ﬁlters, including anisotropic\nand robust anisotropic diffusion, and select bilateral ﬁltering (Section 3.3.1) as their edge-\npreserving ﬁlter. (A more recent paper by Farbman, Fattal, Lischinski et al. (2008) argues\nin favor of using a weighted least squares (WLF) ﬁlter as an alternative to the bilateral ﬁlter\nand Paris, Kornprobst, Tumblin et al. (2008) reviews bilateral ﬁltering and its applications\nin computer vision and computational photography.) Figure 10.22 shows how replacing the\nlinear low-pass ﬁlter with a bilateral ﬁlter produces tone-mapped images with no visible ha-\nlos. Figure 10.24 summarizes the complete information ﬂow in this process, starting with\nthe decomposition into log luminance and chrominance images, bilateral ﬁltering, contrast\nreduction, and re-composition into the ﬁnal output image.\nAn alternative to compressing the base layer is to compress its derivatives, i.e., the gra-\ndient of the log-luminance image (Fattal, Lischinski, and Werman 2002). Figure 10.25 illus-\ntrates this process. The log-luminance image is differentiated to obtain a gradient image\nH′(x, y) = ∇H(x, y).\n(10.17)\nThis gradient image is then attenuated by a spatially varying attenuation function Φ(x, y),\nG(x, y) = H′(x, y) Φ(x, y).\n(10.18)\nThe attenuation function I(x, y) is designed to attenuate large-scale brightness changes (Fig-\nure 10.26a) and is designed to take into account gradients at different spatial scales (Fattal,\nLischinski, and Werman 2002).\nAfter attenuation, the resulting gradient ﬁeld is re-integrated by solving a ﬁrst-order vari-\national (least squares) problem,\nmin\nZ Z\n∥∇I(x, y) −G(x, y)∥2dx dy\n(10.19)\n490\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\nFigure 10.21 Local tone mapping using linear ﬁlters: (a) low-pass and high-pass ﬁltered log\nluminance images and color (chrominance) image; (b) resulting tone-mapped image (after at-\ntenuating the low-pass log luminance image) shows visible halos around the trees. Processed\nimages courtesy of Fr´edo Durand, MIT 6.815/6.865 course on Computational Photography.\n(a)\n(b)\nFigure 10.22 Local tone mapping using bilateral ﬁlter (Durand and Dorsey 2002): (a) low-\npass and high-pass bilateral ﬁltered log luminance images and color (chrominance) image;\n(b) resulting tone-mapped image (after attenuating the low-pass log luminance image) shows\nno halos. Processed images courtesy of Fr´edo Durand, MIT 6.815/6.865 course on Compu-\ntational Photography.\n10.2 High dynamic range imaging\n491\nFigure 10.23 Gaussian vs. bilateral ﬁltering (Petschnigg, Agrawala, Hoppe et al. 2004) c⃝\n2004 ACM: A Gaussian low-pass ﬁlter blurs across all edges and therefore creates strong\npeaks and valleys in the detail image that cause halos. The bilateral ﬁlter does not smooth\nacross strong edges and thereby reduces halos while still capturing detail.\nFigure 10.24\nLocal tone mapping using bilateral ﬁlter (Durand and Dorsey 2002): sum-\nmary of algorithm workﬂow. Images courtesy of Fr´edo Durand, MIT 6.815/6.865 course on\nComputational Photography.",
  "image_path": "page_512.jpg",
  "pages": [
    511,
    512,
    513
  ]
}