{
  "doc_id": "pages_005_007",
  "text": "8 Dense motion estimation\n381\nTranslational alignment • Parametric motion •\nSpline-based motion • Optical ﬂow •\nLayered motion\n9 Image stitching\n427\nMotion models • Global alignment •\nCompositing\n10 Computational photography\n467\nPhotometric calibration • High dynamic range imaging •\nSuper-resolution and blur removal •\nImage matting and compositing •\nTexture analysis and synthesis\n11 Stereo correspondence\n533\nEpipolar geometry • Sparse correspondence •\nDense correspondence • Local methods •\nGlobal optimization • Multi-view stereo\n12 3D reconstruction\n577\nShape from X • Active rangeﬁnding •\nSurface representations • Point-based representations •\nVolumetric representations • Model-based reconstruction •\nRecovering texture maps and albedos\n13 Image-based rendering\n619\nView interpolation • Layered depth images •\nLight ﬁelds and Lumigraphs • Environment mattes •\nVideo-based rendering\n14 Recognition\n655\nObject detection • Face recognition •\nInstance recognition • Category recognition •\nContext and scene understanding •\nRecognition databases and test sets\n\nPreface\nThe seeds for this book were ﬁrst planted in 2001 when Steve Seitz at the University of Wash-\nington invited me to co-teach a course called “Computer Vision for Computer Graphics”. At\nthat time, computer vision techniques were increasingly being used in computer graphics to\ncreate image-based models of real-world objects, to create visual effects, and to merge real-\nworld imagery using computational photography techniques. Our decision to focus on the\napplications of computer vision to fun problems such as image stitching and photo-based 3D\nmodeling from personal photos seemed to resonate well with our students.\nSince that time, a similar syllabus and project-oriented course structure has been used to\nteach general computer vision courses both at the University of Washington and at Stanford.\n(The latter was a course I co-taught with David Fleet in 2003.) Similar curricula have been\nadopted at a number of other universities and also incorporated into more specialized courses\non computational photography. (For ideas on how to use this book in your own course, please\nsee Table 1.1 in Section 1.4.)\nThis book also reﬂects my 20 years’ experience doing computer vision research in corpo-\nrate research labs, mostly at Digital Equipment Corporation’s Cambridge Research Lab and\nat Microsoft Research. In pursuing my work, I have mostly focused on problems and solu-\ntion techniques (algorithms) that have practical real-world applications and that work well in\npractice. Thus, this book has more emphasis on basic techniques that work under real-world\nconditions and less on more esoteric mathematics that has intrinsic elegance but less practical\napplicability.\nThis book is suitable for teaching a senior-level undergraduate course in computer vision\nto students in both computer science and electrical engineering. I prefer students to have\neither an image processing or a computer graphics course as a prerequisite so that they can\nspend less time learning general background mathematics and more time studying computer\nvision techniques. The book is also suitable for teaching graduate-level courses in computer\nvision (by delving into the more demanding application and algorithmic areas) and as a gen-\neral reference to fundamental techniques and the recent research literature. To this end, I have\nattempted wherever possible to at least cite the newest research in each sub-ﬁeld, even if the",
  "image_path": "page_006.jpg",
  "pages": [
    5,
    6,
    7
  ]
}