{
  "doc_id": "pages_862_864",
  "text": "840\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nHershberger, J. and Snoeyink, J.\n(1992).\nSpeeding Up the Douglas-Peucker Line-\nSimpliﬁcation Algorithm. Technical Report TR-92-07, Computer Science Department,\nThe University of British Columbia.\nHertzmann, A., Jacobs, C. E., Oliver, N., Curless, B., and Salesin, D. H. (2001). Image\nanalogies. In ACM SIGGRAPH 2001 Conference Proceedings, pp. 327–340.\nHiep, V. H., Keriven, R., Pons, J.-P., and Labatut, P. (2009). Towards high-resolution large-\nscale multi-view stereo. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR 2009), Miami Beach, FL.\nHillman, P., Hannah, J., and Renshaw, D. (2001). Alpha channel estimation in high resolu-\ntion images and image sequences. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR’2001), pp. 1063–1068, Kauai, Hawaii.\nHilton, A., Fua, P., and Ronfard, R. (2006). Modeling people: Vision-based understanding\nof a person’s shape, appearance, movement, and behaviour. Computer Vision and Image\nUnderstanding, 104(2-3):87–89.\nHilton, A., Stoddart, A. J., Illingworth, J., and Windeatt, T. (1996). Reliable surface re-\nconstruction from multiple range images. In Fourth European Conference on Computer\nVision (ECCV’96), pp. 117–126, Cambridge, England.\nHinckley, K., Sinclair, M., Hanson, E., Szeliski, R., and Conway, M. (1999). The Video-\nMouse: a camera-based multi-degree-of-freedom input device. In 12th annual ACM\nsymposium on User interface software and technology, pp. 103–112.\nHinterstoisser, S., Benhimane, S., Navab, N., Fua, P., and Lepetit, V.\n(2008).\nOnline\nlearning of patch perspective rectiﬁcation for efﬁcient object detection. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR 2008),\nAnchorage, AK.\nHinton, G. E. (1977). Relaxation and its Role in Vision. Ph.D. thesis, University of Edin-\nburgh.\nHirschm¨uller, H. (2008). Stereo processing by semiglobal matching and mutual informa-\ntion. IEEE Transactions on Pattern Analysis and Machine Intelligence, 30(2):328–341.\nHirschm¨uller, H. and Scharstein, D. (2009). Evaluation of stereo matching costs on im-\nages with radiometric differences. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 31(9):1582–1599.\nHjaltason, G. R. and Samet, H. (2003). Index-driven similarity search in metric spaces.\nACM Transactions on Database Systems, 28(4):517–580.\nHofmann, T. (1999). Probabilistic latent semantic indexing. In ACM SIGIR Conference on\nResearch and Development in Informaion Retrieval, pp. 50–57, Berkeley, CA.\nReferences\n841\nHogg, D. (1983). Model-based vision: A program to see a walking person. Image and\nVision Computing, 1(1):5–20.\nHoiem, D., Efros, A. A., and Hebert, M. (2005a). Automatic photo pop-up. ACM Transac-\ntions on Graphics (Proc. SIGGRAPH 2005), 24(3):577–584.\nHoiem, D., Efros, A. A., and Hebert, M. (2005b). Geometric context from a single im-\nage. In Tenth International Conference on Computer Vision (ICCV 2005), pp. 654–661,\nBeijing, China.\nHoiem, D., Efros, A. A., and Hebert, M. (2008a). Closing the loop in scene interpretation.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2008), Anchorage, AK.\nHoiem, D., Efros, A. A., and Hebert, M. (2008b). Putting objects in perspective. Interna-\ntional Journal of Computer Vision, 80(1):3–15.\nHoiem, D., Rother, C., and Winn, J. (2007). 3D LayoutCRF for multi-view object class\nrecognition and segmentation. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nHoover, A., Jean-Baptiste, G., Jiang, X., Flynn, P. J., Bunke, H. et al. (1996). An exper-\nimental comparison of range image segmentation algorithms. IEEE Transactions on\nPattern Analysis and Machine Intelligence, 18(7):673–689.\nHoppe, H. (1996). Progressive meshes. In ACM SIGGRAPH 1996 Conference Proceed-\nings, pp. 99–108, New Orleans.\nHoppe, H., DeRose, T., Duchamp, T., McDonald, J., and Stuetzle, W.\n(1992).\nSur-\nface reconstruction from unorganized points. Computer Graphics (SIGGRAPH ’92),\n26(2):71–78.\nHorn, B. K. P. (1974). Determining lightness from an image. Computer Graphics and\nImage Processing, 3(1):277–299.\nHorn, B. K. P. (1975). Obtaining shape from shading information. In Winston, P. H. (ed.),\nThe Psychology of Computer Vision, pp. 115–155, McGraw-Hill, New York.\nHorn, B. K. P. (1977). Understanding image intensities. Artiﬁcial Intelligence, 8(2):201–\n231.\nHorn, B. K. P. (1986). Robot Vision. MIT Press, Cambridge, Massachusetts.\nHorn, B. K. P. (1987). Closed-form solution of absolute orientation using unit quaternions.\nJournal of the Optical Society of America A, 4(4):629–642.\nHorn, B. K. P. (1990). Height and gradient from shading. International Journal of Com-\nputer Vision, 5(1):37–75.\n842\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nHorn, B. K. P. and Brooks, M. J. (1986). The variational approach to shape from shading.\nComputer Vision, Graphics, and Image Processing, 33:174–208.\nHorn, B. K. P. and Brooks, M. J. (eds). (1989). Shape from Shading, MIT Press, Cam-\nbridge, Massachusetts.\nHorn, B. K. P. and Schunck, B. G. (1981). Determining optical ﬂow. Artiﬁcial Intelligence,\n17:185–203.\nHorn, B. K. P. and Weldon Jr., E. J. (1988). Direct methods for recovering motion. Inter-\nnational Journal of Computer Vision, 2(1):51–76.\nHornung, A., Zeng, B., and Kobbelt, L.\n(2008).\nImage selection for improved multi-\nview stereo. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2008), Anchorage, AK.\nHorowitz, S. L. and Pavlidis, T. (1976). Picture segmentation by a tree traversal algorithm.\nJournal of the ACM, 23(2):368–388.\nHorry, Y., Anjyo, K.-I., and Arai, K. (1997). Tour into the picture: Using a spidery mesh\ninterface to make animation from a single image. In ACM SIGGRAPH 1997 Conference\nProceedings, pp. 225–232.\nHough, P. V. C. (1962). Method and means for recognizing complex patterns. U. S. Patent,\n3,069,654.\nHouhou, N., Thiran, J.-P., and Bresson, X. (2008). Fast texture segmentation using the\nshape operator and active contour. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nHowe, N. R., Leventon, M. E., and Freeman, W. T. (2000). Bayesian reconstruction of 3D\nhuman motion from single-camera video. In Advances in Neural Information Process-\ning Systems.\nHsieh, Y. C., McKeown, D., and Perlant, F. P. (1992). Performance evaluation of scene\nregistration and stereo matching for cartographic feature extraction. IEEE Transactions\non Pattern Analysis and Machine Intelligence, 14(2):214–238.\nHu, W., Tan, T., Wang, L., and Maybank, S. (2004). A survey on visual surveillance of\nobject motion and behaviors. IEEE Transactions on Systems, Man, and Cybernetics,\nPart C: Applications and Reviews, 34(3):334–352.\nHua, G., Brown, M., and Winder, S. (2007). Discriminant embedding for local image\ndescriptors. In Eleventh International Conference on Computer Vision (ICCV 2007),\nRio de Janeiro, Brazil.",
  "image_path": "page_863.jpg",
  "pages": [
    862,
    863,
    864
  ]
}