{
  "doc_id": "pages_174_176",
  "text": "152\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n¼\n⅜\n¼\n16\n1\n16\n1\n¼\n⅜\n¼\n16\n1\n16\n1\n½\n¾\n½\n½\n¾\n½\n⅛\n⅛\n⅛\n⅛\n(a)\n(b)\nFigure 3.33 The Gaussian pyramid shown as a signal processing diagram: The (a) analysis\nand (b) re-synthesis stages are shown as using similar computations. The white circles in-\ndicate zero values inserted by the ↑2 upsampling operation. Notice how the reconstruction\nﬁlter coefﬁcients are twice the analysis coefﬁcients. The computation is shown as ﬂowing\ndown the page, regardless of whether we are going from coarse to ﬁne or vice versa.\naliasing, since it avoids one downsampling and upsampling round-trip, but it is not self-\ninverting, since the Laplacian images are no longer adequate to reproduce the original image.\nAs with the Gaussian pyramid, the term Laplacian is a bit of a misnomer, since their\nband-pass images are really differences of (approximate) Gaussians, or DoGs,\nDoG{I; σ1, σ2} = Gσ1 ∗I −Gσ2 ∗I = (Gσ1 −Gσ2) ∗I.\n(3.84)\nA Laplacian of Gaussian (which we saw in (3.26)) is actually its second derivative,\nLoG{I; σ} = ∇2(Gσ ∗I) = (∇2Gσ) ∗I,\n(3.85)\nwhere\n∇2 = ∂2\n∂x2 + ∂2\n∂y2\n(3.86)\nis the Laplacian (operator) of a function. Figure 3.35 shows how the Differences of Gaussian\nand Laplacians of Gaussian look in both space and frequency.\nLaplacians of Gaussian have elegant mathematical properties, which have been widely\nstudied in the scale-space community (Witkin 1983; Witkin, Terzopoulos, and Kass 1986;\nLindeberg 1990; Nielsen, Florack, and Deriche 1997) and can be used for a variety of appli-\ncations including edge detection (Marr and Hildreth 1980; Perona and Malik 1990b), stereo\nmatching (Witkin, Terzopoulos, and Kass 1987), and image enhancement (Nielsen, Florack,\nand Deriche 1997).\nA less widely used variant is half-octave pyramids, shown in Figure 3.36a. These were\nﬁrst introduced to the vision community by Crowley and Stern (1984), who call them Dif-\nference of Low-Pass (DOLP) transforms. Because of the small scale change between adja-\n3.5 Pyramids and wavelets\n153\nH\nL\n↓2\nH0\nH\nL\n↓2\nL1\nH1\nL2\nQ\nF\nI\n↑2\nF\nI\n↑2\nQ\nQ\nH0\nL1\nH1\nL2\nI\nO\n(a)\nL\n↓2\nH0\nL1\nQ\nI\n↑2\nH0\nL1\nI\n↑2\n–\n(b)\nFigure 3.34 The Laplacian pyramid: (a) The conceptual ﬂow of images through processing\nstages: images are high-pass and low-pass ﬁltered, and the low-pass ﬁltered images are pro-\ncessed in the next stage of the pyramid. During reconstruction, the interpolated image and the\n(optionally ﬁltered) high-pass image are added back together. The Q box indicates quantiza-\ntion or some other pyramid processing, e.g., noise removal by coring (setting small wavelet\nvalues to 0). (b) The actual computation of the high-pass ﬁlter involves ﬁrst interpolating the\ndownsampled low-pass image and then subtracting it. This results in perfect reconstruction\nwhen Q is the identity. The high-pass (or band-pass) images are typically called Laplacian\nimages, while the low-pass images are called Gaussian images.\n154\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nspace:\n−\n=\nfrequency:\n−\n=\nlow-pass\nlower-pass\nFigure 3.35 The difference of two low-pass ﬁlters results in a band-pass ﬁlter. The dashed\nblue lines show the close ﬁt to a half-octave Laplacian of Gaussian.\ncent levels, the authors claim that coarse-to-ﬁne algorithms perform better. In the image-\nprocessing community, half-octave pyramids combined with checkerboard sampling grids\nare known as quincunx sampling (Feilner, Van De Ville, and Unser 2005). In detecting multi-\nscale features (Section 4.1.1), it is often common to use half-octave or even quarter-octave\npyramids (Lowe 2004; Triggs 2004). However, in this case, the subsampling only occurs\nat every octave level, i.e., the image is repeatedly blurred with wider Gaussians until a full\noctave of resolution change has been achieved (Figure 4.11).\n3.5.4 Wavelets\nWhile pyramids are used extensively in computer vision applications, some people use wavelet\ndecompositions as an alternative. Wavelets are ﬁlters that localize a signal in both space\nand frequency (like the Gabor ﬁlter in Table 3.2) and are deﬁned over a hierarchy of scales.\nWavelets provide a smooth way to decompose a signal into frequency components without\nblocking and are closely related to pyramids.\nWavelets were originally developed in the applied math and signal processing communi-\nties and were introduced to the computer vision community by Mallat (1989). Strang (1989);\nSimoncelli and Adelson (1990b); Rioul and Vetterli (1991); Chui (1992); Meyer (1993) all\nprovide nice introductions to the subject along with historical reviews, while Chui (1992) pro-\nvides a more comprehensive review and survey of applications. Sweldens (1997) describes\nthe more recent lifting approach to wavelets that we discuss shortly.\nWavelets are widely used in the computer graphics community to perform multi-resolution\ngeometric processing (Stollnitz, DeRose, and Salesin 1996) and have also been used in com-\nputer vision for similar applications (Szeliski 1990b; Pentland 1994; Gortler and Cohen 1995;\nYaou and Chang 1994; Lai and Vemuri 1997; Szeliski 2006b), as well as for multi-scale ori-\nented ﬁltering (Simoncelli, Freeman, Adelson et al. 1992) and denoising (Portilla, Strela,",
  "image_path": "page_175.jpg",
  "pages": [
    174,
    175,
    176
  ]
}