{
  "doc_id": "pages_184_186",
  "text": "162\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\nFigure 3.43 Laplacian pyramid blend of two images of arbitrary shape (Burt and Adelson\n1983b) c⃝1983 ACM: (a) ﬁrst input image; (b) second input image; (c) region mask; (d)\nblended image.\nmultiplied by its corresponding Gaussian mask and the sum of these two weighted pyramids\nis then used to construct the ﬁnal image (Figure 3.42, right column).\nFigure 3.43 shows that this process can be applied to arbitrary mask images with sur-\nprising results. It is also straightforward to extend the pyramid blend to an arbitrary number\nof images whose pixel provenance is indicated by an integer-valued label image (see Exer-\ncise 3.20). This is particularly useful in image stitching and compositing applications, where\nthe exposures may vary between different images, as described in Section 9.3.4.\n3.6 Geometric transformations\nIn the previous sections, we saw how interpolation and decimation could be used to change\nthe resolution of an image. In this section, we look at how to perform more general transfor-\nmations, such as image rotations or general warps. In contrast to the point processes we saw\nin Section 3.1, where the function applied to an image transforms the range of the image,\ng(x) = h(f(x)),\n(3.87)\n3.6 Geometric transformations\n163\nf\nx\nh\nf\nf\ng\nh\ng\nh\nh\ng\nx\nf\nx\ng\nx\nFigure 3.44 Image warping involves modifying the domain of an image function rather than\nits range.\ny\nx\nsimilarity\nEuclidean\naffine\nprojective\ntranslation\nFigure 3.45 Basic set of 2D geometric image transformations.\nhere we look at functions that transform the domain,\ng(x) = f(h(x))\n(3.88)\n(see Figure 3.44).\nWe begin by studying the global parametric 2D transformation ﬁrst introduced in Sec-\ntion 2.1.2. (Such a transformation is called parametric because it is controlled by a small\nnumber of parameters.) We then turn our attention to more local general deformations such as\nthose deﬁned on meshes (Section 3.6.2). Finally, we show how image warps can be combined\nwith cross-dissolves to create interesting morphs (in-between animations) in Section 3.6.3.\nFor readers interested in more details on these topics, there is an excellent survey by Heck-\nbert (1986) as well as very accessible textbooks by Wolberg (1990), Gomes, Darsa, Costa\net al. (1999) and Akenine-M¨oller and Haines (2002). Note that Heckbert’s survey is on tex-\nture mapping, which is how the computer graphics community refers to the topic of warping\nimages onto surfaces.\n3.6.1 Parametric transformations\nParametric transformations apply a global deformation to an image, where the behavior of the\ntransformation is controlled by a small number of parameters. Figure 3.45 shows a few ex-\n164\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTransformation\nMatrix\n# DoF\nPreserves\nIcon\ntranslation\nh\nI\nt\ni\n2×3\n2\norientation\nrigid (Euclidean)\nh\nR\nt\ni\n2×3\n3\nlengths\n\u001a\n\u001a\n\u001a\u001a\nS\nS S\nS\nsimilarity\nh\nsR\nt\ni\n2×3\n4\nangles\n\u001a\n\u001a\nS S\nafﬁne\nh\nA\ni\n2×3\n6\nparallelism\n\u0002\u0002\n\u0002\u0002\nprojective\nh\n˜\nH\ni\n3×3\n8\nstraight lines\n``\n  \nTable 3.5 Hierarchy of 2D coordinate transformations. Each transformation also preserves\nthe properties listed in the rows below it, i.e., similarity preserves not only angles but also\nparallelism and straight lines. The 2×3 matrices are extended with a third [0T 1] row to form\na full 3 × 3 matrix for homogeneous coordinate transformations.\namples of such transformations, which are based on the 2D geometric transformations shown\nin Figure 2.4. The formulas for these transformations were originally given in Table 2.1 and\nare reproduced here in Table 3.5 for ease of reference.\nIn general, given a transformation speciﬁed by a formula x′ = h(x) and a source image\nf(x), how do we compute the values of the pixels in the new image g(x), as given in (3.88)?\nThink about this for a minute before proceeding and see if you can ﬁgure it out.\nIf you are like most people, you will come up with an algorithm that looks something like\nAlgorithm 3.1. This process is called forward warping or forward mapping and is shown in\nFigure 3.46a. Can you think of any problems with this approach?\nprocedure forwardWarp(f, h, out g):\nFor every pixel x in f(x)\n1. Compute the destination location x′ = h(x).\n2. Copy the pixel f(x) to g(x′).\nAlgorithm 3.1\nForward warping algorithm for transforming an image f(x) into an image\ng(x′) through the parametric transform x′ = h(x).",
  "image_path": "page_185.jpg",
  "pages": [
    184,
    185,
    186
  ]
}