{
  "doc_id": "pages_605_607",
  "text": "12.1 Shape from X\n583\nCamera\nScene\nMirror surface \nc\nEstimate tangent planes\nScene Pattern\n(a)\n(b)\n(c)\n(d)\nFigure 12.3\nSynthetic shape from texture (Garding 1992) c⃝1992 Springer:\n(a) regular\ntexture wrapped onto a curved surface and (b) the corresponding surface normal estimates.\nShape from mirror reﬂections (Savarese, Chen, and Perona 2005) c⃝2005 Springer: (c) a\nregular pattern reﬂecting off a curved mirror gives rise to (d) curved lines, from which 3D\npoint locations and normals can be inferred.\nWhen surfaces are specular, more than three light directions may be required. In fact,\nthe irradiance equation given in (12.1) not only requires that the light sources and camera be\ndistant from the surface, it also neglects inter-reﬂections, which can be a signiﬁcant source\nof the shading observed on object surfaces, e.g., the darkening seen inside concave structures\nsuch as grooves and crevasses (Nayar, Ikeuchi, and Kanade 1991).\n12.1.2 Shape from texture\nThe variation in foreshortening observed in regular textures can also provide useful informa-\ntion about local surface orientation. Figure 12.3 shows an example of such a pattern, along\nwith the estimated local surface orientations. Shape from texture algorithms require a number\nof processing steps, including the extraction of repeated patterns or the measurement of local\nfrequencies in order to compute local afﬁne deformations, and a subsequent stage to infer lo-\ncal surface orientation. Details on these various stages can be found in the research literature\n(Witkin 1981; Ikeuchi 1981; Blostein and Ahuja 1987; Garding 1992; Malik and Rosenholtz\n1997; Lobay and Forsyth 2006).\nWhen the original pattern is regular, it is possible to ﬁt a regular but slightly deformed\ngrid to the image and use this grid for a variety of image replacement or analysis tasks (Liu,\nCollins, and Tsin 2004; Liu, Lin, and Hays 2004; Hays, Leordeanu, Efros et al. 2006; Lin,\nHays, Wu et al. 2006; Park, Brocklehurst, Collins et al. 2009). This process becomes even\neasier if specially printed textured cloth patterns are used (White and Forsyth 2006; White,\nCrane, and Forsyth 2007).\nThe deformations induced in a regular pattern when it is viewed in the reﬂection of a\ncurved mirror, as shown in Figure 12.3c–d, can be used to recover the shape of the surface\n584\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\nFigure 12.4 Real time depth from defocus (Nayar, Watanabe, and Noguchi 1996) c⃝1996\nIEEE: (a) the real-time focus range sensor, which includes a half-silvered mirror between the\ntwo telecentric lenses (lower right), a prism that splits the image into two CCD sensors (lower\nleft), and an edged checkerboard pattern illuminated by a Xenon lamp (top); (b–c) input video\nframes from the two cameras along with (d) the corresponding depth map; (e–f) two frames\n(you can see the texture if you zoom in) and (g) the corresponding 3D mesh model.\n(Savarese, Chen, and Perona 2005; Rozenfeld, Shimshoni, and Lindenbaum 2007). It is is\nalso possible to infer local shape information from specular ﬂow, i.e., the motion of specu-\nlarities when viewed from a moving camera (Oren and Nayar 1997; Zisserman, Giblin, and\nBlake 1989; Swaminathan, Kang, Szeliski et al. 2002).\n12.1.3 Shape from focus\nA strong cue for object depth is the amount of blur, which increases as the object’s surface\nmoves away from the camera’s focusing distance. As shown in Figure 2.19, moving the object\nsurface away from the focus plane increases the circle of confusion, according to a formula\nthat is easy to establish using similar triangles (Exercise 2.4).\nA number of techniques have been developed to estimate depth from the amount of de-\nfocus (depth from defocus) (Pentland 1987; Nayar and Nakagawa 1994; Nayar, Watanabe,\nand Noguchi 1996; Watanabe and Nayar 1998; Chaudhuri and Rajagopalan 1999; Favaro\nand Soatto 2006). In order to make such a technique practical, a number issues need to be\naddressed:\n• The amount of blur increase in both directions as you move away from the focus plane.\nTherefore, it is necessary to use two or more images captured with different focus\n12.2 Active rangeﬁnding\n585\nSurface\nCCD\nLaser\n(a)\nDirection of travel\nObject\nCCD\nCCD image\n    plane\nLaser\nCylindrical lens\nLaser \nsheet\nσz\nσx\n(b)\n(c)\n(d)\nFigure 12.5 Range data scanning (Curless and Levoy 1996) c⃝1996 ACM: (a) a laser dot\non a surface is imaged by a CCD sensor; (b) a laser stripe (sheet) is imaged by the sensor (the\ndeformation of the stripe encodes the distance to the object); (c) the resulting set of 3D points\nare turned into (d) a triangulated mesh.\ndistance settings (Pentland 1987; Nayar, Watanabe, and Noguchi 1996) or to translate\nthe object in depth and look for the point of maximum sharpness (Nayar and Nakagawa\n1994).\n• The magniﬁcation of the object can vary as the focus distance is changed or the object is\nmoved. This can be modeled either explicitly (making correspondence more difﬁcult)\nor using telecentric optics, which approximate an orthographic camera and require an\naperture in front of the lens (Nayar, Watanabe, and Noguchi 1996).\n• The amount of defocus must be reliably estimated. A simple approach is to average the\nsquared gradient in a region but this suffers from several problems, including the image\nmagniﬁcation problem mentioned above. A better solution is to use carefully designed\nrational ﬁlters (Watanabe and Nayar 1998).\nFigure 12.4 shows an example of a real-time depth from defocus sensor, which employs\ntwo imaging chips at slightly different depths sharing a common optical path, as well as an\nactive illumination system that projects a checkerboard pattern from the same direction. As\nyou can see in Figure 12.4b–g, the system produces high-accuracy real-time depth maps for\nboth static and dynamic scenes.\n12.2 Active rangeﬁnding\nAs we have seen in the previous section, actively lighting a scene, whether for the purpose\nof estimating normals using photometric stereo or for adding artiﬁcial texture for shape from\ndefocus, can greatly improve the performance of vision systems. This kind of active illu-\nmination has been used from the earliest days of machine vision to construct highly reliable",
  "image_path": "page_606.jpg",
  "pages": [
    605,
    606,
    607
  ]
}