{
  "doc_id": "pages_029_031",
  "text": "1.1 What is computer vision?\n7\n• Motion capture (mocap): using retro-reﬂective markers viewed from multiple cam-\neras or other vision-based techniques to capture actors for computer animation;\n• Surveillance: monitoring for intruders, analyzing highway trafﬁc (Figure 1.4f), and\nmonitoring pools for drowning victims;\n• Fingerprint recognition and biometrics: for automatic access authentication as well\nas forensic applications.\nDavid Lowe’s Web site of industrial vision applications (http://www.cs.ubc.ca/spider/lowe/\nvision.html) lists many other interesting industrial applications of computer vision. While the\nabove applications are all extremely important, they mostly pertain to fairly specialized kinds\nof imagery and narrow domains.\nIn this book, we focus more on broader consumer-level applications, such as fun things\nyou can do with your own personal photographs and video. These include:\n• Stitching: turning overlapping photos into a single seamlessly stitched panorama (Fig-\nure 1.5a), as described in Chapter 9;\n• Exposure bracketing: merging multiple exposures taken under challenging lighting\nconditions (strong sunlight and shadows) into a single perfectly exposed image (Fig-\nure 1.5b), as described in Section 10.2;\n• Morphing: turning a picture of one of your friends into another, using a seamless\nmorph transition (Figure 1.5c);\n• 3D modeling: converting one or more snapshots into a 3D model of the object or\nperson you are photographing (Figure 1.5d), as described in Section 12.6\n• Video match move and stabilization: inserting 2D pictures or 3D models into your\nvideos by automatically tracking nearby reference points (see Section 7.4.2)3 or using\nmotion estimates to remove shake from your videos (see Section 8.2.1);\n• Photo-based walkthroughs: navigating a large collection of photographs, such as the\ninterior of your house, by ﬂying between different photos in 3D (see Sections 13.1.2\nand 13.5.5)\n• Face detection: for improved camera focusing as well as more relevant image search-\ning (see Section 14.1.1);\n• Visual authentication: automatically logging family members onto your home com-\nputer as they sit down in front of the webcam (see Section 14.2).\n8\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\nFigure 1.5\nSome consumer applications of computer vision: (a) image stitching: merging\ndifferent views (Szeliski and Shum 1997) c⃝1997 ACM; (b) exposure bracketing: merging\ndifferent exposures; (c) morphing: blending between two photographs (Gomes, Darsa, Costa\net al. 1999) c⃝1999 Morgan Kaufmann; (d) turning a collection of photographs into a 3D\nmodel (Sinha, Steedly, Szeliski et al. 2008) c⃝2008 ACM.\n1.1 What is computer vision?\n9\nThe great thing about these applications is that they are already familiar to most students;\nthey are, at least, technologies that students can immediately appreciate and use with their\nown personal media. Since computer vision is a challenging topic, given the wide range\nof mathematics being covered4 and the intrinsically difﬁcult nature of the problems being\nsolved, having fun and relevant problems to work on can be highly motivating and inspiring.\nThe other major reason why this book has a strong focus on applications is that they can\nbe used to formulate and constrain the potentially open-ended problems endemic in vision.\nFor example, if someone comes to me and asks for a good edge detector, my ﬁrst question is\nusually to ask why? What kind of problem are they trying to solve and why do they believe\nthat edge detection is an important component? If they are trying to locate faces, I usually\npoint out that most successful face detectors use a combination of skin color detection (Exer-\ncise 2.8) and simple blob features Section 14.1.1; they do not rely on edge detection. If they\nare trying to match door and window edges in a building for the purpose of 3D reconstruction,\nI tell them that edges are a ﬁne idea but it is better to tune the edge detector for long edges\n(see Sections 3.2.3 and 4.2) and link them together into straight lines with common vanishing\npoints before matching (see Section 4.3).\nThus, it is better to think back from the problem at hand to suitable techniques, rather\nthan to grab the ﬁrst technique that you may have heard of. This kind of working back from\nproblems to solutions is typical of an engineering approach to the study of vision and reﬂects\nmy own background in the ﬁeld. First, I come up with a detailed problem deﬁnition and\ndecide on the constraints and speciﬁcations for the problem. Then, I try to ﬁnd out which\ntechniques are known to work, implement a few of these, evaluate their performance, and\nﬁnally make a selection. In order for this process to work, it is important to have realistic test\ndata, both synthetic, which can be used to verify correctness and analyze noise sensitivity,\nand real-world data typical of the way the system will ﬁnally be used.\nHowever, this book is not just an engineering text (a source of recipes). It also takes a\nscientiﬁc approach to basic vision problems. Here, I try to come up with the best possible\nmodels of the physics of the system at hand: how the scene is created, how light interacts\nwith the scene and atmospheric effects, and how the sensors work, including sources of noise\nand uncertainty. The task is then to try to invert the acquisition process to come up with the\nbest possible description of the scene.\nThe book often uses a statistical approach to formulating and solving computer vision\nproblems. Where appropriate, probability distributions are used to model the scene and the\nnoisy image acquisition process. The association of prior distributions with unknowns is often\n3 For a fun student project on this topic, see the “PhotoBook” project at http://www.cc.gatech.edu/dvfx/videos/\ndvfx2005.html.\n4 These techniques include physics, Euclidean and projective geometry, statistics, and optimization. They make\ncomputer vision a fascinating ﬁeld to study and a great way to learn techniques widely applicable in other ﬁelds.",
  "image_path": "page_030.jpg",
  "pages": [
    29,
    30,
    31
  ]
}