{
  "doc_id": "pages_339_341",
  "text": "6.1 2D and 3D feature-based alignment\n317\nOne way to compensate for this is to reweight each equation by the inverse of the current\nestimate of the denominator, D,\n1\nD\n\"\nˆx′ −x\nˆy′ −y\n#\n= 1\nD\n\"\nx\ny\n1\n0\n0\n0\n−ˆx′x\n−ˆx′y\n0\n0\n0\nx\ny\n1\n−ˆy′x\n−ˆy′y\n#\n\n\nh00\n...\nh21\n\n.\n(6.22)\nWhile this may at ﬁrst seem to be the exact same set of equations as (6.21), because least\nsquares is being used to solve the over-determined set of equations, the weightings do matter\nand produce a different set of normal equations that performs better in practice.\nThe most principled way to do the estimation, however, is to directly minimize the squared\nresidual equations (6.13) using the Gauss–Newton approximation, i.e., performing a ﬁrst-\norder Taylor series expansion in p, as shown in (6.14), which yields the set of equations\n\"\nˆx′ −˜x′\nˆy′ −˜y′\n#\n= 1\nD\n\"\nx\ny\n1\n0\n0\n0\n−˜x′x\n−˜x′y\n0\n0\n0\nx\ny\n1\n−˜y′x\n−˜y′y\n#\n\n\n∆h00\n...\n∆h21\n\n.\n(6.23)\nWhile these look similar to (6.22), they differ in two important respects. First, the left hand\nside consists of unweighted prediction errors rather than point displacements and the solution\nvector is a perturbation to the parameter vector p. Second, the quantities inside J involve\npredicted feature locations (˜x′, ˜y′) instead of sensed feature locations (ˆx′, ˆy′). Both of these\ndifferences are subtle and yet they lead to an algorithm that, when combined with proper\nchecking for downhill steps (as in the Levenberg–Marquardt algorithm), will converge to a\nlocal minimum. Note that iterating Equations (6.22) is not guaranteed to converge, since it is\nnot minimizing a well-deﬁned energy function.\nEquation (6.23) is analogous to the additive algorithm for direct intensity-based regis-\ntration (Section 8.2), since the change to the full transformation is being computed. If we\nprepend an incremental homography to the current homography instead, i.e., we use a com-\npositional algorithm (described in Section 8.2), we get D = 1 (since p = 0) and the above\nformula simpliﬁes to\n\"\nˆx′ −x\nˆy′ −y\n#\n=\n\"\nx\ny\n1\n0\n0\n0\n−x2\n−xy\n0\n0\n0\nx\ny\n1\n−xy\n−y2\n#\n\n\n∆h00\n...\n∆h21\n\n,\n(6.24)\nwhere we have replaced (˜x′, ˜y′) with (x, y) for conciseness. (Notice how this results in the\nsame Jacobian as (8.63).)\nlinear transform, but that term is more commonly associated with pose estimation (Section 6.2). Note also that our\ndeﬁnition of the hij parameters differs from that used in their book, since we deﬁne hii to be the difference from\nunity and we do not leave h22 as a free parameter, which means that we cannot handle certain extreme homographies.\n318\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n6.1.4 Robust least squares and RANSAC\nWhile regular least squares is the method of choice for measurements where the noise follows\na normal (Gaussian) distribution, more robust versions of least squares are required when\nthere are outliers among the correspondences (as there almost always are). In this case, it is\npreferable to use an M-estimator (Huber 1981; Hampel, Ronchetti, Rousseeuw et al. 1986;\nBlack and Rangarajan 1996; Stewart 1999), which involves applying a robust penalty function\nρ(r) to the residuals\nERLS(∆p) =\nX\ni\nρ(∥ri∥)\n(6.25)\ninstead of squaring them.\nWe can take the derivative of this function with respect to p and set it to 0,\nX\ni\nψ(∥ri∥)∂∥ri∥\n∂p\n=\nX\ni\nψ(∥ri∥)\n∥ri∥\nrT\ni\n∂ri\n∂p = 0,\n(6.26)\nwhere ψ(r) = ρ′(r) is the derivative of ρ and is called the inﬂuence function. If we introduce\na weight function, w(r) = Ψ(r)/r, we observe that ﬁnding the stationary point of (6.25) using\n(6.26) is equivalent to minimizing the iteratively reweighted least squares (IRLS) problem\nEIRLS =\nX\ni\nw(∥ri∥)∥ri∥2,\n(6.27)\nwhere the w(∥ri∥) play the same local weighting role as σ−2\ni\nin (6.10). The IRLS algo-\nrithm alternates between computing the inﬂuence functions w(∥ri∥) and solving the result-\ning weighted least squares problem (with ﬁxed w values).\nOther incremental robust least\nsquares algorithms can be found in the work of Sawhney and Ayer (1996); Black and Anan-\ndan (1996); Black and Rangarajan (1996); Baker, Gross, Ishikawa et al. (2003) and textbooks\nand tutorials on robust statistics (Huber 1981; Hampel, Ronchetti, Rousseeuw et al. 1986;\nRousseeuw and Leroy 1987; Stewart 1999).\nWhile M-estimators can deﬁnitely help reduce the inﬂuence of outliers, in some cases,\nstarting with too many outliers will prevent IRLS (or other gradient descent algorithms) from\nconverging to the global optimum. A better approach is often to ﬁnd a starting set of inlier\ncorrespondences, i.e., points that are consistent with a dominant motion estimate.7\nTwo widely used approaches to this problem are called RANdom SAmple Consensus, or\nRANSAC for short (Fischler and Bolles 1981), and least median of squares (LMS) (Rousseeuw\n1984). Both techniques start by selecting (at random) a subset of k correspondences, which is\n7 For pixel-based alignment methods (Section 8.1.1), hierarchical (coarse-to-ﬁne) techniques are often used to\nlock onto the dominant motion in a scene.\n6.1 2D and 3D feature-based alignment\n319\nthen used to compute an initial estimate for p. The residuals of the full set of correspondences\nare then computed as\nri = ˜x′\ni(xi; p) −ˆx′\ni,\n(6.28)\nwhere ˜x′\ni are the estimated (mapped) locations and ˆx′\ni are the sensed (detected) feature point\nlocations.\nThe RANSAC technique then counts the number of inliers that are within ϵ of their pre-\ndicted location, i.e., whose ∥ri∥≤ϵ. (The ϵ value is application dependent but is often\naround 1–3 pixels.) Least median of squares ﬁnds the median value of the ∥ri∥2 values. The\nrandom selection process is repeated S times and the sample set with the largest number of\ninliers (or with the smallest median residual) is kept as the ﬁnal solution. Either the initial\nparameter guess p or the full set of computed inliers is then passed on to the next data ﬁtting\nstage.\nWhen the number of measurements is quite large, it may be preferable to only score a\nsubset of the measurements in an initial round that selects the most plausible hypotheses for\nadditional scoring and selection. This modiﬁcation of RANSAC, which can signiﬁcantly\nspeed up its performance, is called Preemptive RANSAC (Nist´er 2003). In another variant\non RANSAC called PROSAC (PROgressive SAmple Consensus), random samples are ini-\ntially added from the most “conﬁdent” matches, thereby speeding up the process of ﬁnding a\n(statistically) likely good set of inliers (Chum and Matas 2005).\nTo ensure that the random sampling has a good chance of ﬁnding a true set of inliers, a\nsufﬁcient number of trials S must be tried. Let p be the probability that any given correspon-\ndence is valid and P be the total probability of success after S trials. The likelihood in one\ntrial that all k random samples are inliers is pk. Therefore, the likelihood that S such trials\nwill all fail is\n1 −P = (1 −pk)S\n(6.29)\nand the required minimum number of trials is\nS = log(1 −P)\nlog(1 −pk).\n(6.30)\nStewart (1999) gives examples of the required number of trials S to attain a 99% proba-\nbility of success. As you can see from Table 6.2, the number of trials grows quickly with the\nnumber of sample points used. This provides a strong incentive to use the minimum number\nof sample points k possible for any given trial, which is how RANSAC is normally used in\npractice.\nUncertainty modeling\nIn addition to robustly computing a good alignment, some applications require the compu-\ntation of uncertainty (see Appendix B.6). For linear problems, this estimate can be obtained",
  "image_path": "page_340.jpg",
  "pages": [
    339,
    340,
    341
  ]
}