{
  "doc_id": "pages_792_794",
  "text": "770\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nupdate rule (B.28) from O(l2) to O(l), they develop specialized update algorithms for sev-\neral cost functions Vi,k(xi, xk), including the Potts model (delta function), absolute values\n(total variation), and quadratic (Gaussian MRF). A related algorithm, mean ﬁeld diffusion\n(Scharstein and Szeliski 1998), also uses synchronous updates between nodes to compute\nmarginal distributions. Yuille (2010) discusses the relationships between mean ﬁeld theory\nand loopy belief propagation.\nMore recent loopy belief propagation algorithms and their variants use sequential scans\nthrough the graph (Szeliski, Zabih, Scharstein et al. 2008). For example, Tappen and Free-\nman (2003) pass messages from left to right along each row and then reverse the direction\nonce they reach the end. This is similar to treating each row as an independent tree (chain),\nexcept that messages from nodes above and below the row are also incorporated. They then\nperform similar computations along columns. These sequential updates allow the information\nto propagate much more quickly across the image than synchronous updates.\nThe other belief propagation variant tested by Szeliski, Zabih, Scharstein et al. (2008),\nwhich they call BP-S or TRW-S, is based on Kolmogorov’s (2006) sequential extension of\nthe tree-reweighted message passing of Wainwright, Jaakkola, and Willsky (2005). TRW\nﬁrst selects a set of trees from the neighborhood graph and computes a set of probability\ndistributions over each tree. These are then used to reweight the messages being passed\nduring loopy belief propagation. The sequential version of TRW, called TRW-S, processed\nnodes in scan-line order, with a forward and backward pass. In the forward pass, each node\nsends messages to its right and bottom neighbors. In the backward pass, messages are sent\nto the left and upper neighbors. TRW-S also computes a lower bound on the energy, which\nis used by Szeliski, Zabih, Scharstein et al. (2008) to estimate how close to the best possible\nsolution all of the MRF inference algorithms being evaluated get.\nAs with dynamic programming, belief propagation techniques also become less efﬁcient\nas the order of each factor clique increases. Potetz and Lee (2008) shows how this complex-\nity can be reduced back to linear in the clique order for continuous-valued problems where\nthe factors involve linear summations followed by a non-linearity, which is typical of more\nsophisticated MRF models such as ﬁelds of experts (Roth and Black 2009) and steerable ran-\ndom ﬁelds (Roth and Black 2007b). Kohli, Kumar, and Torr (2009) and Alahari, Kohli, and\nTorr (2011) develop alternative ways for dealing with higher-order cliques in the context of\ngraph cut algorithms.\nB.5.4 Graph cuts\nThe computer vision community has adopted “graph cuts” as an informal name to describe\na large family of MRF inference algorithms based on solving one or more min-cut or max-\nﬂow problems (Boykov, Veksler, and Zabih 2001; Boykov and Kolmogorov 2010; Boykov,\nB.5 Markov random ﬁelds\n771\n  Object\nterminal\n  terminal\nBackground \np\nq\nr\nw\nv\nS\nT\nBackground \n  Object\n  terminal\nterminal\np\nq\nr\nw\nv\nS\nT\ncut\n(a)\n(b)\nFigure B.3 Graph cuts for minimizing binary sub-modular MRF energies (Boykov and Jolly\n2001) c⃝2001 IEEE: (a) energy function encoded as a max ﬂow problem; (b) the minimum\ncut determines the region boundary.\nVeksler, and Zabih 2010; Ishikawa and Veksler 2010).\nThe simplest example of an MRF graph cut is the polynomial-time algorithm for perform-\ning exact minimization of a binary MRF originally developed by Greig, Porteous, and Seheult\n(1989) and brought to the attention of the computer vision community by Boykov, Veksler,\nand Zabih (2001) and Boykov and Jolly (2001). The basic construction of the min-cut graph\nfrom an MRF energy function is shown in Figure B.3 and described in Sections 3.7.2 and\n5.5. In brief, the nodes in an MRF are connected to special source and sink nodes, and the\nminimum cut between these two nodes, whose cost is exactly that of the MRF energy un-\nder a binary assignment of labels, is computed using a polynomial-time max ﬂow algorithm\n(Goldberg and Tarjan 1988; Boykov and Kolmogorov 2004).\nAs discussed in Section 5.5, important extensions of this basic algorithm have been made\nfor the case of directed edges (Kolmogorov and Boykov 2005), larger neighborhoods (Boykov\nand Kolmogorov 2003; Kolmogorov and Boykov 2005), connectivity priors (Vicente, Kol-\nmogorov, and Rother 2008), and shape priors (Lempitsky and Boykov 2007; Lempitsky,\nBlake, and Rother 2008). Kolmogorov and Zabih (2004) formally characterize the class\nof binary energy potentials (regularity conditions) for which these algorithms ﬁnd the global\nminimum. Komodakis, Tziritas, and Paragios (2008) and Rother, Kolmogorov, Lempitsky et\nal. (2007) provide good algorithms for the cases when they do not.\nBinary MRF problems can also be approximately solved by turning them into continuous\n[0, 1] problems, solving them either as linear systems (Grady 2006; Sinop and Grady 2007;\nGrady and Alvino 2008; Grady 2008; Grady and Ali 2008; Singaraju, Grady, and Vidal 2008;\nCouprie, Grady, Najman et al. 2009) (the random walker model) or by computing geodesic\n772\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\ndistances (Bai and Sapiro 2009; Criminisi, Sharp, and Blake 2008) and then thresholding the\nresults. More details on these techniques are provided in Section 5.5 and a nice review can\nbe found in the work of Singaraju, Grady, Sinop et al. (2010). A different connection to\ncontinuous segmentation techniques, this time to the literature on level sets (Section 5.1.4),\nis made by Boykov, Kolmogorov, Cremers et al. (2006), who develop an approach to solving\nsurface propagation PDEs based on combinatorial graph cut algorithms—Boykov and Funka-\nLea (2006) discuss this and related techniques.\nMulti-valued MRF inference problems usually require solving a series of related binary\nMRF problems (Boykov, Veksler, and Zabih 2001), although for special cases, such as some\nconvex functions, a single graph cut may sufﬁce (Ishikawa 2003; Schlesinger and Flach\n2006). The seminal work in this area is that of Boykov, Veksler, and Zabih (2001), who intro-\nduced two algorithms, called the swap move and the expansion move, which are sketched in\nFigure B.4. The α–β-swap move selects two labels (usually by cycling through all possible\npairings) and then formulates a binary MRF problem that allows any pixels currently labeled\nas either α or β to optionally switch their values to the other label. The α-expansion move\nallows any pixel in the MRF to take on the α label or to keep its current identity. It is easy\nto see by inspection that both of these moves result in binary MRFs with well-deﬁned energy\nfunctions.\nBecause these algorithms use a binary MRF optimization inside their inner loop, they\nare subject to the constraints on the energy functions that occur in the binary labeling case\n(Kolmogorov and Zabih 2004). However, more recent algorithms such as those developed by\nKomodakis, Tziritas, and Paragios (2008) and Rother, Kolmogorov, Lempitsky et al. (2007)\ncan be used to provide approximate solutions for more general energy functions. Efﬁcient\nalgorithms for re-using previous solutions (ﬂow- and cut-recycling) have been developed for\non-line applications such as dynamic MRFs (Kohli and Torr 2005; Juan and Boykov 2006;\nAlahari, Kohli, and Torr 2011) and coarse-to-ﬁne banded graph cuts (Agarwala, Zheng, Pal et\nal. 2005; Lombaert, Sun, Grady et al. 2005; Juan and Boykov 2006). It is also now possible to\nminimize the number of labels used as part of the alpha-expansion process (Delong, Osokin,\nIsack et al. 2010).\nIn experimental comparisons, α-expansions usually converge faster to a good solution\nthan α–β-swaps (Szeliski, Zabih, Scharstein et al. 2008), especially for problems that in-\nvolve large regions of identical labels, such as the labeling of source imagery in image stitch-\ning (Figure 3.60). For truncated convex energy functions deﬁned over ordinal values, more\naccurate algorithms that consider complete ranges of labels inside each min-cut and often\nproduce lower energies have been developed (Veksler 2007; Kumar and Torr 2008; Kumar,\nVeksler, and Torr 2010). The whole ﬁeld of efﬁcient MRF inference algorithms is rapidly\ndeveloping, as witnessed by a recent special journal issue (Kohli and Torr 2008; Komodakis,\nTziritas, and Paragios 2008; Olsson, Eriksson, and Kahl 2008; Potetz and Lee 2008), articles",
  "image_path": "page_793.jpg",
  "pages": [
    792,
    793,
    794
  ]
}