{
  "doc_id": "pages_868_870",
  "text": "846\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nJoshi, N., Szeliski, R., and Kriegman, D. J. (2008). PSF estimation using sharp edge\nprediction. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2008), Anchorage, AK.\nJoshi, N., Zitnick, C. L., Szeliski, R., and Kriegman, D. J.\n(2009).\nImage deblurring\nand denoising using color priors. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2009), Miami, FL.\nJu, S. X., Black, M. J., and Jepson, A. D. (1996). Skin and bones: Multi-layer, locally\nafﬁne, optical ﬂow and regularization with transparency. In IEEE Computer Society\nConference on Computer Vision and Pattern Recognition (CVPR’96), pp. 307–314, San\nFrancisco.\nJu, S. X., Black, M. J., and Yacoob, Y. (1996). Cardboard people: a parameterized model\nof articulated image motion. In 2nd International Conference on Automatic Face and\nGesture Recognition, pp. 38–44, Killington, VT.\nJuan, O. and Boykov, Y. (2006). Active graph cuts. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR’2006), pp. 1023–1029, New York\nCity, NY.\nJurie, F. and Dhome, M. (2002). Hyperplane approximation for template matching. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 24(7):996–1000.\nJurie, F. and Schmid, C. (2004). Scale-invariant shape features for recognition of object\ncategories. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2004), pp. 90–96, Washington, DC.\nKadir, T., Zisserman, A., and Brady, M. (2004). An afﬁne invariant salient region detec-\ntor. In Eighth European Conference on Computer Vision (ECCV 2004), pp. 228–241,\nPrague.\nKaftory, R., Schechner, Y., and Zeevi, Y. (2007). Variational distance-dependent image\nrestoration. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2007), Minneapolis, MN.\nKahl, F. and Hartley, R. (2008). Multiple-view geometry under the l∞-norm. IEEE Trans-\nactions on Pattern Analysis and Machine Intelligence, 30(11):1603–1617.\nKakadiaris, I. and Metaxas, D. (2000). Model-based estimation of 3D human motion.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 22(12):1453–1459.\nKakumanu, P., Makrogiannis, S., and Bourbakis, N. (2007). A survey of skin-color model-\ning and detection methods. Pattern Recognition, 40(3):1106–1122.\nKamvar, S. D., Klein, D., and Manning, C. D. (2002). Interpreting and extending classical\nagglomerative clustering algorithms using a model-based approach. In International\nReferences\n847\nConference on Machine Learning, pp. 283–290.\nKanade, T. (1977). Computer Recognition of Human Faces. Birkhauser, Basel.\nKanade, T. (1980). A theory of the origami world. Artiﬁcial Intelligence, 13:279–311.\nKanade, T. (ed.). (1987). Three-Dimensional Machine Vision, Kluwer Academic Publish-\ners, Boston.\nKanade, T. (1994). Development of a video-rate stereo machine. In Image Understanding\nWorkshop, pp. 549–557, Monterey.\nKanade, T. and Okutomi, M. (1994). A stereo matching algorithm with an adaptive win-\ndow: Theory and experiment. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 16(9):920–932.\nKanade, T., Rander, P. W., and Narayanan, P. J. (1997). Virtualized reality: constructing\nvirtual worlds from real scenes. IEEE MultiMedia Magazine, 4(1):34–47.\nKanade, T., Yoshida, A., Oda, K., Kano, H., and Tanaka, M. (1996). A stereo machine for\nvideo-rate dense depth mapping and its new applications. In IEEE Computer Society\nConference on Computer Vision and Pattern Recognition (CVPR’96), pp. 196–202, San\nFrancisco.\nKanatani, K. and Morris, D. D. (2001). Gauges and gauge transformations for uncertainty\ndescription of geometric structure with indeterminacy. IEEE Transactions on Informa-\ntion Theory, 47(5):2017–2028.\nKang, S. B. (1998). Depth Painting for Image-based Rendering Applications. Technical\nReport, Compaq Computer Corporation, Cambridge Research Lab.\nKang, S. B. (1999). A survey of image-based rendering techniques. In Videometrics VI,\npp. 2–16, San Jose.\nKang, S. B. (2001). Radial distortion snakes. IEICE Trans. Inf. & Syst., E84-D(12):1603–\n1611.\nKang, S. B. and Jones, M. (2002). Appearance-based structure from motion using linear\nclasses of 3-D models. International Journal of Computer Vision, 49(1):5–22.\nKang, S. B. and Szeliski, R. (1997). 3-D scene data recovery using omnidirectional multi-\nbaseline stereo. International Journal of Computer Vision, 25(2):167–183.\nKang, S. B. and Szeliski, R. (2004). Extracting view-dependent depth maps from a collec-\ntion of images. International Journal of Computer Vision, 58(2):139–163.\nKang, S. B. and Weiss, R. (1997). Characterization of errors in compositing panoramic\nimages. In IEEE Computer Society Conference on Computer Vision and Pattern Recog-\nnition (CVPR’97), pp. 103–109, San Juan, Puerto Rico.\n848\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nKang, S. B. and Weiss, R. (1999). Characterization of errors in compositing panoramic\nimages. Computer Vision and Image Understanding, 73(2):269–280.\nKang, S. B. and Weiss, R. (2000). Can we calibrate a camera using an image of a ﬂat,\ntextureless Lambertian surface?\nIn Sixth European Conference on Computer Vision\n(ECCV 2000), pp. 640–653, Dublin, Ireland.\nKang, S. B., Szeliski, R., and Anandan, P. (2000). The geometry-image representation\ntradeoff for rendering. In International Conference on Image Processing (ICIP-2000),\npp. 13–16, Vancouver.\nKang, S. B., Szeliski, R., and Chai, J. (2001). Handling occlusions in dense multi-view\nstereo. In IEEE Computer Society Conference on Computer Vision and Pattern Recog-\nnition (CVPR’2001), pp. 103–110, Kauai, Hawaii.\nKang, S. B., Szeliski, R., and Shum, H.-Y. (1997). A parallel feature tracker for extended\nimage sequences. Computer Vision and Image Understanding, 67(3):296–310.\nKang, S. B., Szeliski, R., and Uyttendaele, M. (2004). Seamless Stitching using Multi-\nPerspective Plane Sweep. Technical Report MSR-TR-2004-48, Microsoft Research.\nKang, S. B., Li, Y., Tong, X., and Shum, H.-Y. (2006). Image-based rendering. Founda-\ntions and Trends in Computer Graphics and Computer Vision, 2(3):173–258.\nKang, S. B., Uyttendaele, M., Winder, S., and Szeliski, R. (2003). High dynamic range\nvideo. ACM Transactions on Graphics (Proc. SIGGRAPH 2003), 22(3):319–325.\nKang, S. B., Webb, J., Zitnick, L., and Kanade, T. (1995). A multibaseline stereo system\nwith active illumination and real-time image acquisition. In Fifth International Confer-\nence on Computer Vision (ICCV’95), pp. 88–93, Cambridge, Massachusetts.\nKannala, J., Rahtu, E., Brandt, S. S., and Heikkila, J. (2008). Object recognition and seg-\nmentation by non-rigid quasi-dense matching. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nKass, M. (1988). Linear image features in stereopsis. International Journal of Computer\nVision, 1(4):357–368.\nKass, M., Witkin, A., and Terzopoulos, D. (1988). Snakes: Active contour models. Inter-\nnational Journal of Computer Vision, 1(4):321–331.\nKato, H., Billinghurst, M., Poupyrev, I., Imamoto, K., and Tachibana, K. (2000). Virtual\nobject manipulation on a table-top AR environment. In International Symposium on\nAugmented Reality (ISAR 2000).\nKaufman, L. and Rousseeuw, P. J. (1990). Finding Groups in Data: An Introduction to\nCluster Analysis. John Wiley & Sons, Hoboken.",
  "image_path": "page_869.jpg",
  "pages": [
    868,
    869,
    870
  ]
}