{
  "doc_id": "pages_876_878",
  "text": "854\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nKumar, S. and Hebert, M. (2006). Discriminative random ﬁelds. International Journal of\nComputer Vision, 68(2):179–202.\nKundur, D. and Hatzinakos, D. (1996). Blind image deconvolution. IEEE Signal Process-\ning Magazine, 13(3):43–64.\nKutulakos, K. N. (2000). Approximate N-view stereo. In Sixth European Conference on\nComputer Vision (ECCV 2000), pp. 67–83, Dublin, Ireland.\nKutulakos, K. N. and Seitz, S. M. (2000). A theory of shape by space carving. Interna-\ntional Journal of Computer Vision, 38(3):199–218.\nKwatra, V., Essa, I., Bobick, A., and Kwatra, N. (2005). Graphcut textures: Image and\nvideo synthesis using graph cuts. ACM Transactions on Graphics (Proc. SIGGRAPH\n2005), 24(5):795–802.\nKwatra, V., Sch¨odl, A., Essa, I., Turk, G., and Bobick, A. (2003). Graphcut textures:\nImage and video synthesis using graph cuts. ACM Transactions on Graphics (Proc.\nSIGGRAPH 2003), 22(3):277–286.\nKybic, J. and Unser, M. (2003). Fast parametric elastic image registration. IEEE Transac-\ntions on Image Processing, 12(11):1427–1442.\nLafferty, J., McCallum, A., and Pereira, F. (2001). Conditional random ﬁelds: Probabilistic\nmodels for segmenting and labeling sequence data.\nIn International Conference on\nMachine Learning.\nLafortune, E. P. F., Foo, S.-C., Torrance, K. E., and Greenberg, D. P. (1997). Non-linear\napproximation of reﬂectance functions. In ACM SIGGRAPH 1997 Conference Proceed-\nings, pp. 117–126, Los Angeles.\nLai, S.-H. and Vemuri, B. C. (1997). Physically based adaptive preconditioning for early\nvision. IEEE Transactions on Pattern Analysis and Machine Intelligence, 19(6):594–\n607.\nLalonde, J.-F., Hoiem, D., Efros, A. A., Rother, C., Winn, J., and Criminisi, A. (2007).\nPhoto clip art. ACM Transactions on Graphics, 26(3).\nLampert, C. H. (2008). Kernel methods in computer vision. Foundations and Trends in\nComputer Graphics and Computer Vision, 4(3):193–285.\nLanger, M. S. and Zucker, S. W. (1994). Shape from shading on a cloudy day. Journal\nOptical Society America, A, 11(2):467–478.\nLanitis, A., Taylor, C. J., and Cootes, T. F. (1997). Automatic interpretation and coding of\nface images using ﬂexible models. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 19(7):742–756.\nReferences\n855\nLarlus, D. and Jurie, F. (2008). Combining appearance models and Markov random ﬁelds\nfor category level object segmentation. In IEEE Computer Society Conference on Com-\nputer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nLarson, G. W. (1998). LogLuv encoding for full-gamut, high-dynamic range images. Jour-\nnal of Graphics Tools, 3(1):15–31.\nLarson, G. W., Rushmeier, H., and Piatko, C. (1997). A visibility matching tone reproduc-\ntion operator for high dynamic range scenes. IEEE Transactions on Visualization and\nComputer Graphics, 3(4):291–306.\nLaurentini, A. (1994). The visual hull concept for silhouette-based image understanding.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 16(2):150–162.\nLavall´ee, S. and Szeliski, R. (1995). Recovering the position and orientation of free-form\nobjects from image contours using 3-D distance maps. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 17(4):378–390.\nLaveau, S. and Faugeras, O. D. (1994). 3-D scene representation as a collection of images.\nIn Twelfth International Conference on Pattern Recognition (ICPR’94), pp. 689–691,\nJerusalem, Israel.\nLazebnik, S., Schmid, C., and Ponce, J. (2005). A sparse texture representation using\nlocal afﬁne regions. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n27(8):1265–1278.\nLazebnik, S., Schmid, C., and Ponce, J. (2006). Beyond bags of features: Spatial pyramid\nmatching for recognizing natural scene categories. In IEEE Computer Society Confer-\nence on Computer Vision and Pattern Recognition (CVPR’2006), pp. 2169–2176, New\nYork City, NY.\nLe Gall, D. (1991). MPEG: A video compression standard for multimedia applications.\nCommunications of the ACM, 34(4):46–58.\nLeclerc, Y. G.\n(1989).\nConstructing simple stable descriptions for image partitioning.\nInternational Journal of Computer Vision, 3(1):73–102.\nLeCun, Y., Huang, F. J., and Bottou, L. (2004). Learning methods for generic object\nrecognition with invariance to pose and lighting. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR’2004), pp. 97–104, Washington,\nDC.\nLee, J., Chai, J., Reitsma, P. S. A., Hodgins, J. K., and Pollard, N. S. (2002). Interactive\ncontrol of avatars animated with human motion data. ACM Transactions on Graphics,\n21(3):491–500.\n856\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nLee, M.-C., ge Chen, W., lung Bruce Lin, C., Gu, C., Markoc, T., Zabinsky, S. I., and\nSzeliski, R. (1997). A layered video object coding system using sprite and afﬁne motion\nmodel. IEEE Transactions on Circuits and Systems for Video Technology, 7(1):130–\n145.\nLee, M. E. and Redner, R. A. (1990). A note on the use of nonlinear ﬁltering in computer\ngraphics. IEEE Computer Graphics and Applications, 10(3):23–29.\nLee, M. W. and Cohen, I. (2006). A model-based approach for estimating human 3D poses\nin static images.\nIEEE Transactions on Pattern Analysis and Machine Intelligence,\n28(6):905–916.\nLee, S., Wolberg, G., and Shin, S. Y. (1996). Data interpolation using multilevel b-splines.\nIEEE Transactions on Visualization and Computer Graphics, 3(3):228–244.\nLee, S., Wolberg, G., Chwa, K.-Y., and Shin, S. Y. (1996). Image metamorphosis with scat-\ntered feature constraints. IEEE Transactions on Visualization and Computer Graphics,\n2(4):337–354.\nLee, Y. D., Terzopoulos, D., and Waters, K. (1995). Realistic facial modeling for animation.\nIn ACM SIGGRAPH 1995 Conference Proceedings, pp. 55–62.\nLei, C. and Yang, Y.-H. (2009). Optical ﬂow estimation on coarse-to-ﬁne region-trees using\ndiscrete optimization. In Twelfth International Conference on Computer Vision (ICCV\n2009), Kyoto, Japan.\nLeibe, B. and Schiele, B. (2003). Analyzing appearance and contour based methods for\nobject categorization. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’2003), pp. 409–415, Madison, WI.\nLeibe, B., Leonardis, A., and Schiele, B.\n(2008).\nRobust object detection with inter-\nleaved categorization and segmentation.\nInternational Journal of Computer Vision,\n77(1-3):259–289.\nLeibe, B., Seemann, E., and Schiele, B. (2005). Pedestrian detection in crowded scenes.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 878–885, San Diego, CA.\nLeibe, B., Cornelis, N., Cornelis, K., and Van Gool, L. (2007). Dynamic 3D scene analysis\nfrom a moving vehicle. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2007), Minneapolis, MN.\nLeibowitz, D. (2001). Camera Calibration and Reconstruction of Geometry from Images.\nPh.D. thesis, University of Oxford.\nLempitsky, V. and Boykov, Y. (2007). Global optimization for shape ﬁtting. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR 2007),",
  "image_path": "page_877.jpg",
  "pages": [
    876,
    877,
    878
  ]
}