{
  "doc_id": "pages_834_836",
  "text": "812\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nChum, O., Philbin, J., Sivic, J., Isard, M., and Zisserman, A. (2007). Total recall: Auto-\nmatic query expansion with a generative feature model for object retrieval. In Eleventh\nInternational Conference on Computer Vision (ICCV 2007), Rio de Janeiro, Brazil.\nCipolla, R. and Blake, A. (1990). The dynamic analysis of apparent contours. In Third\nInternational Conference on Computer Vision (ICCV’90), pp. 616–623, Osaka, Japan.\nCipolla, R. and Blake, A. (1992). Surface shape from the deformation of apparent contours.\nInternational Journal of Computer Vision, 9(2):83–112.\nCipolla, R. and Giblin, P. (2000). Visual Motion of Curves and Surfaces. Cambridge\nUniversity Press, Cambridge.\nCipolla, R., Drummond, T., and Robertson, D. P. (1999). Camera calibration from van-\nishing points in images of architectural scenes. In British Machine Vision Conference\n(BMVC99).\nClaus, D. and Fitzgibbon, A. (2005). A rational function lens distortion model for gen-\neral cameras. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2005), pp. 213–219, San Diego, CA.\nClowes, M. B. (1971). On seeing things. Artiﬁcial Intelligence, 2:79–116.\nCohen, L. D. and Cohen, I. (1993). Finite-element methods for active contour models and\nballoons for 2-D and 3-D images. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 15(11):1131–1147.\nCohen, M. and Wallace, J. (1993). Radiosity and Realistic Image Synthesis. Morgan\nKaufmann.\nCohen, M. F. and Szeliski, R. (2006). The Moment Camera. Computer, 39(8):40–45.\nCollins, R. T. (1996). A space-sweep approach to true multi-image matching. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR’96),\npp. 358–363, San Francisco.\nCollins, R. T. and Liu, Y. (2003). On-line selection of discriminative tracking features. In\nNinth International Conference on Computer Vision (ICCV 2003), pp. 346–352, Nice,\nFrance.\nCollins, R. T. and Weiss, R. S. (1990). Vanishing point calculation as a statistical inference\non the unit sphere. In Third International Conference on Computer Vision (ICCV’90),\npp. 400–403, Osaka, Japan.\nComaniciu, D. and Meer, P. (2002). Mean shift: A robust approach toward feature space\nanalysis. IEEE Transactions on Pattern Analysis and Machine Intelligence, 24(5):603–\n619.\nReferences\n813\nComaniciu, D. and Meer, P. (2003). An algorithm for data-driven bandwidth selection.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 25(2):281–288.\nConn, A. R., Gould, N. I. M., and Toint, P. L. (2000). Trust-Region Methods. Society for\nIndustrial and Applied Mathematics, Philadephia.\nCook, R. L. and Torrance, K. E. (1982). A reﬂectance model for computer graphics. ACM\nTransactions on Graphics, 1(1):7–24.\nCoorg, S. and Teller, S. (2000). Spherical mosaics with quaternions and dense correlation.\nInternational Journal of Computer Vision, 37(3):259–273.\nCootes, T., Edwards, G. J., and Taylor, C. J. (2001). Active appearance models. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 23(6):681–685.\nCootes, T., Cooper, D., Taylor, C., and Graham, J. (1995). Active shape models—their\ntraining and application. Computer Vision and Image Understanding, 61(1):38–59.\nCootes, T., Taylor, C., Lanitis, A., Cooper, D., and Graham, J. (1993). Building and using\nﬂexible models incorporating grey-level information. In Fourth International Confer-\nence on Computer Vision (ICCV’93), pp. 242–246, Berlin, Germany.\nCootes, T. F. and Taylor, C. J. (2001). Statistical models of appearance for medical image\nanalysis and computer vision. In Medical Imaging.\nCoquillart, S. (1990). Extended free-form deformations: A sculpturing tool for 3D geo-\nmetric modeling. Computer Graphics (SIGGRAPH ’90), 24(4):187–196.\nCormen, T. H. (2001). Introduction to Algorithms. MIT Press, Cambridge, Massachusetts.\nCornelis, N., Leibe, B., Cornelis, K., and Van Gool, L. (2008). 3D urban scene modeling\nintegrating recognition and reconstruction. International Journal of Computer Vision,\n78(2-3):121–141.\nCorso, J. and Hager, G. (2005). Coherent regions for concise and stable image description.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 184–190, San Diego, CA.\nCosteira, J. and Kanade, T. (1995). A multi-body factorization method for motion analy-\nsis. In Fifth International Conference on Computer Vision (ICCV’95), pp. 1071–1076,\nCambridge, Massachusetts.\nCosten, N., Cootes, T. F., Edwards, G. J., and Taylor, C. J. (1999). Simultaneous extrac-\ntion of functional face subspaces. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR’99), pp. 492–497, Fort Collins.\nCouprie, C., Grady, L., Najman, L., and Talbot, H. (2009). Power watersheds: A new image\nsegmentation framework extending graph cuts, random walker and optimal spanning\n814\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nforest. In Twelfth International Conference on Computer Vision (ICCV 2009), Kyoto,\nJapan.\nCour, T., B´en´ezit, F., and Shi, J. (2005). Spectral segmentation with multiscale graph\ndecomposition. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2005), pp. 1123–1130, San Diego, CA.\nCox, D., Little, J., and O’Shea, D. (2007). Ideals, Varieties, and Algorithms: An Introduc-\ntion to Computational Algebraic Geometry and Commutative Algebra. Springer.\nCox, I. J. (1994). A maximum likelihood N-camera stereo algorithm. In IEEE Computer\nSociety Conference on Computer Vision and Pattern Recognition (CVPR’94), pp. 733–\n739, Seattle.\nCox, I. J., Roy, S., and Hingorani, S. L. (1995). Dynamic histogram warping of image pairs\nfor constant image brightness. In IEEE International Conference on Image Processing\n(ICIP’95), pp. 366–369.\nCox, I. J., Hingorani, S. L., Rao, S. B., and Maggs, B. M. (1996). A maximum likelihood\nstereo algorithm. Computer Vision and Image Understanding, 63(3):542–567.\nCrandall, D. and Huttenlocher, D. (2007). Composite models of objects and scenes for\ncategory recognition. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2007), Minneapolis, MN.\nCrandall, D., Felzenszwalb, P., and Huttenlocher, D. (2005). Spatial priors for part-based\nrecognition using statistical models. In IEEE Computer Society Conference on Com-\nputer Vision and Pattern Recognition (CVPR’2005), pp. 10–17, San Diego, CA.\nCrandall, D., Backstrom, L., Huttenlocher, D., and Kleinberg, J. (2009). Mapping the\nworld’s photos. In 18th Int. World Wide Web Conference, pp. 761–770, Madrid.\nCrandall, D. J. and Huttenlocher, D. P. (2006). Weakly supervised learning of part-based\nspatial models for visual object recognition. In Ninth European Conference on Com-\nputer Vision (ECCV 2006), pp. 16–29.\nCrane, R. (1997). A Simpliﬁed Approach to Image Processing. Prentice Hall, Upper Saddle\nRiver, NJ.\nCraswell, N. and Szummer, M. (2007). Random walks on the click graph. In ACM SIGIR\nConference on Research and Development in Informaion Retrieval, pp. 239–246, New\nYork, NY.\nCremers, D. and Soatto, S. (2005). Motion competition: A variational framework for\npiecewise parametric motion segmentation. International Journal of Computer Vision,\n62(3):249–265.",
  "image_path": "page_835.jpg",
  "pages": [
    834,
    835,
    836
  ]
}