{
  "doc_id": "pages_894_896",
  "text": "872\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nMueller, P., Zeng, G., Wonka, P., and Van Gool, L. (2007). Image-based procedural mod-\neling of facades. ACM Transactions on Graphics, 26(3).\nM¨uhlich, M. and Mester, R. (1998). The role of total least squares in motion analysis.\nIn Fifth European Conference on Computer Vision (ECCV’98), pp. 305–321, Freiburg,\nGermany.\nMuja, M. and Lowe, D. G. (2009). Fast approximate nearest neighbors with automatic\nalgorithm conﬁguration. In International Conference on Computer Vision Theory and\nApplications (VISAPP), Lisbon, Portugal.\nMumford, D. and Shah, J. (1989). Optimal approximations by piecewise smooth functions\nand variational problems. Comm. Pure Appl. Math., XLII(5):577–685.\nMunder, S. and Gavrila, D. M. (2006). An experimental study on pedestrian classiﬁcation.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 28(11):1863–1868.\nMundy, J. L. (2006). Object recognition in the geometric era: A retrospective. In Ponce,\nJ., Hebert, M., Schmid, C., and Zisserman, A. (eds), Toward Category-Level Object\nRecognition, pp. 3–28, Springer, New York.\nMundy, J. L. and Zisserman, A. (eds). (1992). Geometric Invariance in Computer Vision.\nMIT Press, Cambridge, Massachusetts.\nMurase, H. and Nayar, S. K. (1995). Visual learning and recognition of 3-D objects from\nappearance. International Journal of Computer Vision, 14(1):5–24.\nMurphy, E. P. (2005). A Testing Procedure to Characterize Color and Spatial Quality of\nDigital Cameras Used to Image Cultural Heritage. Master’s thesis, Rochester Institute\nof Technology.\nMurphy, K., Torralba, A., and Freeman, W. T. (2003). Using the forest to see the trees: A\ngraphical model relating features, objects, and scenes. In Advances in Neural Informa-\ntion Processing Systems.\nMurphy-Chutorian, E. and Trivedi, M. M.\n(2009).\nHead pose estimation in computer\nvision: A survey. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n31(4):607–626.\nMurray, R. M., Li, Z. X., and Sastry, S. S. (1994). A Mathematical Introduction to Robotic\nManipulation. CRC Press.\nMutch, J. and Lowe, D. G.\n(2008).\nObject class recognition and localization using\nsparse features with limited receptive ﬁelds. International Journal of Computer Vision,\n80(1):45–57.\nReferences\n873\nNagel, H. H. (1986). Image sequences—ten (octal) years—from phenomenology towards\na theoretical foundation. In Eighth International Conference on Pattern Recognition\n(ICPR’86), pp. 1174–1185, Paris.\nNagel, H.-H. and Enkelmann, W. (1986). An investigation of smoothness constraints for\nthe estimation of displacement vector ﬁelds from image sequences. IEEE Transactions\non Pattern Analysis and Machine Intelligence, PAMI-8(5):565–593.\nNakamura, Y., Matsuura, T., Satoh, K., and Ohta, Y. (1996). Occlusion detectable stereo—\nocclusion patterns in camera matrix. In IEEE Computer Society Conference on Com-\nputer Vision and Pattern Recognition (CVPR’96), pp. 371–378, San Francisco.\nNakao, T., Kashitani, A., and Kaneyoshi, A. (1998). Scanning a document with a small\ncamera attached to a mouse. In IEEE Workshop on Applications of Computer Vision\n(WACV’98), pp. 63–68, Princeton.\nNalwa, V. S. (1987). Edge-detector resolution improvement by image interpolation. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, PAMI-9(3):446–451.\nNalwa, V. S. (1993). A Guided Tour of Computer Vision. Addison-Wesley, Reading, MA.\nNalwa, V. S. and Binford, T. O. (1986). On detecting edges. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, PAMI-8(6):699–714.\nNarasimhan, S. G. and Nayar, S. K. (2005). Enhancing resolution along multiple imaging\ndimensions using assorted pixels. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 27(4):518–530.\nNarayanan, P., Rander, P., and Kanade, T. (1998). Constructing virtual worlds using dense\nstereo. In Sixth International Conference on Computer Vision (ICCV’98), pp. 3–10,\nBombay.\nNayar, S., Watanabe, M., and Noguchi, M. (1995). Real-time focus range sensor. In Fifth\nInternational Conference on Computer Vision (ICCV’95), pp. 995–1001, Cambridge,\nMassachusetts.\nNayar, S. K. (2006). Computational cameras: Redeﬁning the image. Computer, 39(8):30–\n38.\nNayar, S. K. and Branzoi, V. (2003). Adaptive dynamic range imaging: Optical control of\npixel exposures over space and time. In Ninth International Conference on Computer\nVision (ICCV 2003), pp. 1168–1175, Nice, France.\nNayar, S. K. and Mitsunaga, T. (2000). High dynamic range imaging: Spatially varying\npixel exposures. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2000), pp. 472–479, Hilton Head Island.\n874\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nNayar, S. K. and Nakagawa, Y. (1994). Shape from focus. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 16(8):824–831.\nNayar, S. K., Ikeuchi, K., and Kanade, T. (1991). Shape from interreﬂections. Interna-\ntional Journal of Computer Vision, 6(3):173–195.\nNayar, S. K., Watanabe, M., and Noguchi, M. (1996). Real-time focus range sensor. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 18(12):1186–1198.\nNegahdaripour, S. (1998). Revised deﬁnition of optical ﬂow: Integration of radiometric\nand geometric cues for dynamic scene analysis. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 20(9):961–979.\nNehab, D., Rusinkiewicz, S., Davis, J., and Ramamoorthi, R. (2005). Efﬁciently combining\npositions and normals for precise 3d geometry. ACM Transactions on Graphics (Proc.\nSIGGRAPH 2005), 24(3):536–543.\nNene, S. and Nayar, S. K. (1997). A simple algorithm for nearest neighbor search in\nhigh dimensions. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n19(9):989–1003.\nNene, S. A., Nayar, S. K., and Murase, H. (1996). Columbia Object Image Library (COIL-\n100). Technical Report CUCS-006-96, Department of Computer Science, Columbia\nUniversity.\nNetravali, A. and Robbins, J. (1979). Motion-compensated television coding: Part 1. Bell\nSystem Tech., 58(3):631–670.\nNevatia, R. (1977). A color edge detector and its use in scene segmentation. IEEE Trans-\nactions on Systems, Man, and Cybernetics, SMC-7(11):820–826.\nNevatia, R. and Binford, T. (1977). Description and recognition of curved objects. Artiﬁ-\ncial Intelligence, 8:77–98.\nNg, A. Y., Jordan, M. I., and Weiss, Y. (2001). On spectral clustering: Analysis and an\nalgorithm. In Advances in Neural Information Processing Systems, pp. 849–854.\nNg, R. (2005). Fourier slice photography. ACM Transactions on Graphics (Proc. SIG-\nGRAPH 2005), 24(3):735–744.\nNg, R., Levoy, M., Br´eedif, M., Duval, G., Horowitz, M., and Hanrahan, P. (2005). Light\nField Photography with a Hand-held Plenoptic Camera. Technical Report CSTR 2005-\n02, Stanford University.\nNielsen, M., Florack, L. M. J., and Deriche, R. (1997). Regularization, scale-space, and\nedge-detection ﬁlters. Journal of Mathematical Imaging and Vision, 7(4):291–307.",
  "image_path": "page_895.jpg",
  "pages": [
    894,
    895,
    896
  ]
}