{
  "doc_id": "pages_937_939",
  "text": "References\n915\nUllman, S. (1979). The interpretation of structure from motion. Proceedings of the Royal\nSociety of London, B-203:405–426.\nUnnikrishnan, R., Pantofaru, C., and Hebert, M. (2007). Toward objective evaluation of\nimage segmentation algorithms. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 29(6):828–944.\nUnser, M. (1999). Splines: A perfect ﬁt for signal and image processing. IEEE Signal\nProcessing Magazine, 16(6):22–38.\nUrmson, C., Anhalt, J., Bagnell, D., Baker, C., Bittner, R. et al. (2008). Autonomous\ndriving in urban environments: Boss and the urban challenge. Journal of Field Robotics,\n25(8):425–466.\nUrtasun, R., Fleet, D. J., and Fua, P. (2006). Temporal motion models for monocular\nand multiview 3D human body tracking. Computer Vision and Image Understanding,\n104(2-3):157–177.\nUyttendaele, M., Eden, A., and Szeliski, R. (2001). Eliminating ghosting and exposure\nartifacts in image mosaics. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR’2001), pp. 509–516, Kauai, Hawaii.\nUyttendaele, M., Criminisi, A., Kang, S. B., Winder, S., Hartley, R., and Szeliski, R.\n(2004). Image-based interactive exploration of real-world environments. IEEE Com-\nputer Graphics and Applications, 24(3):52–63.\nVaillant, R. and Faugeras, O. D. (1992). Using extremal boundaries for 3-D object model-\ning. IEEE Transactions on Pattern Analysis and Machine Intelligence, 14(2):157–173.\nVaish, V., Szeliski, R., Zitnick, C. L., Kang, S. B., and Levoy, M. (2006). Reconstructing\noccluded surfaces using synthetic apertures: Shape from focus vs. shape from stereo.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2006), pp. 2331–2338, New York, NY.\nvan de Weijer, J. and Schmid, C.\n(2006).\nColoring local feature extraction.\nIn Ninth\nEuropean Conference on Computer Vision (ECCV 2006), pp. 334–348.\nvan den Hengel, A., Dick, A., Thormhlen, T., Ward, B., and Torr, P. H. S. (2007). Video-\ntrace: Rapid interactive scene modeling from video. ACM Transactions on Graphics,\n26(3).\nVan Huffel, S. and Lemmerling, P. (eds).\n(2002).\nTotal Least Squares and Errors-in-\nVariables Modeling, Springer.\nVan Huffel, S. and Vandewalle, J. (1991). The Total Least Squares Problem: Computa-\ntional Aspects and Analysis. Society for Industrial and Applied Mathematics, Philade-\nphia.\n916\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nvan Ouwerkerk, J. D. (2006). Image super-resolution survey. Image and Vision Computing,\n24(10):1039–1052.\nVarma, M. and Ray, D. (2007). Learning the discriminative power-invariance trade-off. In\nEleventh International Conference on Computer Vision (ICCV 2007), Rio de Janeiro,\nBrazil.\nVasconcelos, N. (2007). From pixels to semantic spaces: Advances in content-based image\nretrieval. Computer, 40(7):20–26.\nVasilescu, M. A. O. and Terzopoulos, D. (2007). Multilinear (tensor) image synthesis,\nanalysis, and recognition. IEEE Signal Processing Magazine, 24(6):118–123.\nVedaldi, A. and Fulkerson, B. (2008). VLFeat: An open and portable library of computer\nvision algorithms. http://www.vlfeat.org/.\nVedaldi, A., Gulshan, V., Varma, M., and Zisserman, A. (2009). Multiple kernels for\nobject detection. In Twelfth International Conference on Computer Vision (ICCV 2009),\nKyoto, Japan.\nVedula, S., Baker, S., and Kanade, T. (2005). Image-based spatio-temporal modeling and\nview interpolation of dynamic events. ACM Transactions on Graphics, 24(2):240–261.\nVedula, S., Baker, S., Rander, P., Collins, R., and Kanade, T.\n(2005).\nThree-\ndimensional scene ﬂow. IEEE Transactions on Pattern Analysis and Machine Intel-\nligence, 27(3):475–480.\nVeeraraghavan, A., Raskar, R., Agrawal, A., Mohan, A., and Tumblin, J. (2007). Dappled\nphotography: Mask enhanced cameras for heterodyned light ﬁelds and coded aperture\nrefocusing. ACM Transactions on Graphics, 26(3).\nVeksler, O. (1999). Efﬁcient Graph-based Energy Minimization Methods in Computer\nVision. Ph.D. thesis, Cornell University.\nVeksler, O. (2001). Stereo matching by compact windows via minimum ratio cycle. In\nEighth International Conference on Computer Vision (ICCV 2001), pp. 540–547, Van-\ncouver, Canada.\nVeksler, O. (2003). Fast variable window for stereo correspondence using integral images.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2003), pp. 556–561, Madison, WI.\nVeksler, O. (2007). Graph cut based optimization for MRFs with truncated convex priors.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.\nReferences\n917\nVerbeek, J. and Triggs, B. (2007). Region classiﬁcation with Markov ﬁeld aspect models.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.\nVergauwen, M. and Van Gool, L. (2006). Web-based 3D reconstruction service. Machine\nVision and Applications, 17(2):321–329.\nVetter, T. and Poggio, T. (1997). Linear object classes and image synthesis from a sin-\ngle example image. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n19(7):733–742.\nVezhnevets, V., Sazonov, V., and Andreeva, A. (2003). A survey on pixel-based skin color\ndetection techniques. In GRAPHICON03, pp. 85–92.\nVicente, S., Kolmogorov, V., and Rother, C. (2008). Graph cut based image segmentation\nwith connectivity priors. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR 2008), Anchorage, AK.\nVidal, R., Ma, Y., and Sastry, S. S. (2010). Generalized Principal Component Analysis.\nSpringer.\nVi´eville, T. and Faugeras, O. D. (1990). Feedforward recovery of motion and structure\nfrom a sequence of 2D-lines matches. In Third International Conference on Computer\nVision (ICCV’90), pp. 517–520, Osaka, Japan.\nVincent, L. and Soille, P. (1991). Watersheds in digital spaces: An efﬁcient algorithm\nbased on immersion simulations. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 13(6):583–596.\nVineet, V. and Narayanan, P. J. (2008). CUDA cuts: Fast graph cuts on the GPU. In CVPR\n2008 Workshop on Visual Computer Vision on GPUs (CVGPU), Anchorage, AK.\nViola, P. and Wells III, W. (1997). Alignment by maximization of mutual information.\nInternational Journal of Computer Vision, 24(2):137–154.\nViola, P., Jones, M. J., and Snow, D. (2003). Detecting pedestrians using patterns of motion\nand appearance. In Ninth International Conference on Computer Vision (ICCV 2003),\npp. 734–741, Nice, France.\nViola, P. A. and Jones, M. J. (2004). Robust real-time face detection. International Journal\nof Computer Vision, 57(2):137–154.\nVlasic, D., Baran, I., Matusik, W., and Popovi´c, J. (2008). Articulated mesh animation\nfrom multi-view silhouettes. ACM Transactions on Graphics, 27(3).\nVlasic, D., Brand, M., Pﬁster, H., and Popovi´c, J. (2005). Face transfer with multilinear\nmodels. ACM Transactions on Graphics (Proc. SIGGRAPH 2005), 24(3):426–433.",
  "image_path": "page_938.jpg",
  "pages": [
    937,
    938,
    939
  ]
}