{
  "doc_id": "pages_506_508",
  "text": "484\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 10.15\nBracketed set of exposures captured with a ﬁlm camera and the resulting\nradiance image displayed in pseudocolor (Debevec and Malik 1997) c⃝1997 ACM.\n(a)\n(b)\n(c)\n(d)\n(e)\nFigure 10.16\nMerging multiple exposures to create a high dynamic range composite (Kang,\nUyttendaele, Winder et al. 2003): (a–c) three different exposures; (d) merging the exposures\nusing classic algorithms (note the ghosting due to the horse’s head movement); (e) merging\nthe exposures with motion compensation.\n10.2 High dynamic range imaging\n485\n(a)\n(b)\n(c)\nFigure 10.17 HDR merging with large amounts of motion (Eden, Uyttendaele, and Szeliski\n2006) c⃝2006 IEEE: (a) registered bracketed input images; (b) results after the ﬁrst pass of\nimage selection: reference labels, image, and tone-mapped image; (c) results after the second\npass of image selection: ﬁnal labels, compressed HDR image, and tone-mapped image\nthe weighting function must emphasize both higher pixel values and larger gradients in the\ntransfer function, i.e.,\nw(z) = g(z)/g′(z),\n(10.10)\nwhere the weights w are used to form the ﬁnal irradiance estimate\nlog Ei =\nP\nj w(zij)[g(zij) −log tj]\nP\nj w(zij)\n.\n(10.11)\nExercise 10.1 has you implement one of the radiometric response function calibration tech-\nniques and then use it to create radiance maps.\nUnder real-world conditions, casually acquired images may not be perfectly registered\nand may contain moving objects. Ward (2003) uses a global (parametric) transform to align\nthe input images, while Kang, Uyttendaele, Winder et al. (2003) present an algorithm that\ncombines global registration with local motion estimation (optical ﬂow) to accurately align\nthe images before blending their radiance estimates (Figure 10.16). Since the images may\n486\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 10.18 Fuji SuperCCD high dynamic range image sensor. The paired large and small\nactive areas provide two different effective exposures.\nhave widely different exposures, care must be taken when estimating the motions, which must\nthemselves be checked for consistency to avoid the creation of ghosts and object fragments.\nEven this approach, however, may not work when the camera is simultaneously undergo-\ning large panning motions and exposure changes, which is a common occurrence in casually\nacquired panoramas. Under such conditions, different parts of the image may be seen at one\nor more exposures. Devising a method to blend all of these different sources while avoid-\ning sharp transitions and dealing with scene motion is a challenging problem. One approach\nis to ﬁrst ﬁnd a consensus mosaic and to then selectively compute radiances in under- and\nover-exposed regions (Eden, Uyttendaele, and Szeliski 2006), as shown in Figure 10.17.\nRecently, some cameras, such as the Sony α550 and Pentax K-7, have started integrating\nmultiple exposure merging and tone mapping directly into the camera body. In the future,\nthe need to compute high dynamic range images from multiple exposures may be eliminated\nby advances in camera sensor technology (Figure 10.18) (Yang, El Gamal, Fowler et al.\n1999; Nayar and Mitsunaga 2000; Nayar and Branzoi 2003; Kang, Uyttendaele, Winder et\nal. 2003; Narasimhan and Nayar 2005; Tumblin, Agrawal, and Raskar 2005). However, the\nneed to blend such images and to tone map them to lower-gamut displays is likely to remain.\nHDR image formats.\nBefore we discuss techniques for mapping HDR images back to a\ndisplayable gamut, we should discuss the commonly used formats for storing HDR images.\nIf storage space is not an issue, storing each of the R, G, and B values as a 32-bit IEEE\nﬂoat is the best solution. The commonly used Portable PixMap (.ppm) format, which supports\nboth uncompressed ASCII and raw binary encodings of values, can be extended to a Portable\nFloatMap (.pfm) format by modifying the header. TIFF also supports full ﬂoating point\nvalues.\nA more compact representation is the Radiance format (.pic, .hdr) (Ward 1994), which\nuses a single common exponent and per-channel mantissas (10.19b). An intermediate encod-",
  "image_path": "page_507.jpg",
  "pages": [
    506,
    507,
    508
  ]
}