{
  "doc_id": "pages_382_384",
  "text": "360\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nAdditional cues, such as the appearance and disappearance of points, or perspective effects,\nboth of which are discussed below, can be used to remove this ambiguity.\nFor motion models other than pure orthography, e.g., for scaled orthography or para-\nperspective, the approach above must be extended in the appropriate manner. Such tech-\nniques are relatively straightforward to derive from ﬁrst principles; more details can be found\nin papers that extend the basic factorization approach to these more ﬂexible models (Poel-\nman and Kanade 1997). Additional extensions of the original factorization algorithm include\nmulti-body rigid motion (Costeira and Kanade 1995), sequential updates to the factorization\n(Morita and Kanade 1997), the addition of lines and planes (Morris and Kanade 1998), and\nre-scaling the measurements to incorporate individual location uncertainties (Anandan and\nIrani 2002).\nA disadvantage of factorization approaches is that they require a complete set of tracks,\ni.e., each point must be visible in each frame, in order for the factorization approach to work.\nTomasi and Kanade (1992) deal with this problem by ﬁrst applying factorization to smaller\ndenser subsets and then using known camera (motion) or point (structure) estimates to hallu-\ncinate additional missing values, which allows them to incrementally incorporate more fea-\ntures and cameras. Huynh, Hartley, and Heyden (2003) extend this approach to view missing\ndata as special cases of outliers. Buchanan and Fitzgibbon (2005) develop fast iterative al-\ngorithms for performing large matrix factorizations with missing data. The general topic of\nprincipal component analysis (PCA) with missing data also appears in other computer vision\nproblems (Shum, Ikeuchi, and Reddy 1995; De la Torre and Black 2003; Gross, Matthews,\nand Baker 2006; Torresani, Hertzmann, and Bregler 2008; Vidal, Ma, and Sastry 2010).\n7.3.1 Perspective and projective factorization\nAnother disadvantage of regular factorization is that it cannot deal with perspective cameras.\nOne way to get around this problem is to perform an initial afﬁne (e.g., orthographic) recon-\nstruction and to then correct for the perspective effects in an iterative manner (Christy and\nHoraud 1996).\nObserve that the object-centered projection model (2.76)\nxji\n=\nsj\nrxj · pi + txj\n1 + ηjrzj · pi\n(7.46)\nyji\n=\nsj\nryj · pi + tyj\n1 + ηjrzj · pi\n(7.47)\ndiffers from the scaled orthographic projection model (7.40) by the inclusion of the denomi-\nnator terms (1 + ηjrzj · pi).12\n12 Assuming that the optical center (cx, cy) lies at (0, 0) and that pixels are square.\n7.3 Factorization\n361\nIf we knew the correct values of ηj = t−1\nzj and the structure and motion parameters Rj and\npi, we could cross-multiply the left hand side (visible point measurements xji and yji) by the\ndenominator and get corrected values, for which the bilinear projection model (7.40) is exact.\nIn practice, after an initial reconstruction, the values of ηj can be estimated independently\nfor each frame by comparing reconstructed and sensed point positions. (The third row of the\nrotation matrix rzj is always available as the cross-product of the ﬁrst two rows.) Note that\nsince the ηj are determined from the image measurements, the cameras do not have to be\npre-calibrated, i.e., their focal lengths can be recovered from fj = sj/ηj.\nOnce the ηj have been estimated, the feature locations can then be corrected before apply-\ning another round of factorization. Note that because of the initial depth reversal ambiguity,\nboth reconstructions have to be tried while calculating ηj. (The incorrect reconstruction will\nresult in a negative ηj, which is not physically meaningful.) Christy and Horaud (1996) report\nthat their algorithm usually converges in three to ﬁve iterations, with the majority of the time\nspent in the SVD computation.\nAn alternative approach, which does not assume partially calibrated cameras (known op-\ntical center, square pixels, and zero skew) is to perform a fully projective factorization (Sturm\nand Triggs 1996; Triggs 1996). In this case, the inclusion of the third row of the camera\nmatrix in (7.40) is equivalent to multiplying each reconstructed measurement xji = M jpi\nby its inverse (projective) depth ηji = d−1\nji = 1/(P j2pi) or, equivalently, multiplying each\nmeasured position by its projective depth dji,\nˆ\nX =\n\n\nd11˜x11\n· · ·\nd1i˜x1i\n· · ·\nd1N ˜x1N\n...\n...\n...\ndj1˜xj1\n· · ·\ndji˜xji\n· · ·\ndjN ˜xjN\n...\n...\n...\ndM1˜xM1 · · · dMi˜xMi · · · dMN ˜xMN\n\n\n= ˆ\nM ˆS.\n(7.48)\nIn the original paper by Sturm and Triggs (1996), the projective depths dji are obtained from\ntwo-frame reconstructions, while in later work (Triggs 1996; Oliensis and Hartley 2007), they\nare initialized to dji = 1 and updated after each iteration. Oliensis and Hartley (2007) present\nan update formula that is guaranteed to converge to a ﬁxed point. None of these authors\nsuggest actually estimating the third row of P j as part of the projective depth computations.\nIn any case, it is unclear when a fully projective reconstruction would be preferable to a\npartially calibrated one, especially if they are being used to initialize a full bundle adjustment\nof all the parameters.\nOne of the attractions of factorization methods is that they provide a “closed form” (some-\ntimes called a “linear”) method to initialize iterative techniques such as bundle adjustment.\nAn alternative initialization technique is to estimate the homographies corresponding to some\n362\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\nFigure 7.6\n3D teacup model reconstructed from a 240-frame video sequence (Tomasi and\nKanade 1992) c⃝1992 Springer: (a) ﬁrst frame of video; (b) last frame of video; (c) side\nview of 3D model; (d) top view of 3D model.\ncommon plane seen by all the cameras (Rother and Carlsson 2002). In a calibrated camera\nsetting, this can correspond to estimating consistent rotations for all of the cameras, for ex-\nample, using matched vanishing points (Antone and Teller 2002). Once these have been\nrecovered, the camera positions can then be obtained by solving a linear system (Antone and\nTeller 2002; Rother and Carlsson 2002; Rother 2003).\n7.3.2 Application: Sparse 3D model extraction\nOnce a multi-view 3D reconstruction of the scene has been estimated, it then becomes possi-\nble to create a texture-mapped 3D model of the object and to look at it from new directions.\nThe ﬁrst step is to create a denser 3D model than the sparse point cloud that structure\nfrom motion produces. One alternative is to run dense multi-view stereo (Sections 11.3–\n11.6). Alternatively, a simpler technique such as 3D triangulation can be used, as shown in\nFigure 7.6, in which 207 reconstructed 3D points are triangulated to produce a surface mesh.\nIn order to create a more realistic model, a texture map can be extracted for each trian-\ngle face. The equations to map points on the surface of a 3D triangle to a 2D image are\nstraightforward: just pass the local 2D coordinates on the triangle through the 3 × 4 camera\nprojection matrix to obtain a 3 × 3 homography (planar perspective projection). When mul-\ntiple source images are available, as is usually the case in multi-view reconstruction, either\nthe closest and most fronto-parallel image can be used or multiple images can be blended in\nto deal with view-dependent foreshortening (Wang, Kang, Szeliski et al. 2001) or to obtain\nsuper-resolved results (Goldluecke and Cremers 2009) Another alternative is to create a sep-\narate texture map from each reference camera and to blend between them during rendering,\nwhich is known as view-dependent texture mapping (Section 13.1.1) (Debevec, Taylor, and\nMalik 1996; Debevec, Yu, and Borshukov 1998).",
  "image_path": "page_383.jpg",
  "pages": [
    382,
    383,
    384
  ]
}