{
  "doc_id": "pages_578_580",
  "text": "556\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nProblems with dynamic programming stereo include the selection of the right cost for\noccluded pixels and the difﬁculty of enforcing inter-scanline consistency, although several\nmethods propose ways of addressing the latter (Ohta and Kanade 1985; Belhumeur 1996;\nCox, Hingorani, Rao et al. 1996; Bobick and Intille 1999; Birchﬁeld and Tomasi 1999;\nKolmogorov, Criminisi, Blake et al. 2006). Another problem is that the dynamic program-\nming approach requires enforcing the monotonicity or ordering constraint (Yuille and Poggio\n1984). This constraint requires that the relative ordering of pixels on a scanline remain the\nsame between the two views, which may not be the case in scenes containing narrow fore-\nground objects.\nAn alternative to traditional dynamic programming, introduced by Scharstein and Szeliski\n(2002), is to neglect the vertical smoothness constraints in (11.10) and simply optimize in-\ndependent scanlines in the global energy function (11.8), which can easily be done using a\nrecursive algorithm,\nD(x, y, d) = C(x, y, d) + min\nd′ {D(x −1, y, d′) + ρd(d −d′)} .\n(11.14)\nThe advantage of this scanline optimization algorithm is that it computes the same represen-\ntation and minimizes a reduced version of the same energy function as the full 2D energy\nfunction (11.8). Unfortunately, it still suffers from the same streaking artifacts as dynamic\nprogramming.\nA much better approach is to evaluate the cumulative cost function (11.14) from multiple\ndirections, e.g, from the eight cardinal directions, N, E, W, S, NE, SE, SW, NW (Hirschm¨uller\n2008). The resulting semi-global optimization performs quite well and is extremely efﬁcient\nto implement.\nEven though dynamic programming and scanline optimization algorithms do not gen-\nerally produce the most accurate stereo reconstructions, when combined with sophisticated\naggregation strategies, they can produce very fast and high-quality results.\n11.5.2 Segmentation-based techniques\nWhile most stereo matching algorithms perform their computations on a per-pixel basis, some\nof the more recent techniques ﬁrst segment the images into regions and then try to label each\nregion with a disparity.\nFor example, Tao, Sawhney, and Kumar (2001) segment the reference image, estimate\nper-pixel disparities using a local technique, and then do local plane ﬁts inside each segment\nbefore applying smoothness constraints between neighboring segments. Zitnick, Kang, Uyt-\ntendaele et al. (2004) and Zitnick and Kang (2007) use over-segmentation to mitigate initial\nbad segmentations. After a set of initial cost values for each segment has been stored into\na disparity space distribution (DSD), iterative relaxation (or loopy belief propagation, in the\n11.5 Global optimization\n557\n(a)\n(b)\n(c)\n(d)\n(e)\nFigure 11.12 Segmentation-based stereo matching (Zitnick, Kang, Uyttendaele et al. 2004)\nc⃝2004 ACM: (a) input color image; (b) color-based segmentation; (c) initial disparity es-\ntimates; (d) ﬁnal piecewise-smoothed disparities; (e) MRF neighborhood deﬁned over the\nsegments in the disparity space distribution (Zitnick and Kang 2007) c⃝2007 Springer.\n(a)\n(b)\nFigure 11.13\nStereo matching with adaptive over-segmentation and matting (Taguchi,\nWilburn, and Zitnick 2008) c⃝2008 IEEE: (a) segment boundaries are reﬁned during the\noptimization, leading to more accurate results (e.g., the thin green leaf in the bottom row); (b)\nalpha mattes are extracted at segment boundaries, which leads to visually better compositing\nresults (middle column).\nmore recent work of Zitnick and Kang (2007)) is used to adjust the disparity estimates for\neach segment, as shown in Figure 11.12. Taguchi, Wilburn, and Zitnick (2008) reﬁne the\nsegment shapes as part of the optimization process, which leads to much improved results, as\nshown in Figure 11.13.\nEven more accurate results are obtained by Klaus, Sormann, and Karner (2006), who ﬁrst\nsegment the reference image using mean shift, run a small (3 × 3) SAD plus gradient SAD\n(weighted by cross-checking) to get initial disparity estimates, ﬁt local planes, re-ﬁt with\nglobal planes, and then run a ﬁnal MRF on plane assignments with loopy belief propagation.\nWhen the algorithm was ﬁrst introduced in 2006, it was the top ranked algorithm on the\nevaluation site at http://vision.middlebury.edu/stereo; in early 2010, it still had the top rank\non the new evaluation datasets.\nThe highest ranked algorithm, by Wang and Zheng (2008), follows a similar approach of\nsegmenting the image, doing local plane ﬁts, and then performing cooperative optimization\n558\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nof neighboring plane ﬁt parameters. Another highly ranked algorithm, by Yang, Wang, Yang\net al. (2009), uses the color correlation approach of Yoon and Kweon (2006) and hierarchical\nbelief propagation to obtain an initial set of disparity estimates. After left–right consistency\nchecking to detect occluded pixels, the data terms for low-conﬁdence and occluded pixels\nare recomputed using segmentation-based plane ﬁts and one or more rounds of hierarchical\nbelief propagation are used to obtain the ﬁnal disparity estimates.\nAnother important ability of segmentation-based stereo algorithms, which they share with\nalgorithms that use explicit layers (Baker, Szeliski, and Anandan 1998; Szeliski and Golland\n1999) or boundary extraction (Hasinoff, Kang, and Szeliski 2006), is the ability to extract\nfractional pixel alpha mattes at depth discontinuities (Bleyer, Gelautz, Rother et al. 2009).\nThis ability is crucial when attempting to create virtual view interpolation without clinging\nboundary or tearing artifacts (Zitnick, Kang, Uyttendaele et al. 2004) and also to seamlessly\ninsert virtual objects (Taguchi, Wilburn, and Zitnick 2008), as shown in Figure 11.13b.\nSince new stereo matching algorithms continue to be introduced every year, it is a good\nidea to periodically check the Middlebury evaluation site at http://vision.middlebury.edu/\nstereo for a listing of the most recent algorithms to be evaluated.\n11.5.3 Application: Z-keying and background replacement\nAnother application of real-time stereo matching is z-keying, which is the process of seg-\nmenting a foreground actor from the background using depth information, usually for the\npurpose of replacing the background with some computer-generated imagery, as shown in\nFigure 11.2g.\nOriginally, z-keying systems required expensive custom-built hardware to produce the\ndesired depth maps in real time and were, therefore, restricted to broadcast studio applica-\ntions (Kanade, Yoshida, Oda et al. 1996; Iddan and Yahav 2001). Off-line systems were also\ndeveloped for estimating 3D multi-viewpoint geometry from video streams (Section 13.5.4)\n(Kanade, Rander, and Narayanan 1997; Carranza, Theobalt, Magnor et al. 2003; Zitnick,\nKang, Uyttendaele et al. 2004; Vedula, Baker, and Kanade 2005). Recent advances in highly\naccurate real-time stereo matching, however, now make it possible to perform z-keying on\nregular PCs, enabling desktop videoconferencing applications such as those shown in Fig-\nure 11.14 (Kolmogorov, Criminisi, Blake et al. 2006).\n11.6 Multi-view stereo\nWhile matching pairs of images is a useful way of obtaining depth information, matching\nmore images can lead to even better results. In this section, we review not only techniques for",
  "image_path": "page_579.jpg",
  "pages": [
    578,
    579,
    580
  ]
}