{
  "doc_id": "pages_084_086",
  "text": "62\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nn^\nvi\ndx\nn^\nvr\n^\ndy^\nθi\nφi\nφr\nθr\n^\n^\n(a)\n(b)\nFigure 2.15\n(a) Light scatters when it hits a surface. (b) The bidirectional reﬂectance\ndistribution function (BRDF) f(θi, φi, θr, φr) is parameterized by the angles that the inci-\ndent, ˆvi, and reﬂected, ˆvr, light ray directions make with the local surface coordinate frame\n( ˆdx, ˆdy, ˆn).\n2.2.2 Reﬂectance and shading\nWhen light hits an object’s surface, it is scattered and reﬂected (Figure 2.15a). Many different\nmodels have been developed to describe this interaction. In this section, we ﬁrst describe the\nmost general form, the bidirectional reﬂectance distribution function, and then look at some\nmore specialized models, including the diffuse, specular, and Phong shading models. We also\ndiscuss how these models can be used to compute the global illumination corresponding to a\nscene.\nThe Bidirectional Reﬂectance Distribution Function (BRDF)\nThe most general model of light scattering is the bidirectional reﬂectance distribution func-\ntion (BRDF).5 Relative to some local coordinate frame on the surface, the BRDF is a four-\ndimensional function that describes how much of each wavelength arriving at an incident\ndirection ˆvi is emitted in a reﬂected direction ˆvr (Figure 2.15b). The function can be written\nin terms of the angles of the incident and reﬂected directions relative to the surface frame as\nfr(θi, φi, θr, φr; λ).\n(2.81)\nThe BRDF is reciprocal, i.e., because of the physics of light transport, you can interchange\nthe roles of ˆvi and ˆvr and still get the same answer (this is sometimes called Helmholtz\nreciprocity).\n5 Actually, even more general models of light transport exist, including some that model spatial variation along\nthe surface, sub-surface scattering, and atmospheric effects—see Section 12.7.1—(Dorsey, Rushmeier, and Sillion\n2007; Weyrich, Lawrence, Lensch et al. 2008).\n2.2 Photometric image formation\n63\nMost surfaces are isotropic, i.e., there are no preferred directions on the surface as far\nas light transport is concerned. (The exceptions are anisotropic surfaces such as brushed\n(scratched) aluminum, where the reﬂectance depends on the light orientation relative to the\ndirection of the scratches.) For an isotropic material, we can simplify the BRDF to\nfr(θi, θr, |φr −φi|; λ) or fr(ˆvi, ˆvr, ˆn; λ),\n(2.82)\nsince the quantities θi, θr and φr −φi can be computed from the directions ˆvi, ˆvr, and ˆn.\nTo calculate the amount of light exiting a surface point p in a direction ˆvr under a given\nlighting condition, we integrate the product of the incoming light Li(ˆvi; λ) with the BRDF\n(some authors call this step a convolution). Taking into account the foreshortening factor\ncos+ θi, we obtain\nLr(ˆvr; λ) =\nZ\nLi(ˆvi; λ)fr(ˆvi, ˆvr, ˆn; λ) cos+ θi dˆvi,\n(2.83)\nwhere\ncos+ θi = max(0, cos θi).\n(2.84)\nIf the light sources are discrete (a ﬁnite number of point light sources), we can replace the\nintegral with a summation,\nLr(ˆvr; λ) =\nX\ni\nLi(λ)fr(ˆvi, ˆvr, ˆn; λ) cos+ θi.\n(2.85)\nBRDFs for a given surface can be obtained through physical modeling (Torrance and\nSparrow 1967; Cook and Torrance 1982; Glassner 1995), heuristic modeling (Phong 1975), or\nthrough empirical observation (Ward 1992; Westin, Arvo, and Torrance 1992; Dana, van Gin-\nneken, Nayar et al. 1999; Dorsey, Rushmeier, and Sillion 2007; Weyrich, Lawrence, Lensch\net al. 2008).6 Typical BRDFs can often be split into their diffuse and specular components,\nas described below.\nDiffuse reﬂection\nThe diffuse component (also known as Lambertian or matte reﬂection) scatters light uni-\nformly in all directions and is the phenomenon we most normally associate with shading,\ne.g., the smooth (non-shiny) variation of intensity with surface normal that is seen when ob-\nserving a statue (Figure 2.16). Diffuse reﬂection also often imparts a strong body color to\nthe light since it is caused by selective absorption and re-emission of light inside the object’s\nmaterial (Shafer 1985; Glassner 1995).\n6 See http://www1.cs.columbia.edu/CAVE/software/curet/ for a database of some empirically sampled BRDFs.\n64\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 2.16\nThis close-up of a statue shows both diffuse (smooth shading) and specular\n(shiny highlight) reﬂection, as well as darkening in the grooves and creases due to reduced\nlight visibility and interreﬂections. (Photo courtesy of the Caltech Vision Lab, http://www.\nvision.caltech.edu/archive.html.)\nWhile light is scattered uniformly in all directions, i.e., the BRDF is constant,\nfd(ˆvi, ˆvr, ˆn; λ) = fd(λ),\n(2.86)\nthe amount of light depends on the angle between the incident light direction and the surface\nnormal θi. This is because the surface area exposed to a given amount of light becomes larger\nat oblique angles, becoming completely self-shadowed as the outgoing surface normal points\naway from the light (Figure 2.17a). (Think about how you orient yourself towards the sun or\nﬁreplace to get maximum warmth and how a ﬂashlight projected obliquely against a wall is\nless bright than one pointing directly at it.) The shading equation for diffuse reﬂection can\nthus be written as\nLd(ˆvr; λ) =\nX\ni\nLi(λ)fd(λ) cos+ θi =\nX\ni\nLi(λ)fd(λ)[ˆvi · ˆn]+,\n(2.87)\nwhere\n[ˆvi · ˆn]+ = max(0, ˆvi · ˆn).\n(2.88)\nSpecular reﬂection\nThe second major component of a typical BRDF is specular (gloss or highlight) reﬂection,\nwhich depends strongly on the direction of the outgoing light. Consider light reﬂecting off a\nmirrored surface (Figure 2.17b). Incident light rays are reﬂected in a direction that is rotated\nby 180◦around the surface normal ˆn. Using the same notation as in Equations (2.29–2.30),",
  "image_path": "page_085.jpg",
  "pages": [
    84,
    85,
    86
  ]
}