{
  "doc_id": "pages_696_698",
  "text": "674\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 14.15 Images from the Harvard database used by Belhumeur, Hespanha, and Krieg-\nman (1997) c⃝1997 IEEE. Note the wide range of illumination variation, which can be more\ndramatic than inter-personal variations.\nOne of the biggest advantages of using eigenfaces is that they reduce the comparison\nof a new face image x to a prototype (training) face image xk (one of the colored xs in\nFigure 14.14) from a P-dimensional difference in pixel space to an M-dimensional difference\nin face space,\n∥x −xk∥= ∥a −ak∥,\n(14.16)\nwhere a = U T (x −m) (14.11) involves computing a dot product between the signed\ndifference-from-mean image (x −m) and each of the eigenfaces ui. Once again, however,\nthis Euclidean distance ignores the fact that we have more information about face likelihoods\navailable in the distribution of training images.\nConsider the set of images of one person taken under a wide range of illuminations shown\nin Figure 14.15. As you can see, the intrapersonal variability within these images is much\ngreater than the typical extrapersonal variability between any two people taken under the\nsame illumination. Regular PCA analysis fails to distinguish between these two sources of\nvariability and may, in fact, devote most of its principal components to modeling the intrap-\nersonal variability.\nIf we are going to approximate faces by a linear subspace, it is more useful to have a\nspace that discriminates between different classes (people) and is less sensitive to within-class\nvariations (Belhumeur, Hespanha, and Kriegman 1997). Consider the three classes shown as\ndifferent colors in Figure 14.16. As you can see, the distributions within a class (indicated\nby the tilted colored axes) are elongated and tilted with respect to the main face space PCA,\n14.2 Face recognition\n675\n-2\n-1\n0\n1\n2\n-3\n-2\n-1\n0\n1\n2\n3\nFigure 14.16\nSimple example of Fisher linear discriminant analysis. The samples come\nfrom three different classes, shown in different colors along with their principal axes, which\nare scaled to 2σi. (The intersections of the tilted axes are the class means mk.) The dashed\nline is the (dominant) Fisher linear discriminant direction and the dotted lines are the linear\ndiscriminants between the classes. Note how the discriminant direction is a blend between\nthe principal directions of the between-class and within-class scatter matrices.\nwhich is aligned with the black x and y axes. We can compute the total within-class scatter\nmatrix as\nSW =\nK−1\nX\nk=0\nSk =\nK−1\nX\nk=0\nX\ni∈Ck\n(xi −mk)(xi −mk)T ,\n(14.17)\nwhere mk is the mean of class k and Sk is its within-class scatter matrix.11 Similarly, we\ncan compute the between-class scatter as\nSB =\nK−1\nX\nk=0\nNk(mk −m)(mk −m)T ,\n(14.18)\nwhere Nk are the number of exemplars in each class and m is the overall mean. For the three\ndistributions shown in Figure 14.16, we have\nSW = 3N\n\"\n0.246\n0.183\n0.183\n0.457\n#\nand\nSB = N\n\"\n6.125\n0\n0\n0.375\n#\n,\n(14.19)\n11 To be consistent with Belhumeur, Hespanha, and Kriegman (1997), we use SW and SB to denote the scatter\nmatrices, even though we use C elsewhere (14.9).\n676\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nwhere N = Nk = 13 is the number of samples in each class.\nTo compute the most discriminating direction, Fisher’s linear discriminant (FLD) (Bel-\nhumeur, Hespanha, and Kriegman 1997; Hastie, Tibshirani, and Friedman 2001; Bishop\n2006), which is also known as linear discriminant analysis (LDA), selects the direction u\nthat results in the largest ratio between the projected between-class and within-class varia-\ntions\nu∗= arg max\nu\nuT SBu\nuT SWu,\n(14.20)\nwhich is equivalent to ﬁnding the eigenvector corresponding to the largest eigenvalue of the\ngeneralized eigenvalue problem\nSBu = λSWu\nor\nλu = S−1\nW SBu.\n(14.21)\nFor the problem shown in Figure 14.16,\nS−1\nW SB =\n\"\n11.796\n−0.289\n−4.715\n0.3889\n#\nand\nu =\n\"\n0.926\n−0.379\n#\n(14.22)\nAs you can see, using this direction results in a better separation between the classes than\nusing the dominant PCA direction, which is the horizontal axis. In their paper, Belhumeur,\nHespanha, and Kriegman (1997) show that Fisherfaces signiﬁcantly outperform the original\neigenfaces algorithm, especially when faces have large amounts of illumination variation, as\nin Figure 14.15.\nAn alternative for modeling within-class (intrapersonal) and between-class (extraper-\nsonal) variations is to model each distribution separately and then use Bayesian techniques\nto ﬁnd the closest exemplar (Moghaddam, Jebara, and Pentland 2000). Instead of computing\nthe mean for each class and then the within-class and between-class distributions, consider\nevaluating the difference images\n∆ij = xi −xj\n(14.23)\nbetween all pairs of training images (xi, xj). The differences between pairs that are in the\nsame class (the same person) are used to estimate the intrapersonal covariance matrix ΣI,\nwhile differences between different people are used to estimate the extrapersonal covariance\nΣE.12 The principal components (eigenfaces) corresponding to these two classes are shown\nin Figure 14.17.\nAt recognition time, we can compute the distance ∆i between a new face x and a stored\ntraining image xi and evaluate its intrapersonal likelihood as\npI(∆i) = pN (∆i; ΣI) =\n1\n|2πΣI|1/2 exp −∥∆i∥2\nΣ\n−1\nI ,\n(14.24)\n12 Note that the difference distributions are zero mean because for every ∆ij there corresponds a negative ∆ji.",
  "image_path": "page_697.jpg",
  "pages": [
    696,
    697,
    698
  ]
}