{
  "doc_id": "pages_751_753",
  "text": "14.8 Exercises\n729\nEx 14.15: Tiny images\nDownload the tiny images database from http://people.csail.mit.\nedu/torralba/tinyimages/ and build a classiﬁer based on comparing your test images directly\nagainst all of the labeled training images. Does this seem like a promising approach?\n730\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nChapter 15\nConclusion\nIn this book, we have covered a broad range of computer vision topics. Starting with image\nformation, we have seen how images can be pre-processed to remove noise or blur, segmented\ninto regions, or converted into feature descriptors. Multiple images can be matched and\nregistered, with the results used to estimate motion, track people, reconstruct 3D models,\nor merge images into more attractive and interesting composites and renderings. Images can\nalso be analyzed to produce semantic descriptions of their content. However, the gap between\ncomputer and human performance in this area is still large and is likely to remain so for many\nyears.\nOur study has also exposed us to a wide range of mathematical techniques. These include\ncontinuous mathematics, such as signal processing, variational approaches, three-dimensional\nand projective geometry, linear algebra, and least squares. We have also studied topics in\ndiscrete mathematics and computer science, such as graph algorithms, combinatorial opti-\nmization, and even database techniques for information retrieval. Since many problems in\ncomputer vision are inverse problems that involve estimating unknown quantities from noisy\ninput data, we have also looked at Bayesian statistical inference techniques, as well as ma-\nchine learning techniques to learn probabilistic models from large amounts of training data.\nAs the availability of partially labeled visual imagery on the Internet continues to increase\nexponentially, this latter approach will continue to have a major impact on our ﬁeld.\nYou may ask: why is our ﬁeld so broad and aren’t there any unifying principles that can\nbe used to simplify our study? Part of the answer lies in the expansive deﬁnition of com-\nputer vision, which is the analysis of images and video, as well as the incredible complexity\ninherent in the formation of visual imagery. In some ways, our ﬁeld is as complex as the\nstudy of automotive engineering, which requires an understanding of internal combustion,\nmechanics, aerodynamics, ergonomics, electrical circuitry, and control systems, among other",
  "image_path": "page_752.jpg",
  "pages": [
    751,
    752,
    753
  ]
}