{
  "doc_id": "pages_833_835",
  "text": "References\n811\nChiu, K. and Raskar, R. (2009). Computer vision on tap. In Second IEEE Workshop on\nInternet Vision, Miami Beach, Florida.\nChou, P. B. and Brown, C. M. (1990). The theory and practice of Bayesian image labeling.\nInternational Journal of Computer Vision, 4(3):185–210.\nChristensen, G., Joshi, S., and Miller, M.\n(1997).\nVolumetric transformation of brain\nanatomy. IEEE Transactions on Medical Imaging, 16(6):864–877.\nChristy, S. and Horaud, R. (1996). Euclidean shape and motion from multiple perspec-\ntive views by afﬁne iterations. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 18(11):1098–1104.\nChuang, Y.-Y., Curless, B., Salesin, D. H., and Szeliski, R. (2001). A Bayesian approach to\ndigital matting. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2001), pp. 264–271, Kauai, Hawaii.\nChuang, Y.-Y., Agarwala, A., Curless, B., Salesin, D. H., and Szeliski, R. (2002). Video\nmatting of complex scenes. ACM Transactions on Graphics (Proc. SIGGRAPH 2002),\n21(3):243–248.\nChuang, Y.-Y., Goldman, D. B., Curless, B., Salesin, D. H., and Szeliski, R.\n(2003).\nShadow matting. ACM Transactions on Graphics (Proc. SIGGRAPH 2003), 22(3):494–\n500.\nChuang, Y.-Y., Goldman, D. B., Zheng, K. C., Curless, B., Salesin, D. H., and Szeliski,\nR. (2005). Animating pictures with stochastic motion textures. ACM Transactions on\nGraphics (Proc. SIGGRAPH 2005), 24(3):853–860.\nChuang, Y.-Y., Zongker, D., Hindorff, J., Curless, B., Salesin, D. H., and Szeliski, R.\n(2000). Environment matting extensions: Towards higher accuracy and real-time cap-\nture. In ACM SIGGRAPH 2000 Conference Proceedings, pp. 121–130, New Orleans.\nChui, C. K. (1992). Wavelet Analysis and Its Applications. Academic Press, New York.\nChum, O. and Matas, J. (2005). Matching with PROSAC—progressive sample consensus.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 220–226, San Diego, CA.\nChum, O. and Matas, J. (2010). Large-scale discovery of spatially related images. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 32(2):371–377.\nChum, O., Philbin, J., and Zisserman, A. (2008). Near duplicate image detection: min-\nhash and tf-idf weighting. In British Machine Vision Conference (BMVC 2008), Leeds,\nEngland.\n812\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nChum, O., Philbin, J., Sivic, J., Isard, M., and Zisserman, A. (2007). Total recall: Auto-\nmatic query expansion with a generative feature model for object retrieval. In Eleventh\nInternational Conference on Computer Vision (ICCV 2007), Rio de Janeiro, Brazil.\nCipolla, R. and Blake, A. (1990). The dynamic analysis of apparent contours. In Third\nInternational Conference on Computer Vision (ICCV’90), pp. 616–623, Osaka, Japan.\nCipolla, R. and Blake, A. (1992). Surface shape from the deformation of apparent contours.\nInternational Journal of Computer Vision, 9(2):83–112.\nCipolla, R. and Giblin, P. (2000). Visual Motion of Curves and Surfaces. Cambridge\nUniversity Press, Cambridge.\nCipolla, R., Drummond, T., and Robertson, D. P. (1999). Camera calibration from van-\nishing points in images of architectural scenes. In British Machine Vision Conference\n(BMVC99).\nClaus, D. and Fitzgibbon, A. (2005). A rational function lens distortion model for gen-\neral cameras. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’2005), pp. 213–219, San Diego, CA.\nClowes, M. B. (1971). On seeing things. Artiﬁcial Intelligence, 2:79–116.\nCohen, L. D. and Cohen, I. (1993). Finite-element methods for active contour models and\nballoons for 2-D and 3-D images. IEEE Transactions on Pattern Analysis and Machine\nIntelligence, 15(11):1131–1147.\nCohen, M. and Wallace, J. (1993). Radiosity and Realistic Image Synthesis. Morgan\nKaufmann.\nCohen, M. F. and Szeliski, R. (2006). The Moment Camera. Computer, 39(8):40–45.\nCollins, R. T. (1996). A space-sweep approach to true multi-image matching. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR’96),\npp. 358–363, San Francisco.\nCollins, R. T. and Liu, Y. (2003). On-line selection of discriminative tracking features. In\nNinth International Conference on Computer Vision (ICCV 2003), pp. 346–352, Nice,\nFrance.\nCollins, R. T. and Weiss, R. S. (1990). Vanishing point calculation as a statistical inference\non the unit sphere. In Third International Conference on Computer Vision (ICCV’90),\npp. 400–403, Osaka, Japan.\nComaniciu, D. and Meer, P. (2002). Mean shift: A robust approach toward feature space\nanalysis. IEEE Transactions on Pattern Analysis and Machine Intelligence, 24(5):603–\n619.\nReferences\n813\nComaniciu, D. and Meer, P. (2003). An algorithm for data-driven bandwidth selection.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, 25(2):281–288.\nConn, A. R., Gould, N. I. M., and Toint, P. L. (2000). Trust-Region Methods. Society for\nIndustrial and Applied Mathematics, Philadephia.\nCook, R. L. and Torrance, K. E. (1982). A reﬂectance model for computer graphics. ACM\nTransactions on Graphics, 1(1):7–24.\nCoorg, S. and Teller, S. (2000). Spherical mosaics with quaternions and dense correlation.\nInternational Journal of Computer Vision, 37(3):259–273.\nCootes, T., Edwards, G. J., and Taylor, C. J. (2001). Active appearance models. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 23(6):681–685.\nCootes, T., Cooper, D., Taylor, C., and Graham, J. (1995). Active shape models—their\ntraining and application. Computer Vision and Image Understanding, 61(1):38–59.\nCootes, T., Taylor, C., Lanitis, A., Cooper, D., and Graham, J. (1993). Building and using\nﬂexible models incorporating grey-level information. In Fourth International Confer-\nence on Computer Vision (ICCV’93), pp. 242–246, Berlin, Germany.\nCootes, T. F. and Taylor, C. J. (2001). Statistical models of appearance for medical image\nanalysis and computer vision. In Medical Imaging.\nCoquillart, S. (1990). Extended free-form deformations: A sculpturing tool for 3D geo-\nmetric modeling. Computer Graphics (SIGGRAPH ’90), 24(4):187–196.\nCormen, T. H. (2001). Introduction to Algorithms. MIT Press, Cambridge, Massachusetts.\nCornelis, N., Leibe, B., Cornelis, K., and Van Gool, L. (2008). 3D urban scene modeling\nintegrating recognition and reconstruction. International Journal of Computer Vision,\n78(2-3):121–141.\nCorso, J. and Hager, G. (2005). Coherent regions for concise and stable image description.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 184–190, San Diego, CA.\nCosteira, J. and Kanade, T. (1995). A multi-body factorization method for motion analy-\nsis. In Fifth International Conference on Computer Vision (ICCV’95), pp. 1071–1076,\nCambridge, Massachusetts.\nCosten, N., Cootes, T. F., Edwards, G. J., and Taylor, C. J. (1999). Simultaneous extrac-\ntion of functional face subspaces. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR’99), pp. 492–497, Fort Collins.\nCouprie, C., Grady, L., Najman, L., and Talbot, H. (2009). Power watersheds: A new image\nsegmentation framework extending graph cuts, random walker and optimal spanning",
  "image_path": "page_834.jpg",
  "pages": [
    833,
    834,
    835
  ]
}