{
  "doc_id": "pages_532_534",
  "text": "510\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nMishima\nKnockout\nRuzon–Tomasi\nBayesian\nFigure 10.41\nImage matting algorithms (Chuang, Curless, Salesin et al. 2001) c⃝2001\nIEEE. Mishima’s algorithm models global foreground and background color distribution as\npolyhedral surfaces centered around the mean background (blue) color. Knockout uses a lo-\ncal color estimate of foreground and background for each pixel and computes α along each\ncolor axis. Ruzon and Tomasi’s algorithm locally models foreground and background colors\nand variances. Chuang et al.’s Bayesian matting approach computes a MAP estimate of (frac-\ntional) foreground color and opacity given the local foreground and background distributions.\nMore accurate matting results can be obtained if we treat the foreground and background\ncolors as distributions sampled over some region (Figure 10.41g–h). Ruzon and Tomasi\n(2000) model local color distributions as mixtures of (uncorrelated) Gaussians and compute\nthese models in strips. They then ﬁnd the pairing of mixture components F and B that best\ndescribes the observed color C, compute the α as the relative distance between these means,\nand adjust the estimates of F and B so they are collinear with C.\nChuang, Curless, Salesin et al. (2001) and Hillman, Hannah, and Renshaw (2001) use\nfull 3 × 3 color covariance matrices to model mixtures of correlated Gaussians, and compute\nestimates independently for each pixel. Matte extraction proceeds in strips starting from\nknown color values growing into the unknown regions, so that recently computed F and B\ncolors can be used in later stages.\nTo estimate the most likely value of an unknown pixel’s opacity and (unmixed) foreground\nand background colors, Chuang et al. use a fully Bayesian formulation that maximizes\nP(F, B, α|C) = P(C|F, B, α)P(F)P(B)P(α)/P(C).\n(10.32)\n10.4 Image matting and compositing\n511\nFigure 10.42 Natural image matting results (Chuang, Curless, Salesin et al. 2001) c⃝2001\nIEEE. Difference matting and Knockout both perform poorly on this kind of background,\nwhile the more recent natural image matting techniques perform well. Chuang et al.’s results\nare slightly smoother and closer to the ground truth.\n512\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nThis is equivalent to minimizing the negative log likelihood\nL(F, B, α|C) = L(C|F, B, α) + L(F) + L(B) + L(α)\n(10.33)\n(dropping the L(C) term since it is constant).\nLet us examine each of these terms in turn. The ﬁrst, L(C|F, B, α), is the likelihood that\npixel color C was observed given values for the unknowns (F, B, α). If we assume Gaussian\nnoise in our observation with variance σ2\nC, this negative log likelihood (data term) is\nL(C) = 1/2∥C −[αF + (1 −α)B]∥2/σ2\nC,\n(10.34)\nas illustrated in Figure 10.41h.\nThe second term, L(F), corresponds to the likelihood that a particular foreground color F\ncomes from the mixture of Gaussians distribution. After partitioning the sample foreground\ncolors into clusters, a weighted mean and covariance is computed, where the weights are\nproportional to a given foreground pixel’s opacity and distance from the unknown pixel. The\nnegative log likelihood for each cluster is thus given by\nL(F) = (F −F)T Σ−1\nF (F −F).\n(10.35)\nA similar method is used to estimate unknown background color distributions. If the back-\nground is already known, i.e., for blue screen or difference matting applications, its measured\ncolor value and variance are used instead.\nAn alternative to modeling the foreground and background color distributions as mixtures\nof Gaussians is to keep around the original color samples and to compute the most likely\npairings that explain the observed color C (Wang and Cohen 2005, 2007b). These techniques\nare described in more detail in (Wang and Cohen 2007a).\nIn their Bayesian matting paper, Chuang, Curless, Salesin et al. (2001) assume a constant\n(non-informative) distribution for L(α). More recent papers assume this distribution to be\nmore peaked around 0 and 1, or sometimes use Markov random ﬁelds (MRFs) to deﬁne a\nglobal correlated prior on P(α) (Wang and Cohen 2007a).\nTo compute the most likely estimates for (F, B, α), the Bayesian matting algorithm alter-\nnates between computing (F, B) and α, since each of these problems is quadratic and hence\ncan be solved as a small linear system. When several color clusters are estimated, the most\nlikely pairing of foreground and background color clusters is used.\nBayesian image matting produces results that improve on the original natural image mat-\nting algorithm by Ruzon and Tomasi (2000), as can be seen in Figure 10.42. However, com-\npared to more recent techniques (Wang and Cohen 2007a), its performance is not as good for\ncomplex background or inaccurate trimaps (Figure 10.44).",
  "image_path": "page_533.jpg",
  "pages": [
    532,
    533,
    534
  ]
}