{
  "doc_id": "pages_934_936",
  "text": "912\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTorr, P. H. S., Szeliski, R., and Anandan, P. (2001). An integrated Bayesian approach\nto layer extraction from image sequences. IEEE Transactions on Pattern Analysis and\nMachine Intelligence, 23(3):297–303.\nTorralba, A. (2003). Contextual priming for object detection. International Journal of\nComputer Vision, 53(2):169–191.\nTorralba, A.\n(2007).\nClassiﬁer-based methods.\nIn CVPR 2007 Short Course on\nRecognizing and Learning Object Categories.\nhttp://people.csail.mit.edu/torralba/\nshortCourseRLOC/.\nTorralba, A. (2008). Object recognition and scene understanding. MIT Course 6.870,\nhttp://people.csail.mit.edu/torralba/courses/6.870/6.870.recognition.htm.\nTorralba, A., Freeman, W. T., and Fergus, R. (2008). 80 million tiny images: a large\ndataset for non-parametric object and scene recognition. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 30(11):1958–1970.\nTorralba, A., Murphy, K. P., and Freeman, W. T. (2004). Contextual models for object\ndetection using boosted random ﬁelds. In Advances in Neural Information Processing\nSystems.\nTorralba, A., Murphy, K. P., and Freeman, W. T. (2007). Sharing visual features for mul-\nticlass and multiview object detection.\nIEEE Transactions on Pattern Analysis and\nMachine Intelligence, 29(5):854–869.\nTorralba, A., Weiss, Y., and Fergus, R. (2008). Small codes and large databases of images\nfor object recognition. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2008), Anchorage, AK.\nTorralba, A., Murphy, K. P., Freeman, W. T., and Rubin, M. A. (2003). Context-based\nvision system for place and object recognition. In Ninth International Conference on\nComputer Vision (ICCV 2003), pp. 273–280, Nice, France.\nTorrance, K. E. and Sparrow, E. M. (1967). Theory for off-specular reﬂection from rough-\nened surfaces. Journal of the Optical Society of America A, 57(9):1105–1114.\nTorresani, L., Hertzmann, A., and Bregler, C. (2008). Non-rigid structure-from-motion:\nEstimating shape and motion with hierarchical priors. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 30(5):878–892.\nToyama, K. (1998). Prolegomena for Robust Face Tracking. Technical Report MSR-TR-\n98-65, Microsoft Research.\nToyama, K., Krumm, J., Brumitt, B., and Meyers, B. (1999). Wallﬂower: Principles and\npractice of background maintenance. In Seventh International Conference on Computer\nVision (ICCV’99), pp. 255–261, Kerkyra, Greece.\nReferences\n913\nTran, S. and Davis, L. (2002). 3D surface reconstruction using graph cuts with surface con-\nstraints. In Seventh European Conference on Computer Vision (ECCV 2002), pp. 219–\n231, Copenhagen.\nTrefethen, L. N. and Bau, D. (1997). Numerical Linear Algebra. SIAM.\nTreisman, A. (1985). Preattentive processing in vision. Computer Vision, Graphics, and\nImage Processing, 31(2):156–177.\nTriggs, B. (1996). Factorization methods for projective structure and motion. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR’96),\npp. 845–851, San Francisco.\nTriggs, B. (2004). Detecting keypoints with stable position, orientation, and scale un-\nder illumination changes. In Eighth European Conference on Computer Vision (ECCV\n2004), pp. 100–113, Prague.\nTriggs, B., McLauchlan, P. F., Hartley, R. I., and Fitzgibbon, A. W. (1999). Bundle adjust-\nment — a modern synthesis. In International Workshop on Vision Algorithms, pp. 298–\n372, Kerkyra, Greece.\nTrobin, W., Pock, T., Cremers, D., and Bischof, H. (2008). Continuous energy minimiza-\ntion via repeated binary fusion. In Tenth European Conference on Computer Vision\n(ECCV 2008), pp. 677–690, Marseilles.\nTroccoli, A. and Allen, P. (2008). Building illumination coherent 3D models of large-scale\noutdoor scenes. International Journal of Computer Vision, 78(2-3):261–280.\nTrottenberg, U., Oosterlee, C. W., and Schuller, A. (2000). Multigrid. Academic Press.\nTrucco, E. and Verri, A. (1998). Introductory Techniques for 3-D Computer Vision. Pren-\ntice Hall, Upper Saddle River, NJ.\nTsai, P. S. and Shah, M. (1994). Shape from shading using linear approximation. Image\nand Vision Computing, 12:487–498.\nTsai, R. Y. (1987). A versatile camera calibration technique for high-accuracy 3D machine\nvision metrology using off-the-shelf TV cameras and lenses. IEEE Journal of Robotics\nand Automation, RA-3(4):323–344.\nTschumperl´e, D. (2006). Curvature-preserving regularization of multi-valued images using\nPDEs. In Ninth European Conference on Computer Vision (ECCV 2006), pp. 295–307.\nTschumperl´e, D. and Deriche, R. (2005). Vector-valued image regularization with PDEs: A\ncommon framework for different applications. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 27:506–517.\n914\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nTsin, Y., Kang, S. B., and Szeliski, R. (2006). Stereo matching with linear superposition\nof layers. IEEE Transactions on Pattern Analysis and Machine Intelligence, 28(2):290–\n301.\nTsin, Y., Ramesh, V., and Kanade, T.\n(2001).\nStatistical calibration of CCD imaging\nprocess. In Eighth International Conference on Computer Vision (ICCV 2001), pp. 480–\n487, Vancouver, Canada.\nTu, Z., Chen, X., Yuille, A. L., and Zhu, S.-C. (2005). Image parsing: Unifying segmenta-\ntion, detection, and recognition. International Journal of Computer Vision, 63(2):113–\n140.\nTumblin, J. and Rushmeier, H. E. (1993). Tone reproduction for realistic images. IEEE\nComputer Graphics and Applications, 13(6):42–48.\nTumblin, J. and Turk, G. (1999). LCIS: A boundary hierarchy for detail-preserving contrast\nreduction. In ACM SIGGRAPH 1999 Conference Proceedings, pp. 83–90, Los Angeles.\nTumblin, J., Agrawal, A., and Raskar, R.\n(2005).\nWhy I want a gradient camera.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 103–110, San Diego, CA.\nTurcot, P. and Lowe, D. G. (2009). Better matching with fewer features: The selection of\nuseful features in large database recognition problems. In ICCV Workshop on Emergent\nIssues in Large Amounts of Visual Data (WS-LAVD), Kyoto, Japan.\nTurk, G. and Levoy, M. (1994). Zippered polygonal meshes from range images. In ACM\nSIGGRAPH 1994 Conference Proceedings, pp. 311–318.\nTurk, G. and O’Brien, J. (2002). Modelling with implicit surfaces that interpolate. ACM\nTransactions on Graphics, 21(4):855–873.\nTurk, M. and Pentland, A. (1991a). Eigenfaces for recognition. Journal of Cognitive\nNeuroscience, 3(1):71–86.\nTurk, M. and Pentland, A. (1991b). Face recognition using eigenfaces. In IEEE Computer\nSociety Conference on Computer Vision and Pattern Recognition (CVPR’91), pp. 586–\n591, Maui, Hawaii.\nTuytelaars, T. and Mikolajczyk, K. (2007). Local invariant feature detectors. Foundations\nand Trends in Computer Graphics and Computer Vision, 3(1).\nTuytelaars, T. and Van Gool, L. (2004). Matching widely separated views based on afﬁne\ninvariant regions. International Journal of Computer Vision, 59(1):61–85.\nTuytelaars, T., Van Gool, L., and Proesmans, M. (1997). The cascaded Hough transform.\nIn International Conference on Image Processing (ICIP’97), pp. 736–739.",
  "image_path": "page_935.jpg",
  "pages": [
    934,
    935,
    936
  ]
}