{
  "doc_id": "pages_512_514",
  "text": "490\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\nFigure 10.21 Local tone mapping using linear ﬁlters: (a) low-pass and high-pass ﬁltered log\nluminance images and color (chrominance) image; (b) resulting tone-mapped image (after at-\ntenuating the low-pass log luminance image) shows visible halos around the trees. Processed\nimages courtesy of Fr´edo Durand, MIT 6.815/6.865 course on Computational Photography.\n(a)\n(b)\nFigure 10.22 Local tone mapping using bilateral ﬁlter (Durand and Dorsey 2002): (a) low-\npass and high-pass bilateral ﬁltered log luminance images and color (chrominance) image;\n(b) resulting tone-mapped image (after attenuating the low-pass log luminance image) shows\nno halos. Processed images courtesy of Fr´edo Durand, MIT 6.815/6.865 course on Compu-\ntational Photography.\n10.2 High dynamic range imaging\n491\nFigure 10.23 Gaussian vs. bilateral ﬁltering (Petschnigg, Agrawala, Hoppe et al. 2004) c⃝\n2004 ACM: A Gaussian low-pass ﬁlter blurs across all edges and therefore creates strong\npeaks and valleys in the detail image that cause halos. The bilateral ﬁlter does not smooth\nacross strong edges and thereby reduces halos while still capturing detail.\nFigure 10.24\nLocal tone mapping using bilateral ﬁlter (Durand and Dorsey 2002): sum-\nmary of algorithm workﬂow. Images courtesy of Fr´edo Durand, MIT 6.815/6.865 course on\nComputational Photography.\n492\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nlog\nexp\ndiff\nint.\ncompress\n2500:1\n7.5:1\nH(x)\nI(x)\nH’(x)\nG(x)\nFigure 10.25\nGradient domain tone mapping (Fattal, Lischinski, and Werman 2002) c⃝\n2002 ACM. The original image with a dynamic range of 2415:1 is ﬁrst converted into the log\ndomain, H(x), and its gradients are computed, H′(x). These are attenuated (compressed)\nbased on local contrast, G(x), and integrated to produce the new logarithmic exposure image\nI(x), which is exponentiated to produce the ﬁnal intensity image, whose dynamic range is\n7.5:1.\nto obtain the compressed log-luminance image I(x, y). This least squares problem is the\nsame that was used for Poisson blending (Section 9.3.4) and was ﬁrst introduced in our study\nof regularization (Section 3.7.1, 3.100). It can efﬁciently be solved using techniques such\nas multigrid and hierarchical basis preconditioning (Fattal, Lischinski, and Werman 2002;\nSzeliski 2006b; Farbman, Fattal, Lischinski et al. 2008). Once the new luminance image has\nbeen computed, it is combined with the original color image using\nCout =\n\u0012Cin\nLin\n\u0013s\nLout,\n(10.20)\nwhere C = (R, G, B) and Lin and Lout are the original and compressed luminance images.\nThe exponent s controls the saturation of the colors and is typically in the range s ∈[0.4, 0.6].\nFigure 10.26b shows the ﬁnal tone-mapped color image, which shows no visible halos despite\nthe extremely large variation in input radiance values.\nYet another alternative to these two approaches is to perform the local dodging and burn-\ning using a locally scale-selective operator (Reinhard, Stark, Shirley et al. 2002). Figure 10.27\nshows how such a scale selection operator can determine a radius (scale) that only includes",
  "image_path": "page_513.jpg",
  "pages": [
    512,
    513,
    514
  ]
}