{
  "doc_id": "pages_855_857",
  "text": "References\n833\nGong, M., Yang, R., Wang, L., and Gong, M. (2007). A performance study on different\ncost aggregation approaches used in realtime stereo matching. International Journal of\nComputer Vision, 75(2):283–296.\nGonzales, R. C. and Woods, R. E. (2008). Digital Image Processing. Prentice-Hall, Upper\nSaddle River, NJ, 3rd edition.\nGooch, B. and Gooch, A. (2001). Non-Photorealistic Rendering. A K Peters, Ltd, Natick,\nMassachusetts.\nGordon, I. and Lowe, D. G. (2006). What and where: 3D object recognition with accurate\npose. In Ponce, J., Hebert, M., Schmid, C., and Zisserman, A. (eds), Toward Category-\nLevel Object Recognition, pp. 67–82, Springer, New York.\nGorelick, L., Blank, M., Shechtman, E., Irani, M., and Basri, R.\n(2007).\nActions as\nspace-time shapes. IEEE Transactions on Pattern Analysis and Machine Intelligence,\n29(12):2247–2253.\nGortler, S. J. and Cohen, M. F. (1995). Hierarchical and variational geometric modeling\nwith wavelets. In Symposium on Interactive 3D Graphics, pp. 35–43, Monterey, CA.\nGortler, S. J., Grzeszczuk, R., Szeliski, R., and Cohen, M. F. (1996). The Lumigraph. In\nACM SIGGRAPH 1996 Conference Proceedings, pp. 43–54, New Orleans.\nGoshtasby, A. (1989). Correction of image deformation from lens distortion using B´ezier\npatches. Computer Vision, Graphics, and Image Processing, 47(4):385–394.\nGoshtasby, A. (2005). 2-D and 3-D Image Registration. Wiley, New York.\nGotchev, A. and Rosenhahn, B. (eds). (2009). Proceedings of the 3DTV Conference: The\nTrue Vision—Capture, Transmission and Display of 3D Video, IEEE Computer Society\nPress.\nGovindu, V. M. (2006). Revisiting the brightness constraint: Probabilistic formulation and\nalgorithms. In Ninth European Conference on Computer Vision (ECCV 2006), pp. 177–\n188.\nGrady, L. (2006). Random walks for image segmentation. IEEE Transactions on Pattern\nAnalysis and Machine Intelligence, 28(11):1768–1783.\nGrady, L. (2008). A lattice-preserving multigrid method for solving the inhomogeneous\nPoisson equations used in image analysis. In Tenth European Conference on Computer\nVision (ECCV 2008), pp. 252–264, Marseilles.\nGrady, L. and Ali, S. (2008). Fast approximate random walker segmentation using eigen-\nvector precomputation. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2008), Anchorage, AK.\n834\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nGrady, L. and Alvino, C. (2008). Reformulating and optimizing the Mumford–Shah func-\ntional on a graph — a faster, lower energy solution. In Tenth European Conference on\nComputer Vision (ECCV 2008), pp. 248–261, Marseilles.\nGrauman, K. and Darrell, T. (2005). Efﬁcient image matching with distributions of lo-\ncal invariant features. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’2005), pp. 627–634, San Diego, CA.\nGrauman, K. and Darrell, T. (2007a). Pyramid match hashing: Sub-linear time index-\ning over partial correspondences. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2007), Minneapolis, MN.\nGrauman, K. and Darrell, T. (2007b). The pyramid match kernel: Efﬁcient learning with\nsets of features. Journal of Machine Learning Research, 8:725–760.\nGrauman, K., Shakhnarovich, G., and Darrell, T. (2003). Inferring 3D structure with a\nstatistical image-based shape model. In Ninth International Conference on Computer\nVision (ICCV 2003), pp. 641–648, Nice, France.\nGreene, N. (1986). Environment mapping and other applications of world projections.\nIEEE Computer Graphics and Applications, 6(11):21–29.\nGreene, N. and Heckbert, P. (1986). Creating raster Omnimax images from multiple per-\nspective views using the elliptical weighted average ﬁlter. IEEE Computer Graphics\nand Applications, 6(6):21–27.\nGreig, D., Porteous, B., and Seheult, A. (1989). Exact maximum a posteriori estimation\nfor binary images. Journal of the Royal Statistical Society, Series B, 51(2):271–279.\nGremban, K. D., Thorpe, C. E., and Kanade, T. (1988). Geometric camera calibration\nusing systems of linear equations. In IEEE International Conference on Robotics and\nAutomation, pp. 562–567, Philadelphia.\nGrifﬁn, G., Holub, A., and Perona, P. (2007). Caltech-256 Object Category Dataset. Tech-\nnical Report 7694, California Institute of Technology.\nGrimson, W. E. L. (1983). An implementation of a computational theory of visual surface\ninterpolation. Computer Vision, Graphics, and Image Processing, 22:39–69.\nGrimson, W. E. L. (1985). Computational experiments with a feature based stereo al-\ngorithm.\nIEEE Transactions on Pattern Analysis and Machine Intelligence, PAMI-\n7(1):17–34.\nGross, R., Matthews, I., and Baker, S. (2006). Active appearance models with occlusion.\nImage and Vision Computing, 24(6):593–604.\nGross, R., Shi, J., and Cohn, J. F. (2005). Quo vadis face recognition? In IEEE Workshop\non Empirical Evaluation Methods in Computer Vision, San Diego.\nReferences\n835\nGross, R., Baker, S., Matthews, I., and Kanade, T. (2005). Face recognition across pose\nand illumination. In Li, S. Z. and Jain, A. K. (eds), Handbook of Face Recognition,\nSpringer.\nGross, R., Sweeney, L., De la Torre, F., and Baker, S. (2008). Semi-supervised learning of\nmulti-factor models for face de-identiﬁcation. In IEEE Computer Society Conference\non Computer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nGross, R., Matthews, I., Cohn, J., Kanade, T., and Baker, S. (2010). Multi-PIE. Image and\nVision Computing, 28(5):807–813.\nGrossberg, M. D. and Nayar, S. K. (2001). A general imaging model and a method for\nﬁnding its parameters. In Eighth International Conference on Computer Vision (ICCV\n2001), pp. 108–115, Vancouver, Canada.\nGrossberg, M. D. and Nayar, S. K. (2004). Modeling the space of camera response func-\ntions. IEEE Transactions on Pattern Analysis and Machine Intelligence, 26(10):1272–\n1282.\nGu, C., Lim, J., Arbelaez, P., and Malik, J. (2009). Recognition using regions. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR\n2009), Miami Beach, FL.\nGu, X., Gortler, S. J., and Hoppe, H. (2002). Geometry images. ACM Transactions on\nGraphics, 21(3):355–361.\nGuan, P., Weiss, A., Bˇalan, A. O., and Black, M. J. (2009). Estimating human shape and\npose from a single image. In Twelfth International Conference on Computer Vision\n(ICCV 2009), Kyoto, Japan.\nGuennebaud, G. and Gross, M. (2007). Algebraic point set surfaces. ACM Transactions on\nGraphics, 26(3).\nGuennebaud, G., Germann, M., and Gross, M. (2008). Dynamic sampling and rendering\nof algebraic point set surfaces. Computer Graphics Forum, 27(2):653–662.\nGuenter, B., Grimm, C., Wood, D., Malvar, H., and Pighin, F. (1998). Making faces. In\nACM SIGGRAPH 1998 Conference Proceedings, pp. 55–66.\nGuillaumin, M., Verbeek, J., and Schmid, C. (2009). Is that you? Metric learning ap-\nproaches for face identiﬁcation. In Twelfth International Conference on Computer Vi-\nsion (ICCV 2009), Kyoto, Japan.\nGulbins, J. and Gulbins, R. (2009). Photographic Multishot Techniques: High Dynamic\nRange, Super-Resolution, Extended Depth of Field, Stitching. Rocky Nook.",
  "image_path": "page_856.jpg",
  "pages": [
    855,
    856,
    857
  ]
}