{
  "doc_id": "pages_370_372",
  "text": "348\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n       epipolar plane\np∞\np\n(R,t)\nc0\nc1\nepipolar\nlines\nx\n0\ne0\ne1\nx1\nl1\nl0\nFigure 7.3 Epipolar geometry: The vectors t = c1 −c0, p −c0 and p −c1 are co-planar\nand deﬁne the basic epipolar constraint expressed in terms of the pixel measurements x0 and\nx1.\nTaking the dot product of both sides with ˆx1 yields\nd0ˆxT\n1 ([t]×R)ˆx0 = d1ˆxT\n1 [t]×ˆx1 = 0,\n(7.9)\nsince the right hand side is a triple product with two identical entries. (Another way to say\nthis is that the cross product matrix [t]× is skew symmetric and returns 0 when pre- and\npost-multiplied by the same vector.)\nWe therefore arrive at the basic epipolar constraint\nˆxT\n1 E ˆx0 = 0,\n(7.10)\nwhere\nE = [t]×R\n(7.11)\nis called the essential matrix (Longuet-Higgins 1981).\nAn alternative way to derive the epipolar constraint is to notice that in order for the cam-\neras to be oriented so that the rays ˆx0 and ˆx1 intersect in 3D at point p, the vectors connecting\nthe two camera centers c1 −c0 = −R−1\n1 t and the rays corresponding to pixels x0 and x1,\nnamely R−1\nj\nˆxj, must be co-planar. This requires that the triple product\n(ˆx0, R−1ˆx1, −R−1t) = (Rˆx0, ˆx1, −t) = ˆx1 · (t × Rˆx0) = ˆxT\n1 ([t]×R)ˆx0 = 0.\n(7.12)\nNotice that the essential matrix E maps a point ˆx0 in image 0 into a line l1 = Eˆx0\nin image 1, since ˆxT\n1 l1 = 0 (Figure 7.3). All such lines must pass through the second\nepipole e1, which is therefore deﬁned as the left singular vector of E with a 0 singular value,\nor, equivalently, the projection of the vector t into image 1. The dual (transpose) of these\n7.2 Two-frame structure from motion\n349\nrelationships gives us the epipolar line in the ﬁrst image as l0 = ET ˆx1 and e0 as the zero-\nvalue right singular vector of E.\nGiven this fundamental relationship (7.10), how can we use it to recover the camera\nmotion encoded in the essential matrix E?\nIf we have N corresponding measurements\n{(xi0, xi1)}, we can form N homogeneous equations in the nine elements of E = {e00 . . . e22},\nxi0xi1e00\n+\nyi0xi1e01\n+\nxi1e02\n+\nxi0yi1e00\n+\nyi0yi1e11\n+\nyi1e12\n+\nxi0e20\n+\nyi0e21\n+\ne22\n=\n0\n(7.13)\nwhere xij = (xij, yij, 1). This can be written more compactly as\n[xi1 xT\ni0] ⊗E = Zi ⊗E = zi · f = 0,\n(7.14)\nwhere ⊗indicates an element-wise multiplication and summation of matrix elements, and zi\nand f are the rasterized (vector) forms of the Zi = ˆxi1ˆxT\ni0 and E matrices.2 Given N ≥8\nsuch equations, we can compute an estimate (up to scale) for the entries in E using an SVD.\nIn the presence of noisy measurements, how close is this estimate to being statistically\noptimal? If you look at the entries in (7.13), you can see that some entries are the products\nof image measurements such as xi0yi1 and others are direct image measurements (or even\nthe identity). If the measurements have comparable noise, the terms that are products of\nmeasurements have their noise ampliﬁed by the other element in the product, which can lead\nto very poor scaling, e.g., an inordinately large inﬂuence of points with large coordinates (far\naway from the image center).\nIn order to counteract this trend, Hartley (1997a) suggests that the point coordinates\nshould be translated and scaled so that their centroid lies at the origin and their variance\nis unity, i.e.,\n˜xi\n=\ns(xi −µx)\n(7.15)\n˜yi\n=\ns(xi −µy)\n(7.16)\nsuch that P\ni ˜xi = P\ni ˜yi = 0 and P\ni ˜x2\ni + P\ni ˜y2\ni = 2n, where n is the number of points.3\nOnce the essential matrix ˜E has been computed from the transformed coordinates\n{(˜xi0, ˜xi1)}, where ˜xij = T j ˆxij, the original essential matrix E can be recovered as\nE = T 1 ˜ET 0.\n(7.17)\n2 We use f instead of e to denote the rasterized form of E to avoid confusion with the epipoles ej.\n3 More precisely, Hartley (1997a) suggests scaling the points “so that the average distance from the origin is equal\nto\n√\n2” but the heuristic of unit variance is faster to compute (does not require per-point square roots) and should\nyield comparable improvements.\n350\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nIn his paper, Hartley (1997a) compares the improvement due to his re-normalization strategy\nto alternative distance measures proposed by others such as Zhang (1998a,b) and concludes\nthat his simple re-normalization in most cases is as effective as (or better than) alternative\ntechniques. Torr and Fitzgibbon (2004) recommend a variant on this algorithm where the\nnorm of the upper 2 × 2 sub-matrix of E is set to 1 and show that it has even better stability\nwith respect to 2D coordinate transformations.\nOnce an estimate for the essential matrix E has been recovered, the direction of the trans-\nlation vector t can be estimated. Note that the absolute distance between the two cameras can\nnever be recovered from pure image measurements alone, regardless of how many cameras\nor points are used. Knowledge about absolute camera and point positions or distances, of-\nten called ground control points in photogrammetry, is always required to establish the ﬁnal\nscale, position, and orientation.\nTo estimate this direction ˆt, observe that under ideal noise-free conditions, the essential\nmatrix E is singular, i.e., ˆt\nT E = 0. This singularity shows up as a singular value of 0 when\nan SVD of E is performed,\nE = [ˆt]×R = UΣV T =\nh\nu0\nu1\nˆt\ni\n\n\n1\n1\n0\n\n\n\n\nvT\n0\nvT\n1\nvT\n2\n\n\n(7.18)\nWhen E is computed from noisy measurements, the singular vector associated with the small-\nest singular value gives us ˆt. (The other two singular values should be similar but are not, in\ngeneral, equal to 1 because E is only computed up to an unknown scale.)\nBecause E is rank-deﬁcient, it turns out that we actually only need seven correspondences\nof the form of Equation (7.14) instead of eight to estimate this matrix (Hartley 1994a; Torr and\nMurray 1997; Hartley and Zisserman 2004). (The advantage of using fewer correspondences\ninside a RANSAC robust ﬁtting stage is that fewer random samples need to be generated.)\nFrom this set of seven homogeneous equations (which we can stack into a 7 × 9 matrix for\nSVD analysis), we can ﬁnd two independent vectors, say f 0 and f 1 such that zi · f j = 0.\nThese two vectors can be converted back into 3 × 3 matrices E0 and E1, which span the\nsolution space for\nE = αE0 + (1 −α)E1.\n(7.19)\nTo ﬁnd the correct value of α, we observe that E has a zero determinant, since it is rank\ndeﬁcient, and hence\ndet |αE0 + (1 −α)E1| = 0.\n(7.20)\nThis gives us a cubic equation in α, which has either one or three solutions (roots). Substitut-\ning these values into (7.19) to obtain E, we can test this essential matrix against other unused\nfeature correspondences to select the correct one.",
  "image_path": "page_371.jpg",
  "pages": [
    370,
    371,
    372
  ]
}