{
  "doc_id": "pages_516_518",
  "text": "494\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nFigure 10.27\nScale selection for tone mapping (Reinhard, Stark, Shirley et al. 2002) c⃝\n2002 ACM.\nping by setting target exposure values at each pixel and allowing the weighted least squares\nto convert these into piecewise smooth adjustment maps.\nThe weighted least squares algorithm, which was originally developed for image coloriza-\ntion applications (Levin, Lischinski, and Weiss 2004), has recently been applied to general\nedge-preserving smoothing in applications such as contrast enhancement (Bae, Paris, and\nDurand 2006) and tone mapping (Farbman, Fattal, Lischinski et al. 2008) where the bilateral\nﬁltering was previously used. It can also be used to perform HDR merging and tone mapping\nsimultaneously (Raman and Chaudhuri 2007, 2009).\nGiven the wide range of locally adaptive tone mapping algorithms that have been devel-\noped, which ones should be used in practice? Freeman (2008) provides a great discussion\nof commercially available algorithms, their artifacts, and the parameters that can be used to\ncontrol them. He also has a wealth of tips for HDR photography and workﬂow. I highly rec-\nommend his book for anyone contemplating additional research (or personal photography) in\nthis area.\n10.2.2 Application: Flash photography\nWhile high dynamic range imaging combines images of a scene taken at different exposures,\nit is also possible to combine ﬂash and non-ﬂash images to achieve better exposure and color\nbalance and to reduce noise (Eisemann and Durand 2004; Petschnigg, Agrawala, Hoppe et\nal. 2004).\nThe problem with ﬂash images is that the color is often unnatural (it fails to capture the\nambient illumination), there may be strong shadows or specularities, and there is a radial\nfalloff in brightness away from the camera (Figures 10.1b and 10.29a). Non-ﬂash photos\n2006b). Their default parameter settings are λ = 0.2, α = 1, and ϵ = 0.0001.\n10.2 High dynamic range imaging\n495\n(a)\n(b)\nFigure 10.28 Interactive local tone mapping (Lischinski, Farbman, Uyttendaele et al. 2006b)\nc⃝2006 ACM: (a) user-drawn strokes with associated exposure values g(x, y) (b) correspond-\ning piecewise-smooth exposure adjustment map f(x, y).\n(a)\n(b)\n(c)\n(d)\nFigure 10.29 Detail transfer in ﬂash/no-ﬂash photography (Petschnigg, Agrawala, Hoppe et\nal. 2004) c⃝2004 ACM: (a) details of input ambient A and ﬂash F images; (b) joint bilaterally\nﬁltered no-ﬂash image ANR; (c) detail layer F Detail computed from the ﬂash image F; (d)\nﬁnal merged image AFinal.\n496\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\ntaken under low light conditions often suffer from excessive noise (because of the high ISO\ngains and low photon counts) and blur (due to longer exposures). Is there some way to\ncombine a non-ﬂash photo taken just before the ﬂash goes off with the ﬂash photo to produce\nan image with good color values, sharpness, and low noise?15\nPetschnigg, Agrawala, Hoppe et al. (2004) approach this problem by ﬁrst ﬁltering the no-\nﬂash (ambient) image A with a variant of the bilateral ﬁlter called the joint bilateral ﬁlter16\nin which the range kernel (3.36)\nr(i, j, k, l) = exp\n\u0012\n−∥f(i, j) −f(k, l)∥2\n2σ2r\n\u0013\n(10.23)\nis evaluated on the ﬂash image F instead of the ambient image A, since the ﬂash image is less\nnoisy and hence has more reliable edges (Figure 10.29b). Because the contents of the ﬂash\nimage can be unreliable inside and at the boundaries of shadows and specularities, these are\ndetected and a regular bilaterally ﬁltered image ABase is used instead (Figure 10.30).\nThe second stage of their algorithm computes a ﬂash detail image\nF Detail =\nF + ϵ\nF Base + ϵ,\n(10.24)\nwhere F Base is a bilaterally ﬁltered version of the ﬂash image F and ϵ = 0.02. This detail im-\nage (Figure 10.29c) encodes details that may have been ﬁltered away from the noise-reduced\nno-ﬂash image ANR, as well as additional details created by the ﬂash camera, which often\nadd crispness. The detail image is used to modulate the noise-reduced ambient image ANR\nto produce the ﬁnal results\nAFinal = (1 −M)ANRF Detail + MABase\n(10.25)\nshown in Figures 10.1b and 10.29d.\nEisemann and Durand (2004) present an alternative algorithm that shares some of the\nsame basic concepts. Both papers are well worth reading and contrasting (Exercise 10.6).\nFlash images can also be used for a variety of additional applications such as extracting\nmore reliable foreground mattes of objects (Raskar, Tan, Feris et al. 2004; Sun, Li, Kang et al.\n2006). Flash photography is just one instance of the more general topic of active illumination,\nwhich is discussed in more detail by Raskar and Tumblin (2010).\n15 In fact, the discontinued FujiFilm FinePix F40fd camera takes a pair of ﬂash and no ﬂash images in quick\nsuccession; however, it only lets you decide to keep one of them.\n16 Eisemann and Durand (2004) call this the cross bilateral ﬁlter.",
  "image_path": "page_517.jpg",
  "pages": [
    516,
    517,
    518
  ]
}