{
  "doc_id": "pages_123_125",
  "text": "3.1 Point operators\n101\nNow that we have seen how images are formed through the interaction of 3D scene elements,\nlighting, and camera optics and sensors, let us look at the ﬁrst stage in most computer vision\napplications, namely the use of image processing to preprocess the image and convert it into\na form suitable for further analysis. Examples of such operations include exposure correction\nand color balancing, the reduction of image noise, increasing sharpness, or straightening the\nimage by rotating it (Figure 3.1). While some may consider image processing to be outside\nthe purview of computer vision, most computer vision applications, such as computational\nphotography and even recognition, require care in designing the image processing stages in\norder to achieve acceptable results.\nIn this chapter, we review standard image processing operators that map pixel values from\none image to another. Image processing is often taught in electrical engineering departments\nas a follow-on course to an introductory course in signal processing (Oppenheim and Schafer\n1996; Oppenheim, Schafer, and Buck 1999). There are several popular textbooks for image\nprocessing (Crane 1997; Gomes and Velho 1997; J¨ahne 1997; Pratt 2007; Russ 2007; Burger\nand Burge 2008; Gonzales and Woods 2008).\nWe begin this chapter with the simplest kind of image transforms, namely those that\nmanipulate each pixel independently of its neighbors (Section 3.1). Such transforms are of-\nten called point operators or point processes. Next, we examine neighborhood (area-based)\noperators, where each new pixel’s value depends on a small number of neighboring input\nvalues (Sections 3.2 and 3.3). A convenient tool to analyze (and sometimes accelerate) such\nneighborhood operations is the Fourier Transform, which we cover in Section 3.4. Neighbor-\nhood operators can be cascaded to form image pyramids and wavelets, which are useful for\nanalyzing images at a variety of resolutions (scales) and for accelerating certain operations\n(Section 3.5). Another important class of global operators are geometric transformations,\nsuch as rotations, shears, and perspective deformations (Section 3.6). Finally, we introduce\nglobal optimization approaches to image processing, which involve the minimization of an\nenergy functional or, equivalently, optimal estimation using Bayesian Markov random ﬁeld\nmodels (Section 3.7).\n3.1 Point operators\nThe simplest kinds of image processing transforms are point operators, where each output\npixel’s value depends on only the corresponding input pixel value (plus, potentially, some\nglobally collected information or parameters). Examples of such operators include brightness\nand contrast adjustments (Figure 3.2) as well as color correction and transformations. In the\nimage processing literature, such operations are also known as point processes (Crane 1997).\nWe begin this section with a quick review of simple point operators such as brightness\n102\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFigure 3.2 Some local image processing operations: (a) original image along with its three\ncolor (per-channel) histograms; (b) brightness increased (additive offset, b = 16); (c) contrast\nincreased (multiplicative gain, a = 1.1); (d) gamma (partially) linearized (γ = 1.2); (e) full\nhistogram equalization; (f) partial histogram equalization.\n3.1 Point operators\n103\n45\n60\n98\n127 132 133 137 133\n46\n65\n98\n123 126 128 131 133\n47\n65\n96\n115 119 123 135 137\n47\n63\n91\n107 113 122 138 134\n50\n59\n80\n97\n110 123 133 134\n49\n53\n68\n83\n97\n113 128 133\n50\n50\n58\n70\n84\n102 116 126\n50\n50\n52\n58\n69\n86\n101 120\n1\n3\n5\n7\n9\n11\n13\n15\nS1\nS2\nS3\nS4\nS5\nS6\nS7\nS8\nS9\nS10\nS11\nS12\nS13\nS14\nS15\nS16\n0\n20\n40\n60\n80\n100\n120\n140\n160\nrange\ndomain\ndomain\n(a)\n(b)\n(c)\n(d)\nFigure 3.3 Visualizing image data: (a) original image; (b) cropped portion and scanline plot\nusing an image inspection tool; (c) grid of numbers; (d) surface plot. For ﬁgures (c)–(d), the\nimage was ﬁrst converted to grayscale.\nscaling and image addition. Next, we discuss how colors in images can be manipulated.\nWe then present image compositing and matting operations, which play an important role\nin computational photography (Chapter 10) and computer graphics applications. Finally, we\ndescribe the more global process of histogram equalization. We close with an example appli-\ncation that manipulates tonal values (exposure and contrast) to improve image appearance.\n3.1.1 Pixel transforms\nA general image processing operator is a function that takes one or more input images and\nproduces an output image. In the continuous domain, this can be denoted as\ng(x) = h(f(x)) or g(x) = h(f0(x), . . . , fn(x)),\n(3.1)\nwhere x is in the D-dimensional domain of the functions (usually D = 2 for images) and the\nfunctions f and g operate over some range, which can either be scalar or vector-valued, e.g.,\nfor color images or 2D motion. For discrete (sampled) images, the domain consists of a ﬁnite\nnumber of pixel locations, x = (i, j), and we can write\ng(i, j) = h(f(i, j)).\n(3.2)\nFigure 3.3 shows how an image can be represented either by its color (appearance), as a grid\nof numbers, or as a two-dimensional function (surface plot).\nTwo commonly used point processes are multiplication and addition with a constant,\ng(x) = af(x) + b.\n(3.3)\nThe parameters a > 0 and b are often called the gain and bias parameters; sometimes these\nparameters are said to control contrast and brightness, respectively (Figures 3.2b–c).1 The\n1 An image’s luminance characteristics can also be summarized by its key (average luminanance) and range\n(Kopf, Uyttendaele, Deussen et al. 2007).",
  "image_path": "page_124.jpg",
  "pages": [
    123,
    124,
    125
  ]
}