{
  "doc_id": "pages_886_888",
  "text": "864\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nMagnor, M. and Girod, B.\n(2000).\nData compression for light-ﬁeld rendering.\nIEEE\nTransactions on Circuits and Systems for Video Technology, 10(3):338–343.\nMagnor, M., Ramanathan, P., and Girod, B. (2003). Multi-view coding for image-based\nrendering using 3-D scene geometry. IEEE Transactions on Circuits and Systems for\nVideo Technology, 13(11):1092–1106.\nMahajan, D., Huang, F.-C., Matusik, W., Ramamoorthi, R., and Belhumeur, P. (2009).\nMoving gradients: A path-based method for plausible image interpolation. ACM Trans-\nactions on Graphics, 28(3).\nMaimone, M., Cheng, Y., and Matthies, L. (2007). Two years of visual odometry on the\nMars exploration rovers. Journal of Field Robotics, 24(3).\nMaire, M., Arbelaez, P., Fowlkes, C., and Malik, J.\n(2008).\nUsing contours to detect\nand localize junctions in natural images. In IEEE Computer Society Conference on\nComputer Vision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nMaitin-Shepard, J., Cusumano-Towner, M., Lei, J., and Abbeel, P. (2010). Cloth grasp\npoint detection based on multiple-view geometric cues with application to robotic towel\nfolding. In IEEE International Conference on Robotics and Automation, Anchorage,\nAK.\nMaitre, M., Shinagawa, Y., and Do, M. N. (2008). Symmetric multi-view stereo reconstruc-\ntion from planar camera arrays. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nMaji, S., Berg, A., and Malik, J. (2008). Classiﬁcation using intersection kernel support\nvector machines is efﬁcient. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR 2008), Anchorage, AK.\nMalik, J. and Rosenholtz, R. (1997). Computing local surface orientation and shape from\ntexture for curved surfaces. International Journal of Computer Vision, 23(2):149–168.\nMalik, J., Belongie, S., Leung, T., and Shi, J. (2001). Contour and texture analysis for\nimage segmentation. International Journal of Computer Vision, 43(1):7–27.\nMalisiewicz, T. and Efros, A. A. (2008). Recognition by association via learning per-\nexemplar distances. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR 2008), Anchorage, AK.\nMalladi, R., Sethian, J. A., and Vemuri, B. C. (1995). Shape modeling with front propaga-\ntion. IEEE Transactions on Pattern Analysis and Machine Intelligence, 17(2):158–176.\nMallat, S. G. (1989). A theory for multiresolution signal decomposition: the wavelet rep-\nresentation. IEEE Transactions on Pattern Analysis and Machine Intelligence, PAMI-\n11(7):674–693.\nReferences\n865\nMalvar, H. S. (1990). Lapped transforms for efﬁcient transform/subband coding. IEEE\nTransactions on Acoustics, Speech, and Signal Processing, 38(6):969–978.\nMalvar, H. S. (1998). Biorthogonal and nonuniform lapped transforms for transform cod-\ning with reduced blocking and ringing artifacts. IEEE Transactions on Signal Process-\ning, 46(4):1043–1053.\nMalvar, H. S. (2000). Fast progressive image coding without wavelets. In IEEE Data\nCompressions Conference, pp. 243–252, Snowbird, UT.\nMalvar, H. S., He, L.-W., and Cutler, R.\n(2004).\nHigh-quality linear interpolation for\ndemosaicing of Bayer-patterned color images. In IEEE International Conference on\nAcoustics, Speech, and Signal Processing (ICASSP’04), pp. 485–488, Montreal.\nMancini, T. A. and Wolff, L. B. (1992). 3D shape and light source location from depth and\nreﬂectance. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR’92), pp. 707–709, Champaign, Illinois.\nManjunathi, B. S. and Ma, W. Y. (1996). Texture features for browsing and retrieval of im-\nage data. IEEE Transactions on Pattern Analysis and Machine Intelligence, 18(8):837–\n842.\nMann, S. and Picard, R. W. (1994). Virtual bellows: Constructing high-quality images\nfrom video. In First IEEE International Conference on Image Processing (ICIP-94),\npp. 363–367, Austin.\nMann, S. and Picard, R. W. (1995). On being ‘undigital’ with digital cameras: Extend-\ning dynamic range by combining differently exposed pictures. In IS&T’s 48th Annual\nConference, pp. 422–428, Washington, D. C.\nManning, C. D., Raghavan, P., and Sch¨utze, H. (2008). Introduction to Information Re-\ntrieval. Cambridge University Press.\nMarquardt, D. W. (1963). An algorithm for least-squares estimation of nonlinear parame-\nters. Journal of the Society for Industrial and Applied Mathematics, 11(2):431–441.\nMarr, D. (1982). Vision: A Computational Investigation into the Human Representation\nand Processing of Visual Information. W. H. Freeman, San Francisco.\nMarr, D. and Hildreth, E. (1980). Theory of edge detection. Proceedings of the Royal\nSociety of London, B 207:187–217.\nMarr, D. and Nishihara, H. K. (1978). Representation and recognition of the spatial orga-\nnization of three-dimensional shapes. Proc. Roy. Soc. London, B, 200:269–294.\nMarr, D. and Poggio, T. (1976). Cooperative computation of stereo disparity. Science,\n194:283–287.\n866\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nMarr, D. C. and Poggio, T. (1979). A computational theory of human stereo vision. Pro-\nceedings of the Royal Society of London, B 204:301–328.\nMarroquin, J., Mitter, S., and Poggio, T. (1985). Probabilistic solution of ill-posed prob-\nlems in computational vision. In Image Understanding Workshop, pp. 293–309, Miami\nBeach.\nMarroquin, J., Mitter, S., and Poggio, T.\n(1987).\nProbabilistic solution of ill-posed\nproblems in computational vision.\nJournal of the American Statistical Association,\n82(397):76–89.\nMarroquin, J. L. (1983). Design of Cooperative Networks. Working Paper 253, Artiﬁcial\nIntelligence Laboratory, Massachusetts Institute of Technology.\nMartin, D., Fowlkes, C., and Malik, J. (2004). Learning to detect natural image boundaries\nusing local brightness, color, and texture cues. IEEE Transactions on Pattern Analysis\nand Machine Intelligence, 26(5):530–549.\nMartin, D., Fowlkes, C., Tal, D., and Malik, J. (2001). A database of human segmented\nnatural images and its application to evaluating segmentation algorithms and measuring\necological statistics. In Eighth International Conference on Computer Vision (ICCV\n2001), pp. 416–423, Vancouver, Canada.\nMartin, W. N. and Aggarwal, J. K. (1983). Volumetric description of objects from mul-\ntiple views. IEEE Transactions on Pattern Analysis and Machine Intelligence, PAMI-\n5(2):150–158.\nMartinec, D. and Pajdla, T. (2007). Robust rotation and translation estimation in multiview\nreconstruction. In IEEE Computer Society Conference on Computer Vision and Pattern\nRecognition (CVPR 2007), Minneapolis, MN.\nMassey, M. and Bender, W. (1996). Salient stills: Process and practice. IBM Systems\nJournal, 35(3&4):557–573.\nMatas, J., Chum, O., Urban, M., and Pajdla, T. (2004). Robust wide baseline stereo from\nmaximally stable extremal regions. Image and Vision Computing, 22(10):761–767.\nMatei, B. C. and Meer, P. (2006). Estimation of nonlinear errors-in-variables models for\ncomputer vision applications.\nIEEE Transactions on Pattern Analysis and Machine\nIntelligence, 28(10):1537–1552.\nMatsushita, Y. and Lin, S.\n(2007).\nRadiometric calibration from noise distributions.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR 2007), Minneapolis, MN.\nMatsushita, Y., Ofek, E., Ge, W., Tang, X., and Shum, H.-Y. (2006). Full-frame video sta-\nbilization with motion inpainting. IEEE Transactions on Pattern Analysis and Machine",
  "image_path": "page_887.jpg",
  "pages": [
    886,
    887,
    888
  ]
}