{
  "doc_id": "pages_630_632",
  "text": "608\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\nFigure 12.20\nTracking 3D human motion: (a) kinematic chain model for a human hand\n(Rehg, Morris, and Kanade 2003) c⃝2003, reprinted by permission of SAGE; (b) tracking a\nkinematic chain blob model in a video sequence (Bregler, Malik, and Pullen 2004) c⃝2004\nSpringer; (c–d) probabilistic loose-limbed collection of body parts (Sigal, Bhatia, Roth et al.\n2004)\nFigure 12.20a shows the kinematic model for a human hand used by Rehg, Morris, and\nKanade (2003) to track hand motion in a video. As you can see, the attachment points between\nthe ﬁngers and the thumb have two degrees of freedom, while the ﬁnger joints themselves\nhave only one. Using this kind of model can greatly enhance the ability of an edge-based\ntracker to cope with rapid motion, ambiguities in 3D pose, and partial occlusions.\nKinematic chain models are even more widely used for whole body modeling and tracking\n(O’Rourke and Badler 1980; Hogg 1983; Rohr 1994). One popular approach is to associate\nan ellipsoid or superquadric with each rigid limb in the kinematic model, as shown in Fig-\nure 12.20b. This model can then be ﬁtted to each frame in one or more video streams either\nby matching silhouettes extracted from known backgrounds or by matching and tracking the\nlocations of occluding edges (Gavrila and Davis 1996; Kakadiaris and Metaxas 2000; Bre-\ngler, Malik, and Pullen 2004; Kehl and Van Gool 2006). Note that some techniques use 2D\nmodels coupled to 2D measurements, some use 3D measurements (range data or multi-view\nvideo) with 3D models, and some use monocular video to infer and track 3D models directly.\nIt is also possible to use temporal models to improve the tracking of periodic motions,\nsuch as walking, by analyzing the joint angles as functions of time (Polana and Nelson 1997;\nSeitz and Dyer 1997; Cutler and Davis 2000). The generality and applicability of such tech-\nniques can be improved by learning typical motion patterns using principal component anal-\nysis (Sidenbladh, Black, and Fleet 2000; Urtasun, Fleet, and Fua 2006).\nProbabilistic models.\nBecause tracking can be such a difﬁcult task, sophisticated proba-\nbilistic inference techniques are often used to estimate the likely states of the person being\ntracked. One popular approach, called particle ﬁltering (Isard and Blake 1998), was origi-\nnally developed for tracking the outlines of people and hands, as described in Section 5.1.2\n12.6 Model-based reconstruction\n609\nFigure 12.21 Estimating human shape and pose from a single image using a parametric 3D\nmodel (Guan, Weiss, Bˇalan et al. 2009) c⃝2009 IEEE.\n(Figures 5.6–5.8). It was subsequently applied to whole-body tracking (Deutscher, Blake,\nand Reid 2000; Sidenbladh, Black, and Fleet 2000; Deutscher and Reid 2005) and continues\nto be used in modern trackers (Ong, Micilotta, Bowden et al. 2006). Alternative approaches\nto handling the uncertainty inherent in tracking include multiple hypothesis tracking (Cham\nand Rehg 1999) and inﬂated covariances (Sminchisescu and Triggs 2001).\nFigure 12.20c–d shows an example of a sophisticated spatio-temporal probabilistic graph-\nical model called loose-limbed people, which models not only the geometric relationship be-\ntween various limbs, but also their likely temporal dynamics (Sigal, Bhatia, Roth et al. 2004).\nThe conditional probabilities relating various limbs and time instances are learned from train-\ning data, and particle ﬁltering is used to perform the ﬁnal pose inference.\nAdaptive shape modeling.\nAnother essential component of whole body modeling and\ntracking is the ﬁtting of parameterized shape models to visual data. As we saw in Sec-\ntion 12.6.3 (Figure 12.19), the availability of large numbers of registered 3D range scans can\nbe used to create morphable models of shape and appearance (Allen, Curless, and Popovi´c\n2003). Building on this work, Anguelov, Srinivasan, Koller et al. (2005) develop a sophis-\nticated system called SCAPE (Shape Completion and Animation for PEople), which ﬁrst\n610\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nacquires a large number of range scans of different people and of one person in different\nposes, and then registers these scans using semi-automated marker placement. The registered\ndatasets are used to model the variation in shape as a function of personal characteristics and\nskeletal pose, e.g., the bulging of muscles as certain joints are ﬂexed (Figure 12.21, top row).\nThe resulting system can then be used for shape completion, i.e., the recovery of a full 3D\nmesh model from a small number of captured markers, by ﬁnding the best model parameters\nin both shape and pose space that ﬁt the measured data.\nBecause it is constructed completely from scans of people in close-ﬁtting clothing and\nuses a parametric shape model, the SCAPE system cannot cope with people wearing loose-\nﬁtting clothing. B˘alan and Black (2008) overcome this limitation by estimating the body\nshape that ﬁts within the visual hull of the same person observed in multiple poses, while\nVlasic, Baran, Matusik et al. (2008) adapt an initial surface mesh ﬁtted with a parametric\nshape model to better match the visual hull.\nWhile the preceding body ﬁtting and pose estimation systems use multiple views to esti-\nmate body shape, even more recent work by Guan, Weiss, Bˇalan et al. (2009) can ﬁt a human\nshape and pose model to a single image of a person on a natural background. Manual ini-\ntialization is used to estimate a rough pose (skeleton) and height model, and this is then used\nto segment the person’s outline using the Grab Cut segmentation algorithm (Section 5.5).\nThe shape and pose estimate are then reﬁned using a combination of silhouette edge cues\nand shading information (Figure 12.21). The resulting 3D model can be used to create novel\nanimations.\nActivity recognition.\nThe ﬁnal widely studied topic in human modeling is motion, activity,\nand action recognition (Bobick 1997; Hu, Tan, Wang et al. 2004; Hilton, Fua, and Ronfard\n2006). Examples of actions that are commonly recognized include walking and running,\njumping, dancing, picking up objects, sitting down and standing up, and waving. Recent\nrepresentative papers on these topics have been written by Robertson and Reid (2006), Smin-\nchisescu, Kanaujia, and Metaxas (2006), Weinland, Ronfard, and Boyer (2006), Yilmaz and\nShah (2006), and Gorelick, Blank, Shechtman et al. (2007).\n12.7 Recovering texture maps and albedos\nAfter a 3D model of an object or person has been acquired, the ﬁnal step in modeling is\nusually to recover a texture map to describe the object’s surface appearance. This ﬁrst requires\nestablishing a parameterization for the (u, v) texture coordinates as a function of 3D surface\nposition. One simple way to do this is to associate a separate texture map with each triangle\n(or pair of triangles). More space-efﬁcient techniques involve unwrapping the surface onto",
  "image_path": "page_631.jpg",
  "pages": [
    630,
    631,
    632
  ]
}