{
  "doc_id": "pages_940_942",
  "text": "918\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nVogiatzis, G., Torr, P., and Cipolla, R. (2005). Multi-view stereo via volumetric graph-cuts.\nIn IEEE Computer Society Conference on Computer Vision and Pattern Recognition\n(CVPR’2005), pp. 391–398, San Diego, CA.\nVogiatzis, G., Hernandez, C., Torr, P., and Cipolla, R. (2007). Multi-view stereo via volu-\nmetric graph-cuts and occlusion robust photo-consistency. IEEE Transactions on Pat-\ntern Analysis and Machine Intelligence, 29(12):2241–2246.\nvon Ahn, L. and Dabbish, L. (2004). Labeling images with a computer game. In CHI’04:\nSIGCHI Conference on Human Factors in Computing Systems, pp. 319–326, Vienna,\nAustria.\nvon Ahn, L., Liu, R., and Blum, M. (2006). Peekaboom: A game for locating objects\nin images. In CHI’06: SIGCHI Conference on Human Factors in Computing Systems,\npp. 55–64, Montr´eal, Qu´ebec, Canada.\nWainwright, M. J. and Jordan, M. I. (2008). Graphical models, exponential families, and\nvariational inference. Foundations and Trends in Machine Learning, 1(1-2):1–305.\nWainwright, M. J., Jaakkola, T. S., and Willsky, A. S. (2005). MAP estimation via agree-\nment on trees: message-passing and linear programming. IEEE Transactions on Infor-\nmation Theory, 51(11):3697–3717.\nWaithe, P. and Ferrie, F. (1991). From uncertainty to visual exploration. IEEE Transactions\non Pattern Analysis and Machine Intelligence, 13(10):1038–1049.\nWalker, E. L. and Herman, M. (1988). Geometric reasoning for constructing 3D scene\ndescriptions from images. Artiﬁcial Intelligence, 37:275–290.\nWallace, G. K. (1991). The JPEG still picture compression standard. Communications of\nthe ACM, 34(4):30–44.\nWallace, J. R., Cohen, M. F., and Greenberg, D. P. (1987). A two-pass solution to the ren-\ndering equation: A synthesis of ray tracing and radiosity methods. Computer Graphics\n(SIGGRAPH ’87), 21(4):311–320.\nWaltz, D. L. (1975). Understanding line drawings of scenes with shadows. In Winston,\nP. H. (ed.), The Psychology of Computer Vision, McGraw-Hill, New York.\nWang, H. and Oliensis, J. (2010). Shape matching by segmentation averaging. IEEE\nTransactions on Pattern Analysis and Machine Intelligence, 32(4):619–635.\nWang, J. and Cohen, M. F. (2005). An iterative optimization approach for uniﬁed im-\nage segmentation and matting. In Tenth International Conference on Computer Vision\n(ICCV 2005), Beijing, China.\nWang, J. and Cohen, M. F. (2007a). Image and video matting: A survey. Foundations and\nTrends in Computer Graphics and Computer Vision, 3(2).\nReferences\n919\nWang, J. and Cohen, M. F. (2007b). Optimized color sampling for robust matting. In IEEE\nComputer Society Conference on Computer Vision and Pattern Recognition (CVPR\n2007), Minneapolis, MN.\nWang, J. and Cohen, M. F. (2007c). Simultaneous matting and compositing. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR 2007),\nMinneapolis, MN.\nWang, J., Agrawala, M., and Cohen, M. F. (2007). Soft scissors: An interactive tool for\nrealtime high quality matting. ACM Transactions on Graphics, 26(3).\nWang, J., Thiesson, B., Xu, Y., and Cohen, M. (2004). Image and video segmentation\nby anisotropic kernel mean shift. In Eighth European Conference on Computer Vision\n(ECCV 2004), pp. 238–249, Prague.\nWang, J., Bhat, P., Colburn, R. A., Agrawala, M., and Cohen, M. F. (2005). Video cutout.\nACM Transactions on Graphics (Proc. SIGGRAPH 2005), 24(3):585–594.\nWang, J. Y. A. and Adelson, E. H. (1994). Representing moving images with layers. IEEE\nTransactions on Image Processing, 3(5):625–638.\nWang, L., Kang, S. B., Szeliski, R., and Shum, H.-Y. (2001). Optimal texture map re-\nconstruction from multiple views. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR’2001), pp. 347–354, Kauai, Hawaii.\nWang, Y. and Zhu, S.-C. (2003). Modeling textured motion: Particle, wave and sketch. In\nNinth International Conference on Computer Vision (ICCV 2003), pp. 213–220, Nice,\nFrance.\nWang, Z., Bovik, A. C., and Simoncelli, E. P. (2005). Structural approaches to image\nquality assessment. In Bovik, A. C. (ed.), Handbook of Image and Video Processing,\npp. 961–974, Elsevier Academic Press.\nWang, Z., Bovik, A. C., Sheikh, H. R., and Simoncelli, E. P. (2004). Image quality as-\nsessment: From error visibility to structural similarity. IEEE Transactions on Image\nProcessing, 13(4):600–612.\nWang, Z.-F. and Zheng, Z.-G. (2008). A region based stereo matching algorithm using\ncooperative optimization. In IEEE Computer Society Conference on Computer Vision\nand Pattern Recognition (CVPR 2008), Anchorage, AK.\nWard, G. (1992). Measuring and modeling anisotropic reﬂection. Computer Graphics\n(SIGGRAPH ’92), 26(4):265–272.\nWard, G. (1994). The radiance lighting simulation and rendering system. In ACM SIG-\nGRAPH 1994 Conference Proceedings, pp. 459–472.\n920\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nWard, G.\n(2003).\nFast, robust image registration for compositing high dynamic range\nphotographs from hand-held exposures. Journal of Graphics Tools, 8(2):17–30.\nWard, G. (2004). High dynamic range image encodings. http://www.anyhere.com/gward/\nhdrenc/hdr encodings.html.\nWare, C., Arthur, K., and Booth, K. S. (1993). Fish tank virtual reality. In INTERCHI’03,\npp. 37–42, Amsterdam.\nWarren, J. and Weimer, H. (2001). Subdivision Methods for Geometric Design: A Con-\nstructive Approach. Morgan Kaufmann.\nWatanabe, M. and Nayar, S. K. (1998). Rational ﬁlters for passive depth from defocus.\nInternational Journal of Computer Vision, 27(3):203–225.\nWatt, A. (1995). 3D Computer Graphics. Addison-Wesley, Harlow, England, third edition.\nWeber, J. and Malik, J. (1995). Robust computation of optical ﬂow in a multi-scale differ-\nential framework. International Journal of Computer Vision, 14(1):67–81.\nWeber, M., Welling, M., and Perona, P.\n(2000).\nUnsupervised learning of models for\nrecognition. In Sixth European Conference on Computer Vision (ECCV 2000), pp. 18–\n32, Dublin, Ireland.\nWedel, A., Cremers, D., Pock, T., and Bischof, H. (2009). Structure- and motion-adaptive\nregularization for high accuracy optic ﬂow.\nIn Twelfth International Conference on\nComputer Vision (ICCV 2009), Kyoto, Japan.\nWedel, A., Rabe, C., Vaudrey, T., Brox, T., Franke, U., and Cremers, D. (2008). Efﬁcient\ndense scene ﬂow from sparse or dense stereo data. In Tenth European Conference on\nComputer Vision (ECCV 2008), pp. 739–751, Marseilles.\nWei, C. Y. and Quan, L. (2004). Region-based progressive stereo matching. In IEEE Com-\nputer Society Conference on Computer Vision and Pattern Recognition (CVPR’2005),\npp. 106–113, Washington, D. C.\nWei, L.-Y. and Levoy, M. (2000). Fast texture synthesis using tree-structured vector quan-\ntization. In ACM SIGGRAPH 2000 Conference Proceedings, pp. 479–488.\nWeickert, J. (1998). Anisotropic Diffusion in Image Processing. Tuebner, Stuttgart.\nWeickert, J., ter Haar Romeny, B. M., and Viergever, M. A. (1998). Efﬁcient and reli-\nable schemes for nonlinear diffusion ﬁltering. IEEE Transactions on Image Processing,\n7(3):398–410.\nWeinland, D., Ronfard, R., and Boyer, E. (2006). Free viewpoint action recognition using\nmotion history volumes. Computer Vision and Image Understanding, 104(2-3):249–\n257.",
  "image_path": "page_941.jpg",
  "pages": [
    940,
    941,
    942
  ]
}