{
  "doc_id": "pages_637_639",
  "text": "12.8 Additional reading\n615\nWatanabe and Nayar (1998), Chaudhuri and Rajagopalan (1999), and Favaro and Soatto\n(2006). Additional techniques for recovering shape from various kinds of illumination ef-\nfects, including inter-reﬂections (Nayar, Ikeuchi, and Kanade 1991), are discussed in the\nbook on shape recovery edited by Wolff, Shafer, and Healey (1992b).\nActive rangeﬁnding systems, which use laser or natural light illumination projected into\nthe scene, have been described by Besl (1989), Rioux and Bird (1993), Kang, Webb, Zit-\nnick et al. (1995), Curless and Levoy (1995), Curless and Levoy (1996), Proesmans, Van\nGool, and Defoort (1998), Bouguet and Perona (1999), Curless (1999), Hebert (2000), Id-\ndan and Yahav (2001), Goesele, Fuchs, and Seidel (2003), Scharstein and Szeliski (2003),\nDavis, Ramamoorthi, and Rusinkiewicz (2003), Zhang, Curless, and Seitz (2003), Zhang,\nSnavely, Curless et al. (2004), and Moons, Van Gool, and Vergauwen (2010). Individual\nrange scans can be aligned using 3D correspondence and distance optimization techniques\nsuch as iterated closest points and its variants (Besl and McKay 1992; Zhang 1994; Szeliski\nand Lavall´ee 1996; Johnson and Kang 1997; Gold, Rangarajan, Lu et al. 1998; Johnson\nand Hebert 1999; Pulli 1999; David, DeMenthon, Duraiswami et al. 2004; Li and Hartley\n2007; Enqvist, Josephson, and Kahl 2009). Once they have been aligned, range scans can\nbe merged using techniques that model the signed distance of surfaces to volumetric sam-\nple points (Hoppe, DeRose, Duchamp et al. 1992; Curless and Levoy 1996; Hilton, Stoddart,\nIllingworth et al. 1996; Wheeler, Sato, and Ikeuchi 1998; Kazhdan, Bolitho, and Hoppe 2006;\nLempitsky and Boykov 2007; Zach, Pock, and Bischof 2007b; Zach 2008).\nOnce constructed, 3D surfaces can be modeled and manipulated using a variety of three-\ndimensional representations, which include triangle meshes (Eck, DeRose, Duchamp et al.\n1995; Hoppe 1996), splines (Farin 1992, 1996; Lee, Wolberg, and Shin 1996), subdivision\nsurfaces (Stollnitz, DeRose, and Salesin 1996; Zorin, Schr¨oder, and Sweldens 1996; Warren\nand Weimer 2001; Peters and Reif 2008), and geometry images (Gu, Gortler, and Hoppe\n2002). Alternatively, they can be represented as collections of point samples with local ori-\nentation estimates (Hoppe, DeRose, Duchamp et al. 1992; Szeliski and Tonnesen 1992; Turk\nand O’Brien 2002; Pﬁster, Zwicker, van Baar et al. 2000; Alexa, Behr, Cohen-Or et al. 2003;\nPauly, Keiser, Kobbelt et al. 2003; Diebel, Thrun, and Br¨unig 2006; Guennebaud and Gross\n2007; Guennebaud, Germann, and Gross 2008; Oztireli, Guennebaud, and Gross 2008). They\ncan also be modeled using implicit inside–outside characteristic or signed distance functions\nsampled on regular or irregular (octree) volumetric grids (Lavall´ee and Szeliski 1995; Szeliski\nand Lavall´ee 1996; Frisken, Perry, Rockwood et al. 2000; Dinh, Turk, and Slabaugh 2002;\nKazhdan, Bolitho, and Hoppe 2006; Lempitsky and Boykov 2007; Zach, Pock, and Bischof\n2007b; Zach 2008).\nThe literature on model-based 3D reconstruction is extensive. For modeling architecture\nand urban scenes, both interactive and fully automated systems have been developed. A\nspecial journal issue devoted to the reconstruction of large-scale 3D scenes (Zhu and Kanade\n616\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n2008) is a good source of references and Robertson and Cipolla (2009) give a nice description\nof a complete system. Lots of additional references can be found in Section 12.6.1.\nFace and whole body modeling and tracking is a very active sub-ﬁeld of computer vision,\nwith its own conferences and workshops, e.g., the International Conference on Automatic\nFace and Gesture Recognition (FG), the IEEE Workshop on Analysis and Modeling of Faces\nand Gestures, and the International Workshop on Tracking Humans for the Evaluation of their\nMotion in Image Sequences (THEMIS). Recent survey articles on the topic of whole body\nmodeling and tracking include those by Forsyth, Arikan, Ikemoto et al. (2006), Moeslund,\nHilton, and Kr¨uger (2006), and Sigal, Balan, and Black (2010).\n12.9 Exercises\nEx 12.1: Shape from focus\nGrab a series of focused images with a digital SLR set to man-\nual focus (or get one that allows for programmatic focus control) and recover the depth of an\nobject.\n1. Take some calibration images, e.g., of a checkerboard, so you can compute a mapping\nbetween the amount of defocus and the focus setting.\n2. Try both a fronto-parallel planar target and one which is slanted so that it covers the\nworking range of the sensor. Which one works better?\n3. Now put a real object in the scene and perform a similar focus sweep.\n4. For each pixel, compute the local sharpness and ﬁt a parabolic curve over focus settings\nto ﬁnd the most in-focus setting.\n5. Map these focus settings to depth and compare your result to ground truth. If you are\nusing a known simple object, such as sphere or cylinder (a ball or a soda can), it’s easy\nto measure its true shape.\n6. (Optional) See if you can recover the depth map from just two or three focus settings.\n7. (Optional) Use an LCD projector to project artiﬁcial texture onto the scene. Use a pair\nof cameras to compare the accuracy of your shape from focus and shape from stereo\ntechniques.\n8. (Optional) Create an all-in-focus image using the technique of Agarwala, Dontcheva,\nAgrawala et al. (2004).\nEx 12.2: Shadow striping\nImplement the handheld shadow striping system of Bouguet\nand Perona (1999). The basic steps include the following.\n12.9 Exercises\n617\n1. Set up two background planes behind the object of interest and calculate their orienta-\ntion relative to the viewer, e.g., with ﬁducial marks.\n2. Cast a moving shadow with a stick across the scene; record the video or capture the\ndata with a webcam.\n3. Estimate each light plane equation from the projections of the cast shadow against the\ntwo backgrounds.\n4. Triangulate to the remaining points on each curve to get a 3D stripe and display the\nstripes using a 3D graphics engine.\n5. (Optional) remove the requirement for a known second (vertical) plane and infer its\nlocation (or that of the light source) using the techniques described by Bouguet and\nPerona (1999). The techniques from Exercise 10.9 may also be helpful here.\nEx 12.3: Range data registration\nRegister two or more 3D datasets using either iterated\nclosest points (ICP) (Besl and McKay 1992; Zhang 1994; Gold, Rangarajan, Lu et al. 1998)\nor octree signed distance ﬁelds (Szeliski and Lavall´ee 1996) (Section 12.2.1).\nApply your technique to narrow-baseline stereo pairs, e.g., obtained by moving a cam-\nera around an object, using structure from motion to recover the camera poses, and using a\nstandard stereo matching algorithm.\nEx 12.4: Range data merging\nMerge the datasets that you registered in the previous exer-\ncise using signed distance ﬁelds (Curless and Levoy 1996; Hilton, Stoddart, Illingworth et al.\n1996). You can optionally use an octree to represent and compress this ﬁeld if you already\nimplemented it in the previous registration step.\nExtract a meshed surface model from the signed distance ﬁeld using marching cubes and\ndisplay the resulting model.\nEx 12.5: Surface simpliﬁcation\nUse progressive meshes (Hoppe 1996) or some other tech-\nnique from Section 12.3.2 to create a hierarchical simpliﬁcation of your surface model.\nEx 12.6: Architectural modeler\nBuild a 3D interior or exterior model of some architec-\ntural structure, such as your house, from a series of handheld wide-angle photographs.\n1. Extract lines and vanishing points (Exercises 4.11–4.15) to estimate the dominant di-\nrections in each image.\n2. Use structure from motion to recover all of the camera poses and match up the vanish-\ning points.",
  "image_path": "page_638.jpg",
  "pages": [
    637,
    638,
    639
  ]
}