{
  "doc_id": "pages_606_608",
  "text": "584\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\nFigure 12.4 Real time depth from defocus (Nayar, Watanabe, and Noguchi 1996) c⃝1996\nIEEE: (a) the real-time focus range sensor, which includes a half-silvered mirror between the\ntwo telecentric lenses (lower right), a prism that splits the image into two CCD sensors (lower\nleft), and an edged checkerboard pattern illuminated by a Xenon lamp (top); (b–c) input video\nframes from the two cameras along with (d) the corresponding depth map; (e–f) two frames\n(you can see the texture if you zoom in) and (g) the corresponding 3D mesh model.\n(Savarese, Chen, and Perona 2005; Rozenfeld, Shimshoni, and Lindenbaum 2007). It is is\nalso possible to infer local shape information from specular ﬂow, i.e., the motion of specu-\nlarities when viewed from a moving camera (Oren and Nayar 1997; Zisserman, Giblin, and\nBlake 1989; Swaminathan, Kang, Szeliski et al. 2002).\n12.1.3 Shape from focus\nA strong cue for object depth is the amount of blur, which increases as the object’s surface\nmoves away from the camera’s focusing distance. As shown in Figure 2.19, moving the object\nsurface away from the focus plane increases the circle of confusion, according to a formula\nthat is easy to establish using similar triangles (Exercise 2.4).\nA number of techniques have been developed to estimate depth from the amount of de-\nfocus (depth from defocus) (Pentland 1987; Nayar and Nakagawa 1994; Nayar, Watanabe,\nand Noguchi 1996; Watanabe and Nayar 1998; Chaudhuri and Rajagopalan 1999; Favaro\nand Soatto 2006). In order to make such a technique practical, a number issues need to be\naddressed:\n• The amount of blur increase in both directions as you move away from the focus plane.\nTherefore, it is necessary to use two or more images captured with different focus\n12.2 Active rangeﬁnding\n585\nSurface\nCCD\nLaser\n(a)\nDirection of travel\nObject\nCCD\nCCD image\n    plane\nLaser\nCylindrical lens\nLaser \nsheet\nσz\nσx\n(b)\n(c)\n(d)\nFigure 12.5 Range data scanning (Curless and Levoy 1996) c⃝1996 ACM: (a) a laser dot\non a surface is imaged by a CCD sensor; (b) a laser stripe (sheet) is imaged by the sensor (the\ndeformation of the stripe encodes the distance to the object); (c) the resulting set of 3D points\nare turned into (d) a triangulated mesh.\ndistance settings (Pentland 1987; Nayar, Watanabe, and Noguchi 1996) or to translate\nthe object in depth and look for the point of maximum sharpness (Nayar and Nakagawa\n1994).\n• The magniﬁcation of the object can vary as the focus distance is changed or the object is\nmoved. This can be modeled either explicitly (making correspondence more difﬁcult)\nor using telecentric optics, which approximate an orthographic camera and require an\naperture in front of the lens (Nayar, Watanabe, and Noguchi 1996).\n• The amount of defocus must be reliably estimated. A simple approach is to average the\nsquared gradient in a region but this suffers from several problems, including the image\nmagniﬁcation problem mentioned above. A better solution is to use carefully designed\nrational ﬁlters (Watanabe and Nayar 1998).\nFigure 12.4 shows an example of a real-time depth from defocus sensor, which employs\ntwo imaging chips at slightly different depths sharing a common optical path, as well as an\nactive illumination system that projects a checkerboard pattern from the same direction. As\nyou can see in Figure 12.4b–g, the system produces high-accuracy real-time depth maps for\nboth static and dynamic scenes.\n12.2 Active rangeﬁnding\nAs we have seen in the previous section, actively lighting a scene, whether for the purpose\nof estimating normals using photometric stereo or for adding artiﬁcial texture for shape from\ndefocus, can greatly improve the performance of vision systems. This kind of active illu-\nmination has been used from the earliest days of machine vision to construct highly reliable\n586\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\n(a)\n(b)\n(c)\nFigure 12.6\nShape scanning using cast shadows (Bouguet and Perona 1999) c⃝1999\nSpringer: (a) camera setup with a point light source (a desk lamp without its reﬂector), a\nhand-held stick casting a shadow, and (b) the objects being scanned in front of two planar\nbackgrounds. (c) Real-time depth map using a pulsed illumination system (Iddan and Yahav\n2001) c⃝2001 SPIE.\nsensors for estimating 3D depth images using a variety of rangeﬁnding (or range sensing)\ntechniques (Besl 1989; Curless 1999; Hebert 2000).\nOne of the most popular active illumination sensors is a laser or light stripe sensor, which\nsweeps a plane of light across the scene or object while observing it from an offset viewpoint,\nas shown in Figure 12.5b (Rioux and Bird 1993; Curless and Levoy 1995). As the stripe falls\nacross the object, it deforms its shape according to the shape of the surface it is illuminating.\nIt is then a simple matter of using optical triangulation to estimate the 3D locations of all the\npoints seen in a particular stripe. In more detail, knowledge of the 3D plane equation of the\nlight stripe allows us to infer the 3D location corresponding to each illuminated pixel, as pre-\nviously discussed in (2.70–2.71). The accuracy of light striping techniques can be improved\nby ﬁnding the exact temporal peak in illumination for each pixel (Curless and Levoy 1995).\nThe ﬁnal accuracy of a scanner can be determined using slant edge modulation techniques,\ni.e., by imaging sharp creases in a calibration object (Goesele, Fuchs, and Seidel 2003).\nAn interesting variant on light stripe rangeﬁnding is presented by Bouguet and Perona\n(1999). Instead of projecting a light stripe, they simply wave a stick casting a shadow over a\nscene or object illuminated by a point light source such as a lamp or the sun (Figure 12.6a).\nAs the shadow falls across two background planes whose orientation relative to the cam-\nera is known (or inferred during pre-calibration), the plane equation for each stripe can be\ninferred from the two projected lines, whose 3D equations are known (Figure 12.6b). The\ndeformation of the shadow as it crosses the object being scanned then reveals its 3D shape,\nas with regular light stripe rangeﬁnding (Exercise 12.2). This technique can also be used to\nestimate the 3D geometry of a background scene and how its appearance varies as it moves\ninto shadow, in order to cast new shadows onto the scene (Chuang, Goldman, Curless et al.",
  "image_path": "page_607.jpg",
  "pages": [
    606,
    607,
    608
  ]
}