{
  "doc_id": "pages_906_908",
  "text": "884\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nProesmans, M., Van Gool, L., and Defoort, F. (1998). Reading between the lines – a\nmethod for extracting dynamic 3D with texture. In Sixth International Conference on\nComputer Vision (ICCV’98), pp. 1081–1086, Bombay.\nProtter, M. and Elad, M. (2009). Super resolution with probabilistic motion estimation.\nIEEE Transactions on Image Processing, 18(8):1899–1904.\nPullen, K. and Bregler, C. (2002). Motion capture assisted animation: texturing and syn-\nthesis. ACM Transactions on Graphics, 21(3):501–508.\nPulli, K. (1999). Multiview registration for large data sets. In Second International Confer-\nence on 3D Digital Imaging and Modeling (3DIM’99), pp. 160–168, Ottawa, Canada.\nPulli, K., Abi-Rached, H., Duchamp, T., Shapiro, L., and Stuetzle, W. (1998). Acquisi-\ntion and visualization of colored 3D objects. In International Conference on Pattern\nRecognition (ICPR’98), pp. 11–15.\nQuack, T., Leibe, B., and Van Gool, L.\n(2008).\nWorld-scale mining of objects and\nevents from community photo collections. In Conference on Image and Video Retrieval,\npp. 47–56, Niagara Falls.\nQuam, L. H.\n(1984).\nHierarchical warp stereo.\nIn Image Understanding Workshop,\npp. 149–155, New Orleans.\nQuan, L. and Lan, Z. (1999). Linear N-point camera pose determination. IEEE Transac-\ntions on Pattern Analysis and Machine Intelligence, 21(8):774–780.\nQuan, L. and Mohr, R.\n(1989).\nDetermining perspective structures using hierarchical\nHough transform. Pattern Recognition Letters, 9(4):279–286.\nRabinovich, A., Vedaldi, A., Galleguillos, C., Wiewiora, E., and Belongie, S.\n(2007).\nObjects in context. In Eleventh International Conference on Computer Vision (ICCV\n2007), Rio de Janeiro, Brazil.\nRademacher, P. and Bishop, G. (1998). Multiple-center-of-projection images. In ACM\nSIGGRAPH 1998 Conference Proceedings, pp. 199–206, Orlando.\nRaginsky, M. and Lazebnik, S. (2009). Locality-sensitive binary codes from shift-invariant\nkernels. In Advances in Neural Information Processing Systems.\nRaman, S. and Chaudhuri, S. (2007). A matte-less, variational approach to automatic scene\ncompositing. In Eleventh International Conference on Computer Vision (ICCV 2007),\nRio de Janeiro, Brazil.\nRaman, S. and Chaudhuri, S. (2009). Bilateral ﬁlter based compositing for variable expo-\nsure photography. In Proceedings of Eurographics 2009.\nReferences\n885\nRamanan, D. and Baker, S. (2009). Local distance functions: A taxonomy, new algorithms,\nand an evaluation.\nIn Twelfth International Conference on Computer Vision (ICCV\n2009), Kyoto, Japan.\nRamanan, D., Forsyth, D., and Zisserman, A. (2005). Strike a pose: Tracking people by\nﬁnding stylized poses. In IEEE Computer Society Conference on Computer Vision and\nPattern Recognition (CVPR’2005), pp. 271–278, San Diego, CA.\nRamanarayanan, G. and Bala, K. (2007). Constrained texture synthesis via energy mini-\nmization. IEEE Transactions on Visualization and Computer Graphics, 13(1):167–178.\nRamer, U. (1972). An iterative procedure for the polygonal approximation of plane curves.\nComputer Graphics and Image Processing, 1(3):244–256.\nRamnath, K., Koterba, S., Xiao, J., Hu, C., Matthews, I., Baker, S., Cohn, J., and Kanade, T.\n(2008). Multi-view AAM ﬁtting and construction. International Journal of Computer\nVision, 76(2):183–204.\nRaskar, R. and Tumblin, J. (2010). Computational Photography: Mastering New Tech-\nniques for Lenses, Lighting, and Sensors. A K Peters, Wellesley, Massachusetts.\nRaskar, R., Tan, K.-H., Feris, R., Yu, J., and Turk, M. (2004). Non-photorealistic camera:\nDepth edge detection and stylized rendering using multi-ﬂash imaging. ACM Transac-\ntions on Graphics, 23(3):679–688.\nRav-Acha, A., Kohli, P., Fitzgibbon, A., and Rother, C. (2008). Unwrap mosaics: A new\nrepresentation for video editing. ACM Transactions on Graphics, 27(3).\nRav-Acha, A., Pritch, Y., Lischinski, D., and Peleg, S. (2005). Dynamosaics: Video mo-\nsaics with non-chronological time. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR’2005), pp. 58–65, San Diego, CA.\nRavikumar, P., Agarwal, A., and Wainwright, M. J. (2008). Message-passing for graph-\nstructured linear programs: Proximal projections, convergence and rounding schemes.\nIn International Conference on Machine Learning, pp. 800–807.\nRay, S. F. (2002). Applied Photographic Optics. Focal Press, Oxford, 3rd edition.\nRehg, J. and Kanade, T. (1994). Visual tracking of high DOF articulated structures: an\napplication to human hand tracking. In Third European Conference on Computer Vision\n(ECCV’94), pp. 35–46, Stockholm, Sweden.\nRehg, J. and Witkin, A. (1991). Visual tracking with deformation models. In IEEE Inter-\nnational Conference on Robotics and Automation, pp. 844–850, Sacramento.\nRehg, J., Morris, D. D., and Kanade, T. (2003). Ambiguities in visual tracking of ar-\nticulated objects using two- and three-dimensional models. International Journal of\nRobotics Research, 22(6):393–418.\n886\nComputer Vision: Algorithms and Applications (September 3, 2010 draft)\nReichenbach, S. E., Park, S. K., and Narayanswamy, R. (1991). Characterizing digital\nimage acquisition devices. Optical Engineering, 30(2):170–177.\nReinhard, E., Stark, M., Shirley, P., and Ferwerda, J. (2002). Photographic tone repro-\nduction for digital images. ACM Transactions on Graphics (Proc. SIGGRAPH 2002),\n21(3):267–276.\nReinhard, E., Ward, G., Pattanaik, S., and Debevec, P.\n(2005).\nHigh Dynamic Range\nImaging: Acquisition, Display, and Image-Based Lighting. Morgan Kaufmann.\nRhemann, C., Rother, C., and Gelautz, M. (2008). Improving color modeling for alpha\nmatting. In British Machine Vision Conference (BMVC 2008), Leeds.\nRhemann, C., Rother, C., Rav-Acha, A., and Sharp, T. (2008). High resolution matting via\ninteractive trimap segmentation. In IEEE Computer Society Conference on Computer\nVision and Pattern Recognition (CVPR 2008), Anchorage, AK.\nRhemann, C., Rother, C., Wang, J., Gelautz, M., Kohli, P., and Rott, P. (2009). A per-\nceptually motivated online benchmark for image matting. In IEEE Computer Society\nConference on Computer Vision and Pattern Recognition (CVPR 2009), Miami Beach,\nFL.\nRichardson, I. E. G. (2003). H.264 and MPEG-4 Video Compression: Video Coding for\nNext Generation Multimedia. Wiley.\nRioul, O. and Vetterli, M. (1991). Wavelets and signal processing. IEEE Signal Processing\nMagazine, 8(4):14–38.\nRioux, M. and Bird, T. (1993). White laser, synced scan. IEEE Computer Graphics and\nApplications, 13(3):15–17.\nRioux, M., Bechthold, G., Taylor, D., and Duggan, M. (1987). Design of a large depth\nof view three-dimensional camera for robot vision. Optical Engineering, 26(12):1245–\n1250.\nRiseman, E. M. and Arbib, M. A. (1977). Computational techniques in the visual segmen-\ntation of static scenes. Computer Graphics and Image Processing, 6(3):221–276.\nRitter, G. X. and Wilson, J. N. (2000). Handbook of Computer Vision Algorithms in Image\nAlgebra. CRC Press, Boca Raton, 2nd edition.\nRobert, C. P.\n(2007).\nThe Bayesian Choice: From Decision-Theoretic Foundations to\nComputational Implementation. Springer-Verlag, New York.\nRoberts, L. G. (1965). Machine perception of three-dimensional solids. In Tippett, J. T.,\nBorkowitz, D. A., Clapp, L. C., Koester, C. J., and Vanderburgh Jr., A. (eds), Opti-\ncal and Electro-Optical Information Processing, pp. 159–197, MIT Press, Cambridge,\nMassachusetts.",
  "image_path": "page_907.jpg",
  "pages": [
    906,
    907,
    908
  ]
}